{"text": " LYNN, Massachusetts –Â Seventeen pre-teens, aged 11-15, are dead after a massive fight broke out at a Lynn, Massachusetts middle school over the latest craze, fidget spinners. According to police, several children began arguing about whose fidget spinner was “the best,” and several others began pestering the first group for being “super gay,” and having fidget spinners in the first place. “Before you knew it, we had 60 or 70 kids just attacking each other,” said Darlene McDonald, a 7th grade teacher at Lynn Middle School. “Fidget spinners were being thrown everywhere – I saw one kid take his fidget spinner between his fingers like a pair of brass knuckles, and beat another student in the face repeatedly until one of his eyes simply popped out of his head. It was gruesome, and the most disturbing thing I’ve ever seen. But if they think I’m getting involved in this shit at $14 bucks an hour, they can get real.” Police were called to break up the melee, but by the time they arrived, 13 students had died, and another 24 were injured. Another 4 died later on due to sustained injuries. “We had tried to ban fidget spinners in the school, but the parents, they lobbied to bring them back,” said Principal Grace Marlins. “So we let them play, knowing full well the dangers. I cannot believe that something like this happened over a $1 piece of plastic. Sad thing is, the parents still won’t let us ban them – they just want everything monitored better. It’s crazy.” Fidget spinners are quickly become a problem in many classrooms throughout the country, with teachers calling them a “distraction” and a “time waster.” “This just proves how dangerous they really are, though,” said McDonald. “We went through a lot of phases in my days as a teacher – slap bracelets, pogs, and then cell phones, of course. But this is the first time I’ve ever seen kids beat each other to death over a fad. This world has gone truly crazy.”\n\n\n|Tweet\n|Like0\n\n\n\n\n\n\n\nComments comments comments Posted on May 24, 2017 by Bob The Empire News Potato Bob The Empire News Potato 0  | | 0 | | 0 Posted in Weird News Tagged death, fidget spinners, Fight, high school, teens", "source": "empirenews.net", "title": "17 Children Are DEAD After a Fight Breaks Out in Middle School Over Fidget Spinners"}