{"text": " AUGUSTA, GeorgiaÂ – Joel Fine, 32, was arrested on Friday evening after police say that he went into his place of employment and defecated on the desk of his boss, Mark Carson, at Excess Communications, a telecommunicationsÂ company. Fine won a $6.7 million dollar lottery jackpot on Wednesday evening, and said that he waited until Friday to visit his employer, because he had “a present” for his former boss. “I worked at Excess for nearly 5 years, and that sonofabitch rode me every single day, all day, with never a single solitary ‘thank you’ or any expression of gratitude of a job well done,” said Fine. “The guy went through the same training program as me, and moved up only because his uncle was the former manager, and when he quit, nepotism reared its ugly head.” Fine says that he “couldn’t believe it” when he won the lottery, but almost as good as being able to never work again, was knowing that he would be able to finally “afford” the present he always wanted to deliver to Carson. “I walked into my office on Friday, even though I wasn’t supposed to be there that day, and I couldn’t believe my eyes,” said Carson. “Joel was crouched on top of my desk, pants around his ankles, and he was reading a newspaper. A big, steaming pile of shit was all over my monthly reports. When he saw me, he just smiled, and told me to ‘kiss his ass.'” Carson called the police, and Fine was arrested for indecent exposure and criminal mischief. He was released on $2,000 bail, which he called “chump change” and “totally well worth it.”\n\n\n|Tweet\n|Like0\n\n\n\n\n\n\n\nComments comments comments Posted on May 15, 2016 by Bob The Empire News Potato Bob The Empire News Potato 0  | | 0 | | 0 Posted in Uncategorized Tagged Arrested, boss, defecate, desk, lottery, man, Woman", "source": "empirenews.net", "title": "Man Arrested For Defecating On Boss’ Desk After Winning State Lottery"}