{"text": "DAVE WEASEL ST. LOUIS, MO – A 20-year-old man is in stable condition Monday afternoon after the gun he was posing naked with accidentally discharged and shot off his penis. “We’ve never had someone shoot off their own junk before,” the police said in a statement. “There was a man who shot off his foot, a middle-schooler shot her guinea pig, and even a baby was able to shoot both his parents, but never someone’s own junk.” “First I posed with this bad-ass look on my face,” said the man in a falsetto voice. “Then I thought the only thing girls like more than guns is men without shirts on, so I took my shirt off. To stand out from the rest of the shirtless gun-selfies, I decided to take my pants off because I read online that women like it when random guys send them pictures of their dick. I was trying to thrust my hips around and do the helicopter like my peen is another gun, but then the gun shot off instead of the camera.” Police dropped all endangerment charges in exchange for him not filing a complaint about them expressing relief he won’t be able to reproduce. Follow the author on  Facebook | Twitter | Instagram  writer | comedian | musician | canadian | etc Never pose with a loaded gun LoL. OMG! When you THINK you’ve heard everything. I am NOT sure how I feel about this. Personally MYSELF? I would feel like an “IDIOT” and 100 times worse knowing it was in the newspaper adding “falsetto” will certainly net the pulitzer “This week on The Violence Channel:: an all-new “Ow, My Balls!”” Reblogged this on Song Lyrics Explained. This page even has a disclaimer. It reads as follows: Some of these stories may be exaggerated, embellished or an outright work of fiction. Use proper judgment when reading anything on the internet. Share anywhere you want, but do not repost content without permission. We only use images with permission, belonging to public domain i.e. stock-photos and mugshots, or we are covered by fair use laws as a parody. However, we will remove any picture at the request of the person in the photo. You can either send our Facebook page a message or email editor[at]thevalleyreport.com with proof it is you and we will remove it. All third parties or threats of legal action will be forwarded to our legal department at gofuckyourself[at]thevalleyreport.com and will be taken down in 90 days out of moral obligation, not legal. I hope all you guys do know that the story is not real at all. I mean look at the wording, and the suppose quotes made by police officers and medical personnel.  No police officer is going to say “junk” in an interview.  No professional would talk like this to the press.  Although I am definitely sure there are men out there stupid enough to shoot off their own penis, the story is a fake. Your comment is redundant\nThis is a SATIRE website.\nRead the disclaimer. Lemme just whip this ou– AAAAAAAAAAAAAAAAHHHHHH!!! MY DICK!!! If he wanted to get circumcised, there are easier and better ways. Fakr ass bullshit story No, women do not like strange men’s dick pic’s!!! Dumbass! You know it was a man that came up with something that stupid.  For once and for all.  NO, women do not like or in any way want a strange, unknown guy to send her a picture of his ball, penis or ass.  It is not sexy or alluring, it just looks stupid.  The fact that a guy is so proud of his dick that he wants to make unrequited pictures of it and send it to unknown women just makes the guy look pathetic. 9.999% of the time what he’s got isn’t even a little bit better than what anyone else has and all it does is either creep the woman out or she laughs her ass off at it.  Please for all woman kind.  Just don’t.  Stop it. You know it was a man that came up with something that stupid.  For once and for all.  NO, women do not like or in any way want a strange, unknown guy to send her a picture of his balls, penis or ass.  It is not sexy or alluring, it just looks stupid.  The fact that a guy is so proud of his dick that he wants to make unrequested pictures of it and send it to unknown women just makes the guy look pathetic. 9.999% of the time what he’s got isn’t even a little bit better than what anyone else has and all it does is either creep the woman out or she laughs her ass off at it.  Please for all woman kind.  Just don’t.  Stop it. The Loraina quickie This is a HOAX.  It is not in any media source in St. Louis.  Only on commentary blogs can I find this. If anyone can’t figure that out based on the police comments, they deserve to believe the story… Very correct!! Police would never use refetences, such as junk. Its not meant to be a hoax-but rather a parody. Get a clue Raccy. You all DO know this is satire, right…? ROFL..THIS ONE GOT ME ROFLLMAO….ANY ONE THAT CAN SHOOT HIS DICK DESERVE THE BRUCE JENNER AWARD.ROFL.oh help me Lord…ROFL. Congrats on trying to be funny but sounding like an ignorant troll. are you retarded? if it’s satire it’s supposed to be clever, amusing and original.  this is all too common; men are always shooting their dicks or other body parts off.  this is nothing new; ask any ER nurse. Aside from gun control, we need self control! Don’t you mean “selfie control” ? I am glad to find out that this is a fake. Of course, no one has to take an iQ test to buy a gun, but   I would hate to find out there are people ,with guns ,that are this stupid.  Wait a minute, there are people like this with guns and we will soon read about them on Facebook. I worked as a nurse (LPN) in a desert community where guns are very common..and (wink) some of the things that I’ve seen shot or shot off..should have made the news..many times and shoot “junk” was not such a rare incident but usually a small caliber weapon or air rifles..not surprised !! There are probably people this stupid andI would argue that we are more at risk from them voting than owning guns. Reblogged this on worldofdonad's Blog. That sucks, but not for him any longer! BYE,..BYE,..LOVE!!!  hello prosthetics !! it’s a fake story retards Satire, and not that well done either !   Though this was funny … “said the man in a falsetto voice.” I’m glad this man is removed from the gene pool. Your comment is idiotic.\nThis is a SATIRE website.\nRead the f-ing disclaimer.\nYou should be removed from the gene pool. People believe thing is real is enough to make me want shoot off my….well, maybe not. This story is fake, the photo is of Jules bahler. He was convicted of bank robbery in Michigan. Ok how stupid can you be and still able to purchase a weapon or as certain idiots demonstrate…. a gun ????\nIf you can’t tell a round is in the chamber AND your legally old enough to buy a weapon.  You deserve what happens when you pull the trigger. See my reply below. THE WEAPON IS AN AUTOMATIC EITHER SEMI OR FULLY. IT HAS A CLIP, AND EVERY CLIP IS LOADED. THERE MAY NOT BE A BULLET IN THE BREACH, BUT AS SOON AS YOU SQUEEZE THAT TRIGGER.  BANG!!!!! NOW IT’S LOADED!!!!!!  THE BOY IS STUPIDER THAN A 10 GALLON BUCKET OF SHIT!!!!! find your caps lock and refer to them as “magazines”. Nothing worse than someone acting like they know about guns on a fake article. *magazine, not clip.\n*breech, not breach.\nGo back to your video games now… If there’s Nothing in the breech, how does it load the next bullet ? Wow your dumber than this turd if it he was real. what a dumb ass You do realize that this is totally made up and intended to be a joke don’t you?\nBig clues are the remark about him answering in a falsetto voice, and the police not filing an endangerment charge in exchange for him not filing a complaint about the police making remarks that at least he can’t reproduce now.\nIf you really think this is a real news article you’re probably as dumb as the fictional character in the story. With all the accidental gun shot stories that’s been on Facebook as well news regarding these guys who are so in love with their guns but somehow turn off their brains when having their hands on their guns , it really wouldn’t surprise me So fake What bathroom will he use Heh What bathroom will he use???? Hahaaaa! LMAO.. no charges because he could have filed and sued them for saying crap….LMAO.. i woulda said Fk that.. arragin  me.. I’m suing.. i shot my junk off.. i got nothing more to lose fkr’s..lol wont be able to reproduce…..thank god!!!!! […] Man shoots off his own penis taking selfies with gun […] News Facebook Comments Advertisements News News News 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 1  1 0  0 1  1 0  0 0  0 0  0 1  1 0  0 0  0 0  0 0  0 1  1 0  0 1  1 0  0 1  1 0  0 1  1 0  0 0  0 0  0 1  1 1  1 0  0 1  1 0  0 1  1 0  0 1  1 0  0 1  1 0  0 0  0 1  1 1  1 0  0 0  0 0  0 1  1 0  0 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 1  1 0  0 1  1 0  0 0  0 1  1 0  0 0  0 0  0 0  0 0  0 1  1 0  0 1  1 1  1 0  0 0  0 0  0 1  1 0  0 1  1 0  0 1  1 0  0 1  1 0  0 0  0 1  1 1  1 0  0 0  0 0  0 0  0 0  0 1  1 0  0 0  0 0  0 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0", "source": "thevalleyreport.com", "title": "Man shoots off his own penis taking selfies with gun"}