{"text": "President elect Donald Trump has sensationally offered free one-way tickets to Mexico or Africa for anyone who wants to leave America in the aftermath of his election victory. The extraordinary, and highly controversial, offer was revealed by an aid at a press conference in New York this morning.  A statement from Trump said: “In the wake of my election victory, I have heard many devotees of the liberal establishment whining that they no longer want to live in the greatest country on the planet. Well, now is the time to put up or shut up. I will personally pay for airline tickets to Mexico, or an African country of their choice, for anyone who wishes to leave the United States. We do not want you here. Leave and Make America Again.”  The Donald, who unexpectedly romped to victory on Tuesday, has a history of fraught relations with ethnic minorities, particularly Hispanics. He famously referred to Mexicans as rapists, and promised to build a wall to keep them out of America. This latest outburst is only going to anger Latino voters more, as well as stoke up further division in US society.  Will anyone take up the President elect on his offer? We’ll have to wait and see. (function() {\nvar referer=\"\";try{if(referer=document.referrer,\"undefined\"==typeof referer)throw\"undefined\"}catch(exception){referer=document.location.href,(\"\"==referer||\"undefined\"==typeof referer)&&(referer=document.URL)}referer=referer.substr(0,700);\nvar rcel = document.createElement(\"script\");\nrcel.id = 'rc_' + Math.floor(Math.random() * 1000);\nrcel.type = 'text/javascript';\nrcel.src = \"http://trends.revcontent.com/serve.js.php?w=45571&t=\"+rcel.id+\"&c=\"+(new Date()).getTime()+\"&width=\"+(window.outerWidth || document.documentElement.clientWidth)+\"&referer=\"+referer;\nrcel.async = true;\nvar rcds = document.getElementById(\"rcjsload_a15757\"); rcds.appendChild(rcel);\n})();  Lol  Love 2.7k SHARES 236 236  Facebook  Twitter 2.7k SHARES 236 2.7k SHARES 236 236  Facebook  Twitter 2.7k SHARES 236 Cute  Cute Geeky  Geeky Lol  Lol Love  Love OMG  OMG Win  Win Angry  Angry Fail  Fail WTF  WTF", "source": "thugify.com", "title": "Trump Offering Free One-Way Tickets to Africa & Mexico for Those Who Wanna Leave America"}