{"text": "Written by Lea Vat Kens September 18th 2016 function highlight($mode){\r\nvar facts =document.getElementsByClassName(\"fact\");\r\nfor (var i = 0; i < facts.length; i++) {\r\nvar $f = facts[i];\r\n    if ($mode === 1 ) {\r\n       $f.style.color=\"black\";\r\n       $f.style.background=\"#fff0b3\";\r\n    }else {\r\n       $f.style.color=\"black\";\r\n       $f.style.background=\"white\";\r\n    }\r\n}\r\n\r\nif ($mode === 1) {\r\n    try { \r\n        _gaq.push(['_trackEvent', 'Show facts', 'clicked on show facts']);\r\n\r\n      }\r\n    catch(err)\r\n      { //do nothing \r\n      }\r\n}\r\n} Republican vice presidential nominee Mike Pence said Sunday he wants to be like Dick Cheney. Pence named the former vice president, who served under George W. Bush, as his role model for the No. 2 spot in the White House. “I frankly hold Dick Cheney in really high regard in his role as vice president and as an American,” Pence said on ABC’s “This Week.” Pence praised Cheney for being “very active” in working with the House and Senate. Cheney left office in 2009 with a 13 percent approval rating. However, the controversial governor of Indiana didn’t stop there. He also mentioned former half-term Alaska governor Sarah Palin as another example of people he admires. Only, when it comes to Palin, that admiration has to do with something else. “One of the great things about being American is I get to live in this great and beautiful country and help make it great again, because it can be and it has the potential for it. And I also can’t shy away from noticing how beautiful our women can be. It’s truly a blessing to be an American today,” he said. “Take Sarah Palin, for example,” Pence argued. “Even though she’s married and I have the utmost respect for her husband, I can’t help but notice that she embodies everything an American woman should be and that just makes me very happy.” He added, “She’s beautiful, she’s smart, she’s educated, she’s a mother, she stands up for what she believes in, she’s doing an important job and most of all, she’s had a taste of political power and handled it beautifully. She’s ideal.” Pence continued, “In a certain way, I’m proud to call her my role model when it comes to what American women should be like. But unfortunately, today we have numerous examples of the opposite. One of those examples includes Hillary Clinton, who just couldn’t leave enough alone, could she? She already had the First Lady position; she saw the inside of the White House and had a lot of fun in it for 8 years. She should have been happy and be done with it, but no. She had to go out and support feminism and then run for the Senate and the Presidency. And that’s not what modern American women should go after. Not at all.” Pence also argued that, “with all due respect,” Hillary Clinton “looks like someone took a leprechaun, put make up on it, and told him to accept money from whomever it wants if that gets him the presidency.” “And that’s not an insult because it’s the truth, and you can ask anyone you want and they’ll agree with me,” Pence added. “Because, let’s face it: the most defining characteristic of a woman is her beauty. And Hillary Clinton doesn’t have it. Beauty in general, I mean, not just female beauty.” “Now, Sarah Palin, well, she’s the spitting image of what a beautiful, smart, confident woman should look like,” he said. “She has several children, meaning she’s a good mother, she still manages to be drop-dead gorgeous whenever she appears on TV, and she still acts as the voice of reason when it comes to politics in the United States. I don’t want anybody to get the wrong impression based on what I’ve just said, but if I wasn’t married, you know I’d tap that,” Pence concluded. Republican vice presidential nominee Mike Pence said Sunday he wants to be like Dick Cheney. Pence named the former vice president, who served under George W. Bush, as his role model for the No. 2 spot in the White House. “I frankly hold Dick Cheney in really high regard in his role as vice president and as an American,” Pence said on ABC’s “This Week.” Pence praised Cheney for being “very active” in working with the House and Senate. Cheney left office in 2009 with a 13 percent approval rating.", "source": "politicops.com", "title": "Mike Pence: “Sarah Palin Is My Role Model For Beautiful, Smart American Women”"}