{"text": "Officers in Sweden’s capital were on patrol in the suburb of Rinkeby when they are set upon by a group of 20-30 thugs. Police spokeswoman Eva Nilsson said the sickening attack on her colleagues happened after they stopped to search an individual at around 11pm. Moments later the mob appeared and started hitting, kicking and throwing bottles and glass at the attending officers. Ms Nilsson said: “It is utterly unacceptable that this happened during normal service. GOOGLE MAPS • GETTY “The trouble started after a [routine search of a person]. People came out from a place nearby, a restaurant or what it was. “Exactly how many people were involved is difficult to say, but the officers [assess] it to be between 20-30 people. All of them were not active, but they were observing the incident. “Bottles and glass was also thrown at the police.” Three police officers were taken to hospital for treatment after the brutal clash, and Ms Nilsson added: “Of course it’s serious when police officers on duty are attacked in this way. Bottles and glass was also thrown at the police Police spokeswoman Eva Nilsson “Unfortunately this is the reality… for officers.” The official also confirmed three people had been detained following the sickening incident. The shocking attack on the on-duty officers is just one of many incidents, as officials have placed more than 50 areas on a ‘no-go zone’ list where they admit they do not have control. Lawless thugs are wreaking havoc unchecked, and officers are often at personal risk when entering the crisis-hit areas. Moroccan Police look at immigrants trying to jump the six-meter-high fence in Ceuta, Spanish enclave on the north of Africa, 09 December 2016. As the crisis in the Swedish police force continues to grow as they are powerless against the increasing number of violent crimes, one officer took to Facebook to share his frustration. In a seething post, Peter Springare, who works as an investigator for the police in Örebro, a small city in southern Sweden, said migrants were to blame for the majority of crimes. The former deputy chief of the serious crimes division wrote: “I’m so f***** tired. What I’m writing here isn’t politically correct. But I don’t care. “Our pensioners are on their knees, the schools are a mess, healthcare is an inferno, the police is completely destroyed. Everyone knows why, but no one dares or wants to say why.” Sorry, we are unable to accept comments about this article\n                        at the moment. However, you will find some great articles\n                        which you can comment on right now in our\n                        Comment section. Lizzie Stromme PUBLISHED: 00:12, Sun, Feb 12, 2017 00:12, Sun, Feb 12, 2017 GOOGLE MAPS • GETTY The officers were attacked in the suburb of Rinkeby Swedes defend police officer facing probe for 'migrants to blame' rant Malmo horror as mum raped and robbed at knifepoint by teenage thug Wed, February 15, 2017 1 107", "source": "www.express.co.uk", "title": "SWEDEN'S 'NO-GO ZONE' CRISIS: Three police officers injured after being ATTACKED by thugs"}