{"text": "DAVE WEASEL NEW YORK – A 41-year-old woman had the winning lottery ticket worth over 3 million dollars on Friday night, but showed up to work anyway on Monday to deliver one last package.  The courier company had no idea of her winnings. “I knew something was wrong because I came back from lunch and the door to my office was closed,” said the manager. I slowly opened the door to discover the woman with her pants around her ankles, hunched over on my desk like a hippopotamus/cheetah dropping a massive poo on my desk. She shot her head towards me and locked eyes. I was frozen in shock and fear. In my peripheral vision I saw a huge mud-monkey sliming out of her butt like a Play-Doh fun factory.” “It was worth it,” the woman said on arrest. “On Friday when I realized I hit the lotto, I knew this would be the first thing I would do. I hit up every Mexican food truck and saved my dumps all weekend. I was shuffling around like a death-row inmate trying not to explode. I’ve been putting up with that guy’s shit for years, it’s time he put up with some of mine.” Follow the author on  Facebook | Twitter | Instagram writer | comedian | musician | canadian | etc No god no noooooooooo No matter how you look at it love your boss or hate them. You had a job because of them!!! Prime example of ungratefulness!! Who gives a shit when you win Lotto, thats funny! Revenge of the poo! 🤣 So much Bullshit -All the time ! I THINK IT’S TRUE!   LOL…& PROBABLY…..well deserved……I just seen a story on Dr Phil in which a Brother did this all over  his Sisters’ porch…b/c he was mad….SICK IDIOT! Not only that….he did to a strangers new truck….b/c he got kicked out of a par-tay!!!  DISGUSTING PIG! BUT OH SoOoOoOoOoO TRUE! Fake….This is the kinda stuff that doesn’t need to be in FB…With all the different sites out there can’t we have one site ( Facebook)  that is free from all this BS???? I know I’m not the only person who feels like this. If I want to read funny articles I would gladly go to a site that is dedicated to that kind of stuff & The videos….Isn’t that what YouTube is for? This really bothers me so I’m excited to see if I have friends out there who would like to vent…lol Get a life yo-yo. You live in a stupid country so deal with it. Nobody said you had.to read.this…… And im sure there are lots.of.mechanics.who would like to do as.she.did It’s a HOAX Maybe not. Many years ago in Albuquerque my husband had a girlfriend who worked at a restaurant in a motel on rte66. The owner was Iranian and they both worked at the motel, which had two stories and sixty rooms. The owner kept making passes at her and refused to pay her unless she gave in to him. So she quit and they moved out, but not before he half-filled a white plastic potato salad bucket and hid it deep in the bowels of the central Aircon system, which vented the smell of shit into every room, including the front office. The owners were unable to locate the source of the aroma, the business failed, and no one wanted to buy the property. So the story here could be true. Monkey shit sheeple satire garbage. Only RETARDS Believe these IDIOT–CAUSING/BREEDING CANCER “articles! …but please tell us what you REALLY think? Yeah, this story is fake. Notice how no names are mentioned anywhere in the article. That’s because this is a fake news site you dipshit.  Of course it’s a fake story. It’s meant to be funny. she is my hero She should have smeared some on his face too. […] “Woman arrested for defecating on boss’ desk after winning the lottery“ […] News Facebook Comments Advertisements News News News 3  3 1  1 1  1 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 1  1 0  0 0  0 0  0 1  1 0  0 1  1 1  1 1  1 0  0 1  1 0  0 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0", "source": "thevalleyreport.com", "title": "Woman arrested for defecating on boss’ desk after winning the lottery"}