{"text": "Jennifer Burrows, an assistant pathologist with the Jackson County medical examiner services, is accused of having sex with dozens of corpses over the course of the last two years, a behavior which led the birth of a baby boy on January 7. According to the Kansas City Missouri Police Department, her baby is the son of man who died in a car accident in March 2015, and whose body she was supposed to autopsy. They allege that she Ms. Burrows sexually abused more than 60 other dead bodies, belonging to males from 17 to 71 years old. “We opened an investigation about this case in October after we were informed that the suspect may have been sexually abusing corpses,” Police Chief Forté told reporters. “We accumulated enough evidence over the last few months to obtain a warrant for a paternity test on her newborn son. It confirmed our suspicions, that the father of her child was, indeed, a 57-year old veterinarian from Texas who was driving through the county when he had a fatal car accident. All the evidence that we have gathered suggests that he had never met Ms. Burrows before his demise and that he was already dead when the baby was conceived.” The KCMO Police Chief, Darryl Forté, briefly commented Ms. Burrows’ arrest this morning during a press conference, calling it “one of the most sordid case he has seen in his career”. There are currently no laws (state or federal) governing or explicitly outlawing the practice of necrophilia, since the corpse is considered human remains and no longer living. Therefore, it is technically legal in the state of Missouri, and Ms Burrows’ actions are judged as an indecent treatment of a corpse. She is facing a total of 158 charges, including indecent treatment of a corpse, disorderly conduct, indecent exposure and possession of illegal drugs. The psychologists and experts that we interviewed were divided in their interpretation of Ms Burrows’ case. Some, Like Professor Isabella Ramirez of the University of Missouri, believe that the young woman was suffering from a psychosis and had, at least partially, lost contact with reality. Others, like Dr Gerald Porter, a well-known psychologist and expert in sexual disorders associated with the Institute of Psychological Sciences, believe that the accused is clearly a compulsive necrophiliac, and that her choice of profession was inspired by her sexual deviation in the first place. All seem to agree, however, that the 26-year old woman was suffering from mental problems and that she will probably register a plea of insanity. TOPICS: Share Share Share 338K Tweet Tweet Tweet Tweet Share Share Share 338K Tweet Tweet Tweet Tweet", "source": "worldnewsdailyreport.com", "title": "Morgue worker arrested after giving birth to a dead man’s baby"}