{"text": "Sunday 11 March    672273 Shares Grandparents must pickup up all their grandchildren every weekend no matter what or they will be fined 5000$ or 35 days in jail pickup must start this Friday and if not parents must call the local police station.. 1 McDonalds can now report marijuana smokers to the police McDonald's fast Food chain is pro actively taken a fight against marijuana. CEO of McDonald's have given the green light to record the license plates of any customers who come through the drive-through smelling like marijuana or any customer that enters the establishment with the same smell. McDonald's definitely wants to show that they are on the fight against marijuana side.\r\n\r\nAnd if you're still reading this.... BOI IF YOU DON'T GET!!!!! 2 The amount of your fine will depend on the model of your vehicle beginning in 2018 If you are caught speeding, the amount of your fine will depend on the model of your vehicle. The more expensive the vehicle, the more expensive the fine will be. \r\n\r\nThe photographs taken by radars will be able to determine the model of the car, motorcycle, or truck. The cheapest vehicles will be fined lightly, whereas high-end vehicles will face much heavier fines. \r\n\r\nThis measure acknowledges the inequality between those “who can afford” to pay the fines and those who “suffer” under the repressive system. Thus, the wallets of the most well-to-do will be hit just as hard as those of the most humble. \r\n\r\nThe measure promises to reduce delinquency on the road by the wealthy, thus eliminating the feeling of impunity shared among more and more drivers. 3 New York City Woman Loses Her Temper, Causes Black Hole To Swallow Her Entire Town Anna, 26, of New York City, DC was in the middle of an argument with a colleague when her temper got so out of control, it formed a small black hole, which demolished the vast majority of her neighborhood.\r\n\r\n\"I just couldn't take it anymore, and unleashed my forces at the person who was irritating me. I had no idea the energy of my rage could cause such destruction,\" says Anna.\r\n\r\nDespite the ruination her anger has caused, Anna says she has no regrets.\r\n\r\n\"I actually wish I knew I had this ability sooner!\" Anna laughs. \"There are a lot of people and things I could have eradicated from my life in this way.\" 4 KEOKUK,  IA - Great White Sharks Found In Mississippi River While it is not entirely impossible, it is incredibly uncommon for salt water dwelling creatures to stay for lengthy periods of time in fresh water. However, two Great White Sharks have managed to survive the trip and make their way up the Mississippi River somehow. Believed to have started as a mating couple, the two are assumed to have swam the 920 mile journey from the mouth of the Mississippi River that is connected to the Gulf Of Mexico. Officials in Keokuk  have contacted the Iowa Department of Natural Resources and will likely have a team in the river soon to capture the two lost sharks. 5 Rio grande valley will see snow for the 3rd time in history The rio grande valley is expecting heavy snow this winter says chief meteorologist ******** as the radars pick up what looks like a huge storm \"make sure your ready\" 672273 Shares McDonalds can now report marijuana smokers to the police The amount of your fine will depend on the model of your vehicle beginning in 2018 New York City Woman Loses Her Temper, Causes Black Hole To Swallow Her Entire Town KEOKUK,  IA - Great White Sharks Found In Mississippi River Rio grande valley will see snow for the 3rd time in history", "source": "www.react365.com", "title": "Obama passed law for grandparents to get all their grandchildren every weekend"}