{"text": "The victims are local poachers who were illegally hunting for elephants inside the boundaries the national park, when they were surprised by a group of almost twenty adult Southwest African lions, the same species as Cecil the Lion, who died a few kilometres from the site in July 215. The felines’ attack was so sudden and violent, that five of the ten men were killed, three severely injured and two were only lightly injured, while the animals were mostly unhurt. The survivors abandoned their dead comrades on the site and hurried back to a nearby village for medical care, where they were rapidly arrested. Zimbabwe Republic Police Commissioner-General, Augustine Chihuri, told reporters that the poachers were visibly terrified by their experience and he hopes this incident serves as a lesson to other poachers. “The men were visibly traumatized by the attack,” said Commissioner-General Chihuri, “and after seeing their injuries and the remains of their dead comrades, I can see why. These guys tough criminals carrying ak-47s, but they were literally shred to pieces and devoured by the lions. I have never seen an animal attack reach this level of violence, and I have seen a lot!” The Commissioner-General of Zimbabwe Republic Police, Augustine Chihuri, described the scene as “a horrible blood bath”, with many bones and bits of flesh scattered over hundreds of square metres. The surviving poachers will now face a wide array of criminal charges if they survive their injuries. The charges brought by prosecutors include illegal-hunting, possession of illegal weapons and contravening the Parks and Wildlife Act. Their first appearance in court is expected to take place on April 4th, when they will be facing sentences of up to 25 years in jail and fines of up to US$100 000. TOPICS: Share Share Share 191K Tweet Tweet Tweet Tweet Share Share Share 191K Tweet Tweet Tweet Tweet", "source": "worldnewsdailyreport.com", "title": "Zimbabwe: Pride of lions kills 5 poachers and injures 3 others"}