{"text": "The verdict, which fell just hours before the International Women’s Day, is considered “historic” by some experts and advocacy groups for women’s rights. “It may seem too little, too late, but it is truly a milestone event for all women in the region,” explains Jane Austin, visibly excited. “From now on, women will be considered as members of the mammal class, whereas before women shared the legal status of an object, similar to that of a home appliance,” she admits. Jillian Birch, spokeswoman at Amnesty International, said she is optimistic about the future as women will no longer be considered as “soulless objects” but as fully fledged mammals The recent verdict could completely upset all laws currently enforced in Saudi Arabia believes Jillian Birch, spokeswoman at Amnesty International. “This verdict shows the incredible progress the women’s rights movement has made in the past 50 years,” she admitted in a press conference this morning. “Women are still far from being considered 100% human, but their condition will improve drastically with this decision,” she firmly believes. The verdict, which fell like a ton of bricks on the Saudi state, has clearly not found unanimous support amongst religious authorities and the political elite, concede experts. “It could create significant turmoil in the current legal state of affairs and the judiciary system of Saudi Arabia,” says political analyst specialized in the Middle East, Anthony Bochstein. “If before women had the same rights as a chair or a table and were seen more as individual property, they now have an equivalent status to certain animal species, and thus must receive, at the very least, feeding, watering and be conferred a minimum of attention and respect, which was not the case previously,” he explains. According to the expert panel that ruled on the matter, women are still devoid of a soul but have been shown to possess qualities common to the mammal species, which would explain their ability to procreate and breastfeed, as well as why they are equipped with seven cervical vertebrae, a characteristic unique to the mammal species. TOPICS: Share Share Share 452K Tweet Tweet Tweet Tweet The verdict, which fell just hours before the International Women’s Day, is considered “historic” by some experts and advocacy groups for women’s rights. “It may seem too little, too late, but it is truly a milestone event for all women in the region tr ul y a mile st one event for all women in the region “This is a great leap forward for women’s rights in Saudi Arabia” “ ” – Jane Austin, Women’s Liberation Action Network “Soulless objects” The recent verdict could completely upset all laws currently enforced in Saudi Arabia believes Jillian Birch, spokeswoman at Amnesty International. “This verdict shows the incredible progress the women’s rights movement has made in the past 50 years,” she admitted in a press conference this morning. “Finally, women will no longer be simply considered as objects without souls, but as full-fledged mammals, with the same rights as other animals of their species such as camels and goats,” she said, visibly emotional. “Finally, women will no longer be simply considered as objects without souls, but as full-fledged mammals, with the same rights as other animals of their species such as camels and goats,” she said, visibly emotional. “Women are still far from being considered 100% human, but their condition will improve drastically with this decision,” she firmly believes. An unprecedented verdict The verdict, which fell like a ton of bricks on the Saudi state, has clearly not found unanimous support amongst religious authorities and the political elite, concede experts. “It could create significant turmoil in the current legal state of affairs and the judiciary system of Saudi Arabia,” says political analyst specialized in the Middle East, Anthony Bochstein. “If before women had the same rights as a chair or a table and were seen more as individual property, they now have an equivalent status to certain animal species, and thus must receive, at the very least, feeding, watering and be conferred a minimum of attention and respect, which was not the case previously,” he explains. According to the expert panel that ruled on the matter, women are still devoid of a soul but have been shown to possess qualities common to the mammal species, which would explain their ability to procreate and breastfeed, as well as why they are equipped with seven cervical vertebrae, a characteristic unique to the mammal species. Share Share Share 452K Tweet Tweet Tweet Tweet", "source": "worldnewsdailyreport.com", "title": "Saudi Arabia: Panel of Scientists admits Women are Mammals, yet ‘Not Human’"}