{"text": "by Chris Reynolds  June 7, 2017 8:06 am0 It is customary for outgoing U.S. Presidents to depart from Washington, D.C. following the completion of their tenure in the White House, to not interfere with our country’s democratic process and give the current President as much space as they need to try and carry out their own agenda. Unfortunately, former President Barack Hussein Obama has flagrantly violated this norm, and still lives in Washington, D.C. just a short drive away from the White House. What’s more, Obama has been using his abundant free time to rile up his liberal followers and attempt to actively undermine President Donald Trump. Obama was at it again in the wake of President Trump’s bold decision to withdraw the United States from the leftist climate change agreement that Obama committed our country to while he was in the White House. Upset that Trump was putting America and spoiling his agenda, egomaniac Obama put out a statement criticizing Trump’s decision. Said Obama, “The nations that remain in the Paris Agreement will be the nations that reap the benefits in jobs and industries created. But even in the absence of American leadership; even as this Administration joins a small handful of nations that reject the future; I’m confident that our states, cities, and businesses will step up and do ever more to lead the way.” In this statement, Obama neglected to mention the fact that he made this agreement without consulting Congress. He added, “A year and a half ago, the world came together in Paris around the first-ever global agreement to set the world on a low-carbon course and protect the world we leave to our children. It was steady, principled American leadership on the world stage that made this achievement possible. It was bold American ambition that encouraged dozens of other nations to set their sights higher as well. And what made that leadership and ambition possible was America’s private innovation and public investment in growing industries like wind and solar—industries that created some of the fastest new streams of good-paying jobs in recent years, and contributed to the longest streak of job creation in our history.” Unfortunately for Obama, Trump thoroughly ignored Barack’s statement, and the former President just came off like a meddler with dwindling relevance. Are you glad that Trump dismissed Obama’s bitter statement? As Trump speaks, Obama issues statement on Paris deal pic.twitter.com/clpLdNoFpP — Jordan Fabian (@Jordanfabian) June 1, 2017  News / by Donald -  March 10, 2018 3:21 am The mainstream media tries their hardest to demonize Melania Trump. They insult her for staying married and loyal to President Trump. While the media often shows off the anti-gun survivors… News / by Donald -  March 10, 2018 3:13 am Liberals have been trying their best to insult Evangelicals support of President Trump. Recently, President Trump has been accused of having an affair with porn star Stormy Daniels. However, Dallas… News / by Donald -  March 10, 2018 3:06 am Liberals love talking about every single allegation made against President Trump even though none of them have been proven or even shown to be credible. They argue that Trump is… News / by Donald -  March 10, 2018 2:56 am For some reason Democrats are having a really tough time distancing themselves from Nation of Islam head Louis Farrakhan who consistently talks about how Jews are trying to rule the… Chris Reynolds June 7, 2017 8:06 am Share Related posts Donald March 10, 2018 3:21 am Donald March 10, 2018 3:13 am Donald March 10, 2018 3:06 am Donald March 10, 2018 2:56 am", "source": "conservative101.com", "title": "Obama Just Launched A Crazy, Last-Ditch Plan To Stop Trump, It Backfired On Him"}