{"text": "June 8, 2017\nSean Adl-Tabatabai\nSci/Environment\n5 A new study has found that vaccinated individuals are twice as likely to get the flu compared to their unvaccinated counterparts. According to immunologists, obese Americans who received the flu shot showed a bigger risk in developing the flu than the rest of the unvaccinated population. Lewrockwell.com reports: A striking study shows flu vaccination did increase antibody titers (concentration) among healthy and obese individuals, but that failed to protect obese individuals from the flu.  In fact, obese vaccinated individuals were twice as likely to get the flu compared to healthy vaccinated individuals.  Given over 100 million Americans elect to get a flu shot annually and a third of the adult population is obese, vaccination programs appear to be counterproductive. [Daily Mail June 7, 2017] Immunologists identified an impaired T-cell response as the cause of the problem.  The study was published in the International Journal of Obesity. “This finding challenges the current standard blood tests being used to indicate whether a person has enough protection against influenza or not,” said a commentary by the publisher of the study. The lead researcher for the study said: “Alternative approaches may be needed to protect obese adults from both seasonal and pandemic influenza virus infections.” A paper published in the journal Medical Hypotheses in 1999 suggests such an alternative.  Deficiencies of zinc, a trace mineral, and glutathione (glu-ta-thy-on), an internally produced enzymatic antioxidant, as well as nitric oxide, a transient arterial gas, can lead to an impaired cellular immune response. Nitric oxide is activated with the consumption of amino acids (arginine, citrulline), resveratrol and garlic.  Glutathione is a sulfur-bearing antioxidant that is activated by vitamin C and resveratrol. Provision of supplemental vitamins A, B6, C, E, zinc and selenium are proposed to rectify the abnormal T-cell response.  Zinc also serves as a mimic of insulin among diabetics who are likely overweight and prone to weak immunity. Nitric oxide and the trace mineral selenium help to release zinc from a binding protein (metallothionein) that inhibits its bioavailability. June 8, 2017 Sean Adl-Tabatabai Sci/Environment 5 ", "source": "yournewswire.com", "title": "Study: Vaccinated People Twice As Likely To Get Flu"}