{"text": "June 8, 2017\nSean Adl-Tabatabai\nNews, US\n3 Bill and Hillary Clinton have admitted to owning black slaves in the 1980’s during their time at the Arkansas governor’s mansion. According to the Clinton’s, the unpaid slaves were used to perform “household tasks” in order to keep their costs down to a minimum. Currentaffairs.org reports: Contrary to popular understanding, the Thirteenth Amendment to the United States Constitution did not prohibit slavery. The text makes it clear: Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction. The nifty little loophole of that word “except” means that slavery isn’t actually banned outright; someone simply has to be convicted of a crime in order to be enslaved. This gave Southern states a welcome free hand in re-establishing forced servitude for African Americans in the years after Reconstruction collapsed; as Douglas Blackmon documents in Slavery By Another Name, the Jim Crow era was in many places characterized by a mass re-enslavement process, whereby criminal laws were devised that allowed states and municipalities to put black people in chains again. Today, forced labor among African Americans persists; in Louisiana, for example, felons are sentenced to “hard labor” as well as prison time, and inmates at the infamous Angola prison still pick cotton at gunpoint. The prison labor system in the United States has long been an unacknowledged scandal. It’s quite plainly a form of slavery. The Thirteenth Amendment even admits as much: it doesn’t say that when you’re forced to work for being convicted of a crime, that isn’t slavery. It says that slavery is legal if it is imposed as part of a conviction for a crime. All manner of people benefit from the system; as Mother Jones has reported, Congress actually incentivized private companies to use inmate labor, and the incarcerated now produce everything from bedding to eyeglasses. They even staff call centers, with a company called UNICOR encouraging companies to “smart-source” their call-center work to prisoners rather than sending it overseas. But two possibly unexpected beneficiaries of the contemporary prison slavery system were none other than Bill and Hillary Clinton, who during their time at the Arkansas governor’s mansion in the 1980’s used inmates to perform various household tasks in order to “keep costs down.” Hillary Clinton wrote of the practice openly and without any apparent sense of moral conflict. The Clintons’ practice has gotten some renewed attention over the last day, with the rediscovery of the relevant passage from It Takes a Village. Last year I wrote a bit about Hillary’s admission in my book Superpredator: Bill Clinton’s Use and Abuse of Black America: Clinton was, however, generous enough to allow inmates from Arkansas prisons to work as unpaid servants in the Governor’s Mansion. In It Takes a Village, Hillary Clinton writes that the residence was staffed with “African-American men in their thirties,” since “using prison labor at the governor’s mansion was a longstanding tradition, which kept down costs.” It is unclear just how longstanding the tradition of having chained black laborers brought to work as maids and gardeners had been. But one has no doubt that as the white residents of a mansion staffed with unpaid blacks, the Clintons were continuing a certain historic Southern practice. (Hillary Clinton did note, however, that she and Bill were sure not to show undue lenience to the sla…servants, writing that “[w]e enforced rules strictly and sent back to prison any inmate who broke a rule.” Indeed it’s really difficult, given the facts, to conclude that this practice was anything other than slavery. The Clintons were perfectly content to be waited on by black people who received no compensation and would have been pursued and dragged back in chains if they had tried to leave. There is only one word for such an arrangement. One could almost respect the honesty with which Hillary spoke of her use of convict labor. She acknowledges that these men were black, and that she had a strict policy of sending them back to prison if they violated any rules. But Hillary Clinton isn’t like the Atlantic writer who dwelled on his upbringing as part of a family who held a woman in a state of slavery. Her forthrightness in It Takes a Village is not because she is attempting to grapple with the atrocity in which she was complicit, but because she doesn’t see anything wrong with what happened. Whereas many of us would be appalled at the idea of having our meals served by unpaid black servants, Clinton found the whole situation quaintly traditional, and was favorably impressed by the financial benefits of not paying her staff. What others might call “a crime against human dignity,” Clinton referred to in It Takes a Village as simply “an unusual aspect of living at the governor’s mansion.” The Clintons’ use of prison labor was only one small part of a long and horrifying record. Both Clintons, but especially Bill, have consistently manipulated black political interests while showing complete disregard for the humanity of African Americans. This stretches from Hillary’s perpetuation of a hideous racist myth about a wave of hyper-violent “superpredators” to Bill’s politically-motivated execution of a mentally disturbed black inmate. Predictably, when people started to mention how disturbing it was that the Clintons had kept slaves, a few especially committed online Hillary fans began to issue impossibly contorted defenses, including blaming “DudeBros” for bringing the matter up and explaining that Hillary had tried to empathize with the convicts. (To see why the defenses fail, simply imagine how laughable they would seem if applied to any other situation of unpaid black labor, e.g. if a 19th century Southerner offered them.) But let’s also be clear: the issue of prison labor isn’t just about the Clintons. I believe the Clintons have an indefensible record of behavior toward black people. But the story of the Clintons in the Arkansas governor’s mansion also just illustrates how ubiquitous and taken-for-granted situations of slavery are. It’s very easy to think “But that couldn’t possibly be slavery, the state is just assigning inmates to an interesting work detail.” Yet if we examine the facts critically, it’s hard to see how it could be anything else. Prison labor doesn’t seem like slavery because it no longer displays some of the imagery associated with slavery in our minds, such as the whippings and the auction blocks. But we’re still dealing with a situation in which people are working by compulsion rather than choice, and are threatened with violence if they leave. They are leased to corporations, as if they are property. The auction block may be gone, but the core aspect of slavery is not that people are bought and sold. Rather, it’s about the kind of dominance that is asserted over them. (After all, slavery can exist even if one party has a monopoly on slaveowning. It’s the forced labor and the experience of the slave that counts, not the trading element.) Of course, one could draw a distinction between “slavery” (in which a person asserts all rights over a human being, including the right to sell them and their children and to take their life) and “involuntary servitude” (in which a person is simply forced to work), a distinction such as the Thirteenth Amendment contemplates. But “involuntary servitude” immediately begins to sound like little more than a euphemism for slavery, and many of the situations that modern anti-slavery advocates would consider to be slavery—such as that perpetrated by Alex Tizon‘s family—do not necessarily include people being murdered and having their children sold. (Though they sometimes do.) It is important never to minimize the distinct horrors of early American slavery, but the term also applies to situations in which the victims are treated comparatively “well,” and which are not characterized by all of the worst features of the pre-Civil War South. Thus I do think it’s fair to classify prison labor as a form of enslavement. Degrees of force obviously vary, but since the Angola prison plantation today looks exactly the same as it did in the 19th century, I believe the word helps us appreciate the evils of mass incarceration rather than diminishing the evils of the antebellum era. The Clinton slavery controversy should not really be about the Clintons. It’s the prison labor system as a whole that is rotten, and they were only two especially amoral beneficiaries of it. Today, our attention should be focused on the cotton-pickers of Louisiana and the scores of other modern-day slaves. This is not a mere pathology of the Clintons, but a pathology of the country we all inhabit. And it is not just a single noxious political family that is complicit. We all are. June 8, 2017 Sean Adl-Tabatabai News, US 3 ", "source": "yournewswire.com", "title": "Bill And Hillary Clinton Owned Slaves In The 1980’s"}