{"text": " NEW YORK CITY, New York –Â A vicious schoolyard fight took place after school on Friday afternoon, and terrorist group ISIS has claimed responsibility for the attacks. Nicky DeCarlo, 7, was reportedly attacked by a “big bully,” during lunch recess, and tattled to his teacher. When the bully, 9-year-old Al Giovannelli, found out he was in trouble, he told DeCarlo that they were going to “fight after school.” “It is really such a common thing, kids fighting and bullying and what not, but at this age, we tend to just call the parents, try a little mediation, maybe keep them in from recess, and everything is okay,” said Principal Stephanie Biro. “In this case, the kids were actuallyÂ fine by the next day. They quickly became friends after the fight, and Little Al even said he was sorry for punching Nicky in the face. It’s pretty common with kids to ‘hate,’ and then feel bad. The real confusion here comes with why ISIS has claimed responsibility for the fight.” According to police, ISIS stepped in and said that they were responsible for the altercation, and made several posts on social media stating they were the perpetrators. “Al is definitely not in ISIS,” said his mom to local news channel WBTU – New York. “I know that any time there is a big attack, anywhere in the world, these terrorists like to claim responsibility, but this is just getting silly. We’re not in ISIS. Albert doesn’t even know what ISIS is. They’re really reaching here.” “WE HAVE CLAIMED THE SCHOOL YARDS OF AMERICA, WE HAVE CAUSED THESE FIGHTS. THIS IS OUR TIME, AND ALL INFIDELS WILL REAP WHAT THEY HAVE CREATED,” read a post made to Twitter from an “official” ISIS account. “WE HAVE CAUSED THIS FIGHT TODAY. ALL CHILDREN WILL BECOME MEMBERS SOON.” Police are not at all taking the statementÂ seriously.\n\n\n|Tweet\n|Like0\n\n\n\n\n\n\n\nComments comments comments Posted on June 5, 2017 by Bob The Empire News Potato Bob The Empire News Potato 0  | | 0 | | 0 Posted in Headlines Tagged bullying, Fight, ISIS, school yard, Schools", "source": "empirenews.net", "title": "ISIS Claims Responsibility For Playground Fight at NYC Elementary School"}