{"text": "CINCINATTI,Â Ohio –Â A 31-year old woman was admitted to the University of Cincinnati Medical Center yesterday after the 14-month old toddlerÂ she was babysittingÂ got stuck in her vaginal cavity. Latifah Brown reportedly called 911 and told the operatorÂ that she had “a baby stuck in her vagina.” The operator dispatched an ambulance with the report that a woman was having a home birth. The paramedics who were dispatched say they were surprised when they arrived to the homeÂ and saw what was actually happening. Brian Whitmore, the lead paramedic on the scene, related the incidentÂ in an interview with WCNN News8Now: â\u0080\u009cThe little boy wore a diaper and pyjamas, but he had his legs and abdomen stuck up inside the womanâ\u0080\u0099s vagina. It was horrifying and hilarious. Horrifying because the baby was screaming, but hilarious that this woman had a toddler hanging out of her cooter.â\u0080\u009d The paramedics tried to release the child while still in the home, but Brown’s vagina was reportedly “too clenched,” and the pair were taken to a local hospital, where doctors spent nearly two hours surgically removing the child from Brown’s vagina.Â Dr. Gene Larkin, who performed the surgery, was also interviewed by WCNN: â\u0080\u009cI donâ\u0080\u0099t know how she got the child in there!Â We tried pulling him out, but it didn’t work. It appeared that Brown’s vagina, not use to anything being inserted into it, had clenched down on the poor baby to the point that we literally had to use the Jaws of Life to get him out. According to the doctors, Brown’s vagina has been “completely destroyed” by the act, and they are doubtful that any number of surgeries could fix the damage.Â The young boy suffers from a dislocated hip, but doctors say that because of his age, he should not see any long-term effects. BrownÂ was interrogated by police, and eventually confessed to deliberately inserting the child in her vaginal cavity, because she was barren, and just wanted to know what it would feel like to “give birth.”Â Brown faces a total of 11Â criminal charges, including aggravated child neglect causingÂ bodily harm, and facesÂ up toÂ 65 years in prison if convicted.\n\n\n|Tweet\n|Like0\n\n\n\n\n\n\n\nComments comments comments Posted on May 28, 2017 by Bob The Empire News Potato Bob The Empire News Potato 0  | | 0 | | 0 Posted in Weird News", "source": "empirenews.net", "title": "Babysitter Facing 65 Years in Prison For Inserting Toddler Into Her Vagina"}