{"text": "DAVE WEASEL BOSTON, MA – A 19-year-old woman beat her roommate to death with an industrial sized bag of jelly beans on Tuesday afternoon. The woman was reportedly frustrated by the amount of invites received for the popular Facebook game Candy Crush. “It started off as once a week,” the woman said in her statement. “Soon it was happening every day. My battery was constantly dying from notifications from this girl. I tried disabling notifications, I tried blocking her, I tried everything except murder. Now I’ll never have to see that horrible notification again.” The police issued a warning to people sending out the invites. “Not to blame the victim, but this woman was asking for it. We all know you have no life. We all know part of you is embarrassed the same people have to see the same notification from you, but you send it anyway. For your own safety, stop sending these invites.” Follow the author on  Facebook | Twitter | Instagram writer | comedian | musician | canadian | etc Wow i glad its fake or that be one dumb bitch an how did her batery die? I call bullshit an if u block someone they cant send u invites so who ever wrote this is stupid lol youre a moron. Dont breed Would anybody like to play Candy Crush with me?  OUCH. it’s too bad that this isn’t real.  Of course it would have been more entertaining if rather than beating the roommate instead the jelly beans  had been shoved up her nostrils  and force fed to her until she choked to death slowly and painfully a fitting video death.  Although then Pelosi would have to start a petition for common sense jelly bean laws U are one fuck up person haha! I can’t believe how many people believe this story.. lol.. omg! “beat her with a bag of jelly beans…  hahaha! It’s a joke people! Turn Off Your  Notifications Idiot!    Come on   Jelly Beans  well at least she was creative … But you came here as well… 🙂 Okay.. I’m just as annoyed as anyone when I get these requests and I had a short period where my mom was obsessed and would bother me for lives as well but murder is just a little overboard though to stop the notifications.. You are aware that this is satire…right? I think she took the appropriate actions towards the sender of the candy crush invites Fair enough, they’re annoying as hell. WHAT ARE YOI TALKNBG ABOUT OMG… Dear you would have advanced a day in date n time setting….. when u get no life… By advancing day u will get 5 lives (check Candy Crush) once again… now before start playing reset yr current date…… Y to lose own life to get candy crush life 🙁 Jellybeans!! 😉 Fake “news”, yes, but if it were real, good luck finding a jury that would vote to convict…. Shut the fuck up with the fake news shit. Its fucking satire. Its meant to be funny. If you believe this is news you should just go eat a bullet People should tell Urban Leak that this article they are copying and pasting (on their site) from this site is fake. Also terrible journalism. Here is a link. It’s pretty much taken verbatim. Funny thing is that the previous post is an actual news story. Maybe Urban Leak is trying to skew people’s perceptions of reality. Good job so far. http://urbanleak.com/woman-murders-college-roommate-for-sending-too-many-candy-crush-invites/ Hey thanks for that. I gave them permission because they link back to us. Of course it’s fake. It says it under disclaimer. But those guys troll highly searched items to make money from click bait ads. They make way, way more than we do from our shit, but we just like to make people laugh. My apologies- totally slipped my mind. I thought it might become toxic since Urban Leak doesn’t say that it is false, and does not have a disclaimer like Valley Report does. Nobody reads the fine print, right? Anyways, I don’t know how to take down my previous comment, but I still stand by my opinion. Thanks for the reply! For sure. Urban leak is shameless click bait plagiarism. I’ve confronted them before but now they [he] link back. The funny part were all the comments about this article. Hysterical!! And now I even know how to correctly use a comma in a sentence. As much as these comments are cracking me up, this fake “Newsworthy News” by Dave Weasel does not hold a candle to the related stories listed… HYSTERICAL! Everyone here has so many great comments on here *sigh* but what everyone in the whole nation is blind to is that we need to finally stop putting up with this bull and finally tell people who are doing these things to get up off there chair/couch whatever and tell them to do something more productive. Their just trying to get a shock factor out of people and they are winning when we reply!!!! So don’t reply next time you see stuff like this absolutely DO NOT REPLY!!! ~Alway be anonymous~ Umm…you are replying! “Anonymous” means nothing. It goes by your account and/or computer address. If you ever want to see if something is false just check snopes.com this one is false No shit really?! Really?! If * ,Sean Penn, can become, “numero uno” his cell block after, beating another with, a pillow sack of soda cans, in a movie titled, “Bad Boys”,  I’m buying this!  “;:*'”:…,,”‘.   hope all can appreciate, all the extra, “commas”, quote, unquote, quotation marks, etc…….  I added for you!!!! These requests aren’t sent, intentionally or actively, from the sender; they are automatic, unless the sender disables that function in her settings. NO WOMAN DESERVES TO GO TO JAIL!!!  Where ARE THE FEMINISTS???!!! The patriarchy will not hold us in a system designed for them any longer!! This is the opisite of feminism. Please do your research. EQUALITY OF THE SEXES! Not privaliges for women. Ignorance. Reblogged this on Hub Telegram. U kill becuz someone really hurt or tortured you’re loved once. Not because you have notification off Facebook. What kind of drugs was she on? Stupid s*** !!! What kind of stuff r they teaching people? Read a damn book or get a hobby! Don’t kill people over a stupid game. Um. Just no.  You don’t kill period.  Murder is never justified.  And this post was fictional,  meaning it’s not real.  The author was being sarcastic.  Wow. What kind of drugs are YOU on to believe faux news??\nHello? It is FAKE!!\nLMAO! It’s fake you peanut 🥜 You peanut”, Lmao.😂 Justifiable homicide.  No juror with a Facebook profile would convict her Just thought I would add that a comma is used to mark a pause between parts of a sentence. Therefore it is unequivocally used improperly in this case. Also a period is unnecessary after the use of an asterisk when making a statement. But I teach English so  what do I know lol You should have added a comma after “therefore”. Oh, and you should also have one after “also”. And there is a missing question mark at the end. I thought English teachers knew how to properly use punctuation. If you want to try using your education to belittle others then you should at least proofread. You literally told us how to use the comma and failed to use it in the way you described. *facepalm* Lmao! Right on! Teach the teacher!\nI love it when the smart-asses get put in their place. AMERICAS FUCKED!! http://www.snopes.com/candy-crush-murder-false/ http://thevalleyreport.com/2016/02/18/obama-to-recruit-group-of-super-geniuses-from-comment-sections-of-satire-articles/comment-page-1/ Internet is ruining our world….. PERIOD!!!! Defend it all u want but this type of Shit never happened before we had fb or any of them Damn social websites……. easier for relationships to be ruined (friends family or lovers) I knew a certain “Train Wreck From GTech grad” who kept getting woken up every time one of the cows on his kids FarmVille account needed milked.  He was such an idiot he didn’t know how to turn off the notifications on his Droid. this has to be fake This is all bs, check facts, it isn’t hard, the womans face that appears in this fairytail has been used in lots of different stuff, clearly the author of this has had way too much chemical enhancement!! Maybe this is the real story and all those other stories are bs. It’s called satire, genius. You really think someone got murdered with “an industrial sized bag of jelly beans?” The author is joking. Your comment is idiotic.\nThis is a SATIRE website.\nRead the f-ing disclaimer.\nYou need to remove yourself from the gene pool. Lol Well its not the other woman’s fault she couldn’t figure out you can turn off those requests. I haven’t receive a request in 2 years. Simply turn them off as you get them To those that believe that this is real, please don’t reproduce. The country is dumbed down enougj as it is. Enough*.  If you are going to spend your precious time on earth talking shit on the internet, about the intelligence of others, at least have the decency to proofread. Why did you even bother to respond? Please take the time to remove the unnecessary comma from your post before mocking the intelligence of the person who is mocking the intelligence of people on the internet. Thank you. Adding the comma after “internet” is incorrect. Thought you’d want to know.\nI’d probably have the “about the intelligence of others” directly follow “talking shit.” It flows better. Let’s obsess over an obvious typo, and ignore the valid point. This clearly SHOULD be talked about as I constantly hear teachers whining and complaining they don’t make enough money. This is why I’m a firm believer in NOT giving them raises. They produce people who don’t comprehend basic English. Most people can’t do Math without a calculator. Hell yeah let’s talk about this! BTW, Internet is also capitalized as it is a proper name. No, you’re all, wrong? Comma is for every-one, to use, freely. Grammer is for every-one, to. Dont you think this is impending Enough The comma is actually correct. They are put in sentences around a phrase that can be taken out of the sentence and still make sense. You didn’t spell enough right but you call people dumb😂😂😂😂 Ha!  Easycheese is a dumbass imp! I know this is fake. However, considering some of the dumb stuff people are really getting killed over is this really out of the realm of possibility? Some people do some of the dumbest shit every day. We would have more people who can’t spell if you reproduce Enough*** 😂😂 Next time block the App. It is very simple to do ADD ME IN FARMVILLE 2 I AM KILLING IT RIGHT NOW ANDRE4000@GMAIL.COM IS HOW YOU WOULD ADD ME IN YOUR FARM I know this is fake but believe if it were real that it is valid reason to kill someone […] 7. Woman murders roommate for sending too many Candy Crush requests Here’s even more silliness from daft fake news purveyors The Valley Report. This extremely widely shared piece of fake news reported on the murder of a 19 year old Candy Crush addict, whose constant game requests drove her college roommate to bludgeon her to death with an industrial-sized bag of jellybeans. Clearly fake, but with 438,599 Facebook engagements, some readers bought it. […] News Facebook Comments Advertisements News News News 0  0 4  4 2  2 1  1 0  0 1  1 3  3 0  0 0  0 1  1 1  1 0  0 1  1 0  0 1  1 0  0 0  0 1  1 1  1 0  0 1  1 0  0 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 1  1 1  1 0  0 0  0 1  1 0  0 0  0 0  0 0  0 1  1 0  0 1  1 0  0 1  1 0  0 0  0 1  1 1  1 0  0 0  0 1  1 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 1  1 2  2 1  1 0  0 0  0 1  1 0  0 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 1  1 0  0 1  1 0  0 0  0 1  1 0  0 0  0 0  0 1  1 0  0 1  1 1  1 0  0 1  1 0  0 0  0 0  0 0  0 0  0 1  1 0  0 0  0 1  1 1  1 0  0 1  1 0  0 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 1  1 0  0 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0", "source": "thevalleyreport.com", "title": "Woman murders college roommate for sending too many Candy Crush requests"}