{"text": "DAVE WEASEL GAINESVILLE, FL – A 37-year-old man is dead after his trailer home was destroyed in a meth-lab explosion, caused by him lighting up ‘blue angels’ to amuse his wife.  The man’s wife was found lying naked on the couple’s front yard, reportedly still laughing. “A Blue Angel is when you put a lighter up to your butt and fart on it, making it catch on fire. It’s funny as s—,” explains the mans wife, who claims to be an expert on the subject. “Normally we go to Del Taco because of their $0.59 tacos, but we made some extra cash this week so we went to Chipotle. The farts you get from there could fill a gas chamber. I know he’s looking up from hell laughing his ass off saying it was worth it,” she says smiling through blackened teeth, apparently not caused by the fire. The woman plans on suing Chipotle, which failed to address their peppers causing a higher rate of methane in human farts. She offered a statement, “I’m not mad about my husband dying, I just got my eyebrows did and now they’re gone.” Chipotle Mexican Grill has yet to respond. Follow the author on  Facebook | Twitter | Instagram  writer | comedian | musician | canadian | etc Weasels lady shod try Campbell’s pork& beans next try,I swear yesterday those toots probably weighed out on a digital (may b an oz. or 2) Lmao i see from the comment section there is going to be several more “Blue Angels” ! Half the page has to be a fucktard convention reunion !!! used to have many blue angel * party,s never caused  a   fire but one of the best was when  my  t friend  Jake,s  wife wanted to do it and igot a good look at her huge hairy cunt gross! Ew Gotta love this fake news!!! Hahaha Your comment is idiotic.\nThis is a SATIRE website.\nRead the f-ing disclaimer.\n(Unless that was sarcasm my bad) think the guy left any money to his wife? Remember the old saying, ” A 2 at 10 is a 10 at 2″. This is why we cannot loose the right to speak freely. If it were not for this right I would have never known that I should probably wait for my eyebrows to grow back before I start dating again. The gooder news is I have a dentist appointment on 31 March at 8:30. RIP He ain’t heavy he’s my brother. Okay, so this is fiction, right? Hey It’s Flawida and I am surrounded. But the stories, real and fake are fun. just never go to a convenience store after dark. Who cares Bean your just mad course you didn’t think of it The rest of us care we are still lol I do Is this shit actually true???? Only his hairdresser knows for sure. Well, that does it. I’m resigning my membership from “All Lives Matter.” Yep. Join Team Flare. They share your beliefs One less Trump vote.. Now that he’s dead he’s voting for Hillary I likely don’t agree with your politics but that was really funny. Really? You just had to make it political. I’m so tired of that stuff. Dumb ass, people like this voted for Hillary and public assistance. Fuck tard. Your a blue angel sniffer. Probably love the dutch ovens as well. So she is single AND no eyebrows?,,mmmm,im in lust baby. Dont forget her black teeth that weren’t caused by the fire. Once you go black… It also appears that soon she will be without teeth. You can call her your little gummy bear. LOL mod..the visual is tantalising.. And dentist is gonna fix her black teeth, apparently not done by the fire. Wow, that was brutal !! sometimes you don’t need a rent a midget or dwarf talent to laugh… f##k hillary. And Trump..lol they both are fucked up.. What they have to do with this post. Stick with the subject. You sound like you in your feelings He should have been concentrating on his work, and not farting around. Sequel idea for Breaking Bad…”Breaking Wind”. Flatulence Didn’t Set off a Meth Lab Explosion\nFACT CHECK FAKE NEWS\nPosted Feb 16, 2016 by Dan Evon\nA fake news article claimed that a man caused a meth lab explosion after lighting his own gas on fire. The most disconcerting part is that people appear to actually think this is a real story.  God help us all. Yes, some of my friends were very happy for his demise cheering for Darwin and congratulating him and his actions for removing himself from the gene pool. he’s a Hillary supporter WAS is the operative word a lot of Hillary supporters continue to vote democrat after they die.. Too bad he’s a Hillary supporter How do any of you believe this actually believe this shit? wow. nice sentence structure. Guess you can’t type with your mouth full of dick. What he did was stupid!    Don’t blame the person posting the article.    And what does Trump have to do with this??? Hey was a MAJOR TRUMP suppoter in his community It’s a fake story, so no one is taking it seriously, sort of like the campaign. This is not real And after reading this im still not any smarter than i was before.  But thanks for the laugh Stupid peoples’ lives matter No they don’t. Including most of the replies here thinking it’s serious. Khal Drogo really let himself go didn’t he????? Too bad..and he was a Trump supporter Joe.. Go back to school. Earn a degree, Then you can quit blaming people that work 12 hours a day for you being a slacker.. Man up. Joe, I hear they just left an orgy at one of the Clinton’s mansions payed for by foreign graft. Just what you’d expect from a Trump (or Cliton) suppoter *Clinton Omg this is the funniest shit I herd in awhile even know it’s fake. Chipotle is good but it does give you the farts.lol C’mon, hon, you’re better than that:  “…even THOUGH it’s…” Who believes this shit? Single guys? . . .She sounds like a real catch! Real life beat you to it. @TheOnion Should of read before I commented I see Lol is his picture before or after the explosion! Lmao Lolololol you are exactly the type of person this article is directed at, stupid and gullible whiny little cry baby. oi yer a loser and dum an prolly a fekking arse bandit poofter jus fer havin thet name trust You stupid fuck, stay away from the keyboard until you can type in English. Effects of inhaling blue angels while on meth Mc Fever?,,got it bro’. This picture was made during the explosion on a high-speed camera One less slime ball and meth lab gone! Good Riddance! She (the wife) should have a ton of charges like destruction,deadly materials,meth lab,intoxicated is a light word for someone surviving,had just lost her husband and complaining only about her eyebrows giggling/laughing! She should be committed and or locked up on lock down! Like I said GOOD RIDDANCE !!!!! I was talking to Faye Fliyd, say sum BITCH ahaha When you died it will be a relief on your family cause I bet u judge them and everyone around you and bitch about not getting fucked right people do fuck up sorry not everyone is not like u born a unsinful person so you have never got sick and took meds well that what it is like just he didn’t stop it is a  disease allergy I’m sure no one in your family is a pothead pill head crackhead if I was in your family I had to be all of the Dill with you do the next time you want to say something about someone go buy a 21 in dildo and sit on it and set on it and fuck yourself k have and nene good fucking That was to faye by the way lol Were you drunk when you typed this?  Or tweeking? Wow, that was brutal !! Smh So the wife is single now??? I think his wife was single long before the meth lab exploded… Yes, but she’s not going to start dating until her eyebrows grow back in. Remember, kids, farts kill. And speed kills farts. And people don’t kill speed, farts do.And speed farts plus lighters kills method labs…and…what the fuck was I trying to say??? Fucking tweak. […] to The Valley Report, the woman plans on suing Chipotle, claiming they failed to address their peppers causing a higher […] News Facebook Comments Advertisements News News News 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 2  2 0  0 0  0 0  0 1  1 0  0 0  0 0  0 0  0 0  0 1  1 0  0 0  0 2  2 0  0 0  0 0  0 0  0 0  0 1  1 0  0 0  0 1  1 0  0 0  0 1  1 0  0 0  0 2  2 0  0 0  0 1  1 0  0 2  2 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 1  1 0  0 1  1 0  0 1  1 0  0 0  0 2  2 0  0 0  0 0  0 1  1 0  0 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 1  1 1  1 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 2  2 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0 0  0", "source": "thevalleyreport.com", "title": "Florida man dies in meth-lab explosion after lighting farts on fire"}