{"text": "June 6, 2017\nBaxter Dmitry\nNews, World\n9 Video footage has surfaced of Sadiq Khan, London’s Muslim mayor, defending a 9/11 conspirator, and arguing that the case against the terrorist should be dropped completely as it was “a farce of a trial“. “There is no evidence at all against the three British men. The only evidence against them is these three confessions. We now have unequivocal proof that the confessions were obtained under duress and under torture. As there is no evidence against the men, the men need to be released straightaway and sent back to their families.“ This was despite the fact that Zacarias Moussaoui, who pleaded guilty to involvement in 9/11 and with Al Qaeda, told the court: ”I, Moussaoui Zacarias, in the interests to preserve my life, enter with full conscience a plea of guilty, because I have knowledge and participated in Al Qaeda.” Is this the record of a man who should be leading London?  Sadiq Khan was a human rights lawyer before he entered politics, and spent his time defending radical Islamists and self-confessed terrorists. He also defended hate preacher Louis Farrakhan in 2002, arguing that the Nation of Islam leader should be allowed to enter the UK to embark on a propaganda tour. Bidding to have the ban on Farrakhan entering the UK overturned – a ban that had been upheld by successive Home Secretaries since 1986 – Khan told the BBC: “He is preaching a message of self-discipline, self-reliance, atonement and responsibility….It’s outrageous and astonishing that the British Government is trying to exclude this man.” Louis Farrakhan, according to the BBC; ‘was (a) man who had described Judaism as “a gutter religion”, characterised Christianity as an oppressive faith linked to the slavery of black people and called Adolf Hitler “great”. To any liberal who says “Sadiq Khan was just doing his job!” ask them if they would say the same if Jeff Sessions was defending the KKK in Alabama (instead of prosecuting them like in reality). If he was an aggressive Klan defense lawyer, would they still say “he was just doing his job”? Of course not. Liberal hypocrisy runs deep. Sadiq Khan is now attempting to have President Trump barred from entering the UK, arguing that his “policies go against everything we stand for“, however rolling protests against the mayor and his pathetic response to the terror attack in London on the weekend suggest Londoners are waking up to the truth about their “liberal Muslim” mayor.  June 6, 2017 Baxter Dmitry News, World 9 ", "source": "yournewswire.com", "title": "Video: Sadiq Khan, London’s Mayor, Defended 9/11 Terrorist"}