{"text": "Let friends in your social network know what you are reading about Two inmates are accused of killing two guards on a prison bus and fleeing in a carjacked vehicle. A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Investigators in Georgia say they found the green Honda stolen by two prison inmates who killed two guards and escaped on Tuesday. Authorities say it appears Donnie Rowe and Ricky Dubose hid the car, ransacked a house and fled in a pickup truck. (June 15)\n    AP A handout wanted poster image released by the FBI of 43-year-old Donnie Russell Rowe, left, and 24-year-old Ricky DuBose.(Photo: FBI handout, EPA) The manhunt intensified and expanded nationwide Thursday for two \"vicious\" Georgia inmates accused of killing two guards and fleeing a prison bus two days ago. The reward for information leading to the capture of Donnie Russell \"Whiskey\" Rowe, 43, and Ricky Dubose, 24, rose to at least $130,000, Putnam County Sheriff Howard Sills said. \"This is the greatest (search) effort I have ever seen, and it’s not just because of the crime. It’s because the public is in grave danger,\" Sills said. \"These are dangerous, seriously dangerous, vicious hoodlums that need to be apprehended.\" Authorities say the men overpowered the guards, killing them with their own weapons, before fleeing the bus near Eatonton, about 70 miles southeast of Atlanta early Tuesday. They carjacked a passerby's 2004 Honda Civic at gunpoint, and Sills said the duo ransacked a house 25 miles away later that day, taking food and clothes. Sills said the men then walked several miles before stealing a white Ford pickup at an industrial site sometime before 6 a.m. Wednesday. Since then, nothing. \"We are actively looking for this truck, and these two individuals,\" Sills said. \"They've had time to be half way across the United States.\" Read more: Manhunt: Georgia inmates kill 2 guards, carjack to freedom Texas woman freed from life sentence by President Obama is back in prison The FBI is leading the investigation. David LeValley, special agent in charge of the Atlanta office, said law enforcement was increasing the search effort — and is prepared to maintain a massive effort until the men are found. \"It has become a nationwide search,\" LeValley said. \"We need the eyes and ears of everybody, really, in this country to be on the lookout.\" The prison bus was equipped with security video and had 31 other inmates in its cage, Sills said. Police arriving at the scene found the other inmates handcuffed inside the locked truck with the engine running. Sills said investigators were trying to determine how the killers got out of the cage and into the driver's compartment. He said he feared the killers, armed with the officers' semiautomatic handguns, would kill again. Sills said he watched the video but was not certain which inmate killed Sgt. Christopher Monica, 42, a corrections officer since 2009, and Sgt. Curtis Billue, 58, who would have marked his 10th anniversary with the department next month. The two inmates had been cellmates from time to time in the state prison system. Dubose was serving a 20-year sentence for armed robbery, aggravated assault and theft from a 2014 case. Rowe has been serving a life sentence since 2002 with convictions including armed robbery, possession of a firearm during a crime and aggravated assault. Sills said he doubts the men remained in the area. \"We are looking for them anywhere they might be on planet Earth,\" he said. Facebook Facebook Twitter Google+ LinkedIn Pinterest   Post to Facebook 10 John Bacon, USA TODAY Published 11:54 a.m. ET June 15, 2017 | Updated 3:08 p.m. ET June 15, 2017 Updated 3:08 p.m. ET June 15, 2017 AP  A handout wanted poster image released by the FBI of 43-year-old Donnie Russell Rowe, left, and 24-year-old Ricky DuBose.(Photo: FBI handout, EPA) A handout wanted poster image released by the FBI of 43-year-old Donnie Russell Rowe, left, and 24-year-old Ricky DuBose. (Photo: FBI handout, EPA) CONNECT  CONNECT  TWEET  LINKEDIN 10\n                \n            COMMENT 10 COMMENT EMAIL  EMAIL MORE  MORE CONNECT  CONNECT  TWEET  LINKEDIN 10\n                \n            COMMENT 10 COMMENT EMAIL  EMAIL MORE  MORE", "source": "www.usatoday.com", "title": "Manhunt expands for 'vicious hoodlums' who killed Georgia prison guards"}