{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window Sterling surged by almost a cent against the dollar after three Bank of England rate-setters voted for a rise in UK interest rates. The Bank kept its key interest rate at 0.25%, as expected, but the 5-3 split among policymakers was the closest vote for a rate rise since 2007. The pound was boosted as the vote raised the possibility of rates rising earlier than had been expected. Sterling hit $1.2795 at one point, but then fell back to $1.2759. However, it held on to gains against the euro, standing 0.7% higher at 1.1448 euros. Minutes from the Bank of England's latest meeting showed that Monetary Policy Committee members  Ian McCafferty and Michael Saunders had joined Kristin Forbes in voting for a rate rise. However, some analysts judged that the possibility of an early rate rise was still distant, despite the closeness of this month's vote. \"We continue to think that a majority of MPC members will vote to keep interest rates on hold this year,\" said Samuel Tombs, chief UK economist at Pantheon Macroeconomics. \"This was Kristin Forbes' last meeting, so the number of hawks likely will decline at the next meeting in August.\" On the stock market, news of the Bank's decision pushed the FTSE 100 share index down. At the close the index was down 55.04 points, or 0.74%, at 7,419.36. The FTSE 100 often moves inversely to the pound as many of the firms in the index have significant earnings overseas, and a stronger pound means these profits are worth less when converted back into sterling.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nGetty Images Image copyright Getty Images", "source": "www.bbc.co.uk", "title": "Pound volatile after surprise Bank vote"}