{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window The State Opening of Parliament and Queen's Speech will take place next Wednesday, Commons leader Andrea Leadsom has announced. It had been due to take place on Monday, but was delayed by Theresa May's efforts to strike a deal with the DUP to back her minority government. The Queen will \"dress down\" to read the speech in a break with tradition. It is expected to be a slimmed down programme after the PM lost her majority in the general election. It is not yet clear whether EU withdrawal talks, which had been due to start on Monday, will also now go ahead on Wednesday, although Brexit Secretary David Davis has said they will start \"next week\". In a statement, Mrs Leadsom said: \"The government has agreed with Buckingham Palace that the State Opening of Parliament will take place on 21 June 2017.\" Labour leader Jeremy Corbyn is planning to set out his party's own programme for government in a substantial amendment to the Queen's Speech, and will urge all other parties to back it in an attempt to topple Mrs May and form a minority Labour administration. But the Conservatives are confident they can agree a deal with the Democratic Unionists, who have 10 MPs, that will allow them to get their programme through. A senior Conservative source told BBC News: \"The PM saw the Queen yesterday (Wednesday) and agreed the timing of the speech. \"Talks are progressing well and the two parties are in broad agreement on the principles of the Queen's Speech. \"Both parties are committed to the Union, Brexit, combating terrorism and prosperity across the UK. While talks are progressing it's important the government gets on with its business. We are confident there will be sufficient support for passing the Queen's Speech.\" Buckingham Palace has said this year's state opening and Queen's Speech will take place with \"reduced ceremonial elements\". Her Majesty will not wear her Imperial State Crown or robes and will travel to the Houses of Parliament by car rather than horse-drawn carriage. The traditional Royal procession will also be scaled back and the annual service of the Order of the Garter has been cancelled for the first time since 1984. Buckingham Palace said the changes had been made because of the proximity of the State Opening of Parliament to the Queen's Birthday and Trooping the Colour parade on Saturday. Her Majesty is expected to attend day two of the Royal Ascot race meeting on Wednesday after the State Opening earlier in the day. Talks are continuing between the DUP and Conservatives on the details of a deal, which could see the Northern Irish party supporting the Tories on the Queen's Speech and the Budget but deciding on other issues on a vote-by-vote basis. Mrs May is holding talks on Thursday with other Northern Ireland political parties amid concerns a DUP deal will undermine the peace process. The prime minister was meeting separately with representatives of Sinn Fein, the Ulster Unionists, the SDLP and the Alliance Party, as well as the DUP, in Downing Street. DUP leader Arlene Foster, who met Mrs May in No 10 on Tuesday, is understood to have returned to Northern Ireland leaving her deputy Nigel Dodds to represent the party at Thursday's meeting. The 1998 Good Friday Agreement commits the UK and Irish governments to demonstrate \"rigorous impartiality\" in their dealings with the different political traditions in Northern Ireland. Sinn Fein's Stormont leader Michelle O'Neill said: \"I will be making it very clear that any deal between the Tories and the DUP cannot be allowed to undermine the Good Friday and subsequent agreements.\" Northern Ireland Secretary James Brokenshire insisted the government would honour its commitments in the Good Friday Agreement and warned that time was running out if power sharing was to be restored and a return to direct rule from Westminster avoided. \"An agreement to restore devolved power-sharing government in Stormont must be reached by the 29 June deadline,\" he said.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nAFP Image copyright AFP Image copyright\nPA Image copyright PA Image caption DUP Leader Arlene Foster met the prime minister in Downing Street this week  Image caption The Queen will not use the traditional horse-drawn carriage this time", "source": "www.bbc.co.uk", "title": "Queen's Speech to take place next week"}