{"text": "By PETER BAKER and JONATHAN WEISMANAUG. 31, 2013 American presidents generally want support from three places: Congress, the American people and allies abroad. In the case of a possible military strike in Syria, support may be in short supply. WASHINGTON —  President Obama abruptly changed course on Saturday and postponed a military strike against the Syrian government in retaliation for a chemical weapons attack so he could seek authorization first from a deeply skeptical Congress. In one of the riskiest gambles of his presidency, Mr. Obama effectively dared lawmakers to either stand by him or, as he put it, allow President Bashar al-Assad of Syria to get away with murdering children with unconventional weapons. By asking them to take a stand, Mr. Obama tried to break out of the isolation of the last week as he confronted taking action without the support of the United Nations, Congress, the public or Britain, a usually reliable partner in such international operations. “I’m prepared to give that order,” Mr. Obama said in a hurriedly organized appearance in the Rose Garden as American destroyers armed with Tomahawk missiles waited in the Mediterranean Sea. “But having made my decision as commander in chief based on what I am convinced is our national security interests, I’m also mindful that I’m the president of the world’s oldest constitutional democracy.” Although Congressional leaders hailed his decision to seek the permission of lawmakers who had been clamoring for a say, the turnabout leaves Mr. Obama at the political mercy of House Republicans, many of whom have opposed him at every turn and have already suggested that Syria’s civil war does not pose a threat to the United States. His decision raises the possibility that he would be the first president in modern times to lose a vote on the use of force, much as Prime Minister David Cameron of Britain did in Parliament last week. Advertisement Mr. Obama overruled the advice of many of his aides who worried about just such a defeat, and Republican Congressional officials said Saturday that if a vote were taken immediately, the Republican-controlled House would not support action. Interviews with more than a dozen members of Congress made clear that the situation was volatile even in the Senate, where Democrats have a majority. “Obama hasn’t got a chance to win this vote if he can’t win the majority of his own party, and I doubt he can,” Representative Tom Cole of Oklahoma, a leading Republican, said in an interview. “Democrats have been conspicuously silent. Just about his only support is coming from Republicans. He is a war president without a war party.” Advertisement Yet the debate may also put on display the divisions in the Republican Party between traditional national security hawks and a newer generation of lawmakers, particularly in the House, resistant to entanglements overseas and distrustful of Mr. Obama. “It will be an uphill battle for the president to convince me because I think he has handled this entire situation quite poorly,” said Representative Tim Griffin, Republican of Arkansas. “And frankly I am reluctant to give him a license for war when, with all due respect, I have little confidence he knows what he is doing.” Even Senators John McCain of Arizona and Lindsey Graham of South Carolina, two Republicans who have pressed Mr. Obama to intervene more aggressively in Syria, said Saturday that they might vote no because the president’s plan was too limited. “We cannot in good conscience support isolated military strikes in Syria that are not part of an overall strategy that can change the momentum on the battlefield,” they said in a statement. Against that backdrop, the wording of the authorization of force may be critical. White House officials drafted a proposed measure that tried to strike a balance between being too expansive and too restrictive, and sent it to Congress on Saturday evening. The proposal would empower Mr. Obama to order military action to “prevent or deter the use or proliferation” of chemical or biological weapons “within, to or from Syria” and to “protect the United States and its allies and partners against the threat posed by such weapons.” Still, White House officials indicated that Mr. Obama might still authorize force even if Congress rejected it. As Syrian forces braced for attack, the president’s decision effectively put it off for more than a week, since Congress is not due back in Washington until Sept. 9. Mr. Obama did not push for Congress to come back sooner, and House leaders opted to keep to their schedule. Senate leaders set committee hearings to begin on Tuesday with a floor vote “no later” than the week of Sept. 9. Advertisement In the interim, lawmakers will be in their home states, where polls show their constituents are not eager to attack Syria. “One constituent said to me: ‘It is horrendous that these children were killed, but they are being killed in other ways also. What’s the difference?’ ” said Senator Susan Collins, Republican of Maine. Senator Bob Casey, Democrat of Pennsylvania, said public opinion would pose a challenge for the president and Congress. “I’d be very surprised if the position of going forward with the strike would reach 50 percent in our state,” he said. “I don’t think it would get to 50.”  Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. View all New York Times newsletters. The move also means that the period of vacillation before a strike will extend until after Mr. Obama travels to St. Petersburg, Russia, for a summit meeting of the Group of 20 nations, a session that now seems certain to be dominated by the question of what to do about Syria. President Vladimir V. Putin, the host of the meeting, not only has effectively blocked United Nations action, but on Saturday he suggested the chemical attack was a provocation by rebels intended to draw the United States into their war against Mr. Assad. Presidents in modern times have used military force both with and without Congressional authorization. George Bush and George W. Bush both won votes from lawmakers before wars with Iraq, and Ronald Reagan and Bill Clinton launched strikes against Libya, Afghanistan and Kosovo without asking permission. Although Mr. Obama said as a candidate that a president has no power to launch a military attack except to stop “an actual or imminent threat to the nation,” he acted unilaterally in Libya in 2011 and had no plans to act differently in Syria this time. But he found it much harder to proceed alone, given the British vote and polls showing that the vast majority of Americans want Congress to decide. Even allies like Senator Tim Kaine of Virginia, one of Mr. Obama’s earliest supporters for president and his handpicked Democratic Party chairman, publicly argued that he had to go to Congress for permission. “The worst thing we can do is put people out on that limb and ask them to potentially risk their lives based on equivocal political support,” Mr. Kaine said. In making his request, Mr. Obama argued more forcefully than he ever had for military action against Syria, echoing some of the moral outrage expressed by Secretary of State John Kerry a day earlier. “What message will we send if a dictator can gas hundreds of children to death in plain sight and pay no price?” the president asked. Mr. Obama also dispatched Mr. Kerry, Defense Secretary Chuck Hagel and others to brief senators by telephone on Saturday and authorized a classified briefing on Capitol Hill on Sunday. Mr. Kerry was also booked on Sunday television news programs to make the case. Aaron David Miller, a longtime Middle East adviser to presidents, said Mr. Obama had made a persuasive case for action even as he jeopardized it. It “shows just how concerned he is about being alone and his understanding of the realities that even a limited strike can be risky, and he wants to share the responsibility,” he said. Advertisement A deeply divided Congress was already gearing up for bitter fights this fall over federal spending, the debt ceiling, immigration and government surveillance, and the surprise Syria vote will invite a complicated, multilayered debate crossing party lines and involving other actors like Israel supporters who worry that failure to follow through in Syria will embolden Iran. Many lawmakers welcomed the chance to vote. “At this point in the country’s history, it’s important that we have this debate, that we take this vote,” said Senator Bob Corker of Tennessee, the senior Republican on the Foreign Relations Committee. But some argued that Mr. Obama had blinked in the face of a tough choice and possible backlash, and abdicated responsibility. “I strongly believe that the commander in chief has the absolute right to take military action,” said Representative Peter T. King, Republican of New York. “The president seems like he’s weak at every level.” Jennifer Steinhauer and Jonathan Martin contributed reporting. A version of this article appears in print on September 1, 2013, on Page A1 of the New York edition with the headline: Slowing March to Military Action, Obama Seeks Syria Vote in Congress.  Order Reprints| Today's Paper|Subscribe We’re interested in your feedback on this page. Tell us what you think. Supported by Middle East By PETER BAKER and PETER BAKER JONATHAN WEISMAN JONATHAN WEISMAN Share This Page Video By Reem Makhoul and Will Storey on                                                                Publish Date August 31, 2013. Publish Date by Evan Vucci/Associated Press. embed Photo President Obama and Vice President Joseph R. Biden Jr. before Mr. Obama’s remarks Saturday. Credit\n            Michael Reynolds/European Pressphoto Agency Credit Photo President Vladimir V. Putin, in Vladivostok on Saturday, said it did not make sense that Syria would use chemical weapons. Credit\n            Alexei Nikolskyi/RIA Novosti, via Reuters Credit Photo United Nations inspectors returned to The Hague on Saturday with samples to test for chemicals from sites in Syria. Credit\n            Marten Van Dijl/European Pressphoto Agency Credit New York edition Order Reprints| Today's Paper|Subscribe Order Reprints| | Today's Paper| | Subscribe interactive A Broader Look at the War Across Syria video Obama Speaks on Syria Draft Resolution for Use of U.S. Military in Syria Text of President Obama’s Remarks on Syria Lawmakers Respond on Twitter to Obama’s Statement on a Syria Vote", "source": "www.nytimes.com", "title": "Obama Seeks Approval by Congress for Strike in Syria"}