{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window French President Emmanuel Macron has led the global condemnation of Saturday's terror attack in London which left seven people dead. A French citizen was among those killed, the foreign ministry says. The dozens of people injured also included four French nationals. Mr Macron spoke by phone with UK Prime Minister Theresa May, and said France was \"more than ever at Britain's side\". A Canadian citizen was killed, and two Germans were injured, one critically. No names of those killed have been released. \"I am heartbroken that a Canadian is among those killed,\" Mr Trudeau said in a statement, saying Canada stood with the UK. Meanwhile, Australian Prime Minister Malcolm Turnbull said his \"prayers and resolute solidarity\" were with the British. Two Australians were affected, he said, but that number was later increased to three. A woman was in hospital, a man was heading home to Australia, while the status of the third remained unclear. Mr Macron was one of the first world leaders to react to the events. \"In the face of this new tragedy, France is more than ever at Britain's side. My thoughts go out to the victims and their loved ones.\" France \"will continue to fight terrorism with all its powers, alongside the United Kingdom and all affected countries\", he said. The presidential office described the London attack as a \"new abominable, cowardly attack on our free societies\". France has experienced several attacks in recent months, including a deadly shooting on the Champs-Elysees days before its presidential elections, and a machete attack outside the Louvre Museum. The lights on the Eiffel Tower in Paris will be turned off on Sunday night in a gesture of solidarity. US, European and Commonwealth leaders have also rallied around the UK. US President Donald Trump tweeted a message of support to the UK. He also sparked controversy after he called for his travel ban on visitors from six predominantly Muslim countries to be upheld by US courts, and criticised the mayor of London. German Chancellor Angela Merkel said in a statement (in German): \"Today we are united across borders in horror and mourning, but also in determination. \"For Germany, I reiterate that in the fight against all forms of terrorism, we are resolutely at Britain's side.\" Spain's foreign ministry said it shared \"the pain of the relatives of the victims deceased in these cowardly attacks\". European Commission President Jean-Claude Juncker said he was following the latest incidents \"with horror\". He said: \"Thoughts and prayers are with the victims and their families. Please stay safe.\" Russian President Vladimir Putin \"sends his deepest condolences to Britons and condemns the terrorist act that happened several hours ago in London\", his spokesman Dmitry Peskov said, quoted by Russian media. Later in a telegram to UK Prime Minister Theresa May, Mr Putin said joint efforts to fight terrorism \"should be a mutual response\", according to a Kremlin statement. In the Vatican, Pope Francis urged followers to \"pray for the victims and for their families\". Canadian Prime Minister Justin Trudeau said on Twitter: \"Awful news from London tonight. We're monitoring the situation.\" \"New Zealand's thoughts are with the victims of today's attack,\" said Prime Minister Bill English. \"Too many lives are being taken by terrorists set on inflicting pain and suffering on innocent people.\" At least one New Zealander was injured in the attack. On Saturday night, Mr Trump retweeted a line from right-wing website Drudge Report about the attacks. He followed it with a tweet calling for tough action: \"We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!\" Mr Trump's executive order has caused controversy and its legality is being challenged. The tweet provoked sharp rebukes on social media. \"Opportunist-in-Chief speaks,\" tweeted terrorism expert and Georgia State University Professor John Horgan. A few minutes after the first two tweets, Mr Trump sent his message of support for the UK, saying: \"Whatever the United States can do to help out in London and the UK, we will be there - WE ARE WITH YOU. GOD BLESS!\" On Sunday morning, Mr Trump tweeted \"we must stop being politically correct and get down to the business of security for our people\". He also criticised London mayor Sadiq Khan, writing: \"At least 7 dead and 48 wounded in terror attack and Mayor of London says there is \"no reason to be alarmed!\"' Critics said Mr Trump had taken Mr Khan's words out of context. Mr Khan had earlier said there would be more police on the streets of London, and told people not to be alarmed by that. The US state department issued a statement offering solidarity. \"The United States stands ready to provide any assistance authorities in the United Kingdom may request,\" it said.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nAFP Image copyright AFP Image caption The attack left seven people dead and 48 injured Media caption Image copyright\nGetty Images Image copyright Getty Images Image caption Some flags were flying at half mast on Sunday Image copyright\nTwitter/@AdamWagner1 Image copyright Twitter/@AdamWagner1 Image copyright\nTwitter/BerrgintonEmily Image copyright Twitter/BerrgintonEmily", "source": "www.bbc.com", "title": "London attack: Macron and Turnbull lead world condemnation"}