{"text": "The effects of the WannaCry attack are still being felt at NHS hospitals By\nJoão Medeiros On Friday 19 May, Shafi Ahmed, a surgeon at the Royal London hospital in East London, received a text message on his bleeper: “Major internal incident declared due to national IT failure. Currently on stroke and trauma divert no pathology services available including blood transfusion. Further updates will follow.” Ransomware Doctors and nurses at the Royal London were ordered to immediately turn off all computers. During the weekend, the Royal London, as well as other hospitals from the Barts Trust, had to divert patients to other hospitals. On Monday, computers were still unplugged. “We are heavily dependent on having patient records available electronically and accessing CT scans, MRI,” Ahmed recalls. “We went back to using paper to process patients. Some operations that relied on imaging were cancelled.” The Royal London was one of 40 NHS hospitals simultaneously hit by the WannaCry ransomware, which affected many IT networks across the world. On Monday, health secretary Jeremy Hunt, in an interview with BBC’s security correspondent Gordon Corera, claimed 80 per cent of the NHS was unaffected by the attack. By\nNicole Kobie “I worry about his way of looking at things,” says Sandeep Bansal, a former GP trainee and now CEO of healthcare startup Medic Creations.” Because he just admitted that 20 per cent of the hospitals were hit. Imagine if Virgin Airlines admitted that 20 per cent of their planes weren’t functional. It would be shock and horror.” Jack Kreindler, a physician and tech entrepreneur, agrees: ”It's dumbfounding. The UK is a world leader in information technology, software development and cybersecurity. Yet, it has flatly failed to mobilise its own local talent to generate the value it can from its medical information. It can't even protect this jewel in the crown, our most cherished piece of critical national infrastructure so blatantly exposed for so long. It is long overdue that the nation's health be protected, like the Bank of England, from the inadequacies of myopic individuals and short term objectives of politics.” To many in the NHS, WannaCry’s cyberattack highlighted what many doctors experience on a daily basis: an outdated, vulnerable and even dysfunctional IT network that affects their ability to do their job properly. “IT support throughout the NHS is cursory,” Ahmed says. “Sometimes it takes days or even weeks to get a response. Systems are often not upgraded. Many computers either don't work or are very slow. As a doctor, this makes work inefficient and consultations hard to conduct. Your goal is to spend half an hour with the patient talking about their condition, not spend most of the time looking around for things in the system and phoning IT for support.” By\nWIRED According to data obtained by software company Citrix, via a Freedom of Information request and published in December 2016, nine out of ten NHS trusts still have PCs running Windows XP, an operating system released in 2001 and succeeded in 2006 by Windows Vista. Microsoft stopped providing extended support for XP in April 2014 but continued to provide the NHS with updates and security patches under a one-year contract that cost £5.5 million. Subscribe to WIRED At the time, the Department of Health wrote to all NHS trusts stressing the urgent need for the hospitals to move away from Windows XP, and, a year later, the UK government did not renew the contract with Microsoft. “They knew the NHS relied on that outdated software,” Bansal says. “So in effect, a deliberate political decision was taken, at the highest level of the government to leave the NHS open to cyberattack.” Overhauling the IT system, according to Sandeep, wasn’t just a matter of updating operating systems. “Many of the Trusts were also using old applications that were built on XP, from electronic health record systems to CT scan machines,” Bansal continues. “If you take away XP, these systems just won’t work.  The Trusts were stuck between a rock and a hard place.” A category of legacy software systems that the NHS still heavily relies on are electronic health record systems. These are supplied by external software companies under lock-in contracts that typically amount to tens of millions of pounds. By\nStephen Armstrong One of the major providers is CERNER, a Kansas-based company that supplies software to many hospitals around the world, including the Royal London. “I was an early proponent of the system, Ahmed says. “I visited the CERNER headquarters in Kansas to see the implantation of the system worldwide. I am in favour of the electronic patient system and have been a champion for paperless working.” The electronic patient record system and the support provided by CERNER, however, has been less than impressive. “Their service could be much better as if you come back with ideas to implement a change, they provide little support,” Ahmed continues. “Simple things like changing the template of documents took me years. They also don’t offer adequate support in terms of security protocols.” Currently, the NHS pays hundreds of millions of pounds in contracts with external companies like CERNER. These expensive IT contracts were supposed to be rendered unnecessary by now, replaced by a national electronic patient record system that served the entire NHS. That was the ambition of an IT megaproject announced in 2002 by the Labour government. “The vision was great,” Bansal says. “It was going to be a database where everyone’s records would be on a single national database. So, if I was working in Milton Keynes and a patient from Cardiff came in, I could access her records.” WIRED Explains The system, however, was only implemented in three hospitals and, after a raft of complaints from clinicians, was aborted in 2013. “This is what happens when you've got people in Department of Health and Whitehall saying what a system should have without involving clinicians who are the end user,” Bansal says. “That in itself is a recipe for disaster.” If successful, it would have been the world’s largest civilian IT database. Instead, it left a £9.8 billion black hole in the public finances. “Medicine is about three things, the art of care, the science of information and the business of making those two things scale economically, consistently and equitably for the whole population,” Kreindler says. “The UK owns the most valuable information resource in the world: its medical data. What's worked and what's not in medicine for tens of millions of people for over 60 years, cradle to grave. That's more than 2 billion human years of insight. We should protect this like we guard the Queen and utilise its full potential, clinically and commercially like any industry giant would in the information world.\" Almost two weeks after WannaCry’s attack, its repercussions are still felt in the NHS. “Last Wednesday, one of our hospitals went back online and the hospital is working hard to restore functions area by area,” Ahmed says. He was only able to access his patient records on Friday, a week after the attack. “Not all systems are online. We are still affected.” By\nJoão Medeiros By João Medeiros By João Medeiros WannaCry ransomware: what is it and how to protect yourself A startup for NHS beds shows the dangers of following Silicon Valley By Nicole Kobie Friday briefing: Poor NHS cybersecurity blamed for impact of WannaCry ransomware By WIRED The NHS is going to trial a gig economy app for nurses By Stephen Armstrong What is ransomware and how can you avoid it?", "source": "www.wired.co.uk", "title": "WannaCry laid bare the NHS' outdated IT network – and it's still causing problems"}