{"text": "'People were absolutely devastated by yesterday's events' Firefighters trying to rescue residents trapped in the Grenfell Tower blaze were “in tears” and could face psychological issues in the future, the London Fire Commissioner has warned. Dany Cotton said the tough conditions and shocking scenes they faced, including a child being thrown from an upper storey window, had left many traumatised. London Fire Brigade said more than 200 firefighters and 40 fire engines attended the scene after the blaze ripped through the 24-storey block in west London, from the second floor upwards. Ms Cotton told Sky News: “They were in and out of that building, committing time after time to rescue the people we knew were in there. There was never any hesitation. Local residents watch as Grenfell Tower is engulfed by fire Getty Images London Fire Brigade said there has been a number of fatalities from the blaze Rex Features The fire was first reported in the early hours of Wednesday and continued into the morning Rex Features A local resident sees the fire over the rooftops @Ebajgora A firefighter reacts at the scene of the blaze Getty Images Residents watch as the blaze continues Getty Images More than 200 firefighters have been fighting the blaze PA London Mayor Sadiq Khan has declared the fire a major incident Getty Images Police and fire services attempted to evacuate the concrete block of flats Getty Images A woman runs to assist paramedics working at the fire at the Grenfell Tower Getty Images Smoke rises from the building after a huge fire engulfed the 24 story Grenfell Tower in Latimer Road, West London in the early hours of Wednesday morning Getty Images Fire fighters tackle the 24-storey building in West London Getty Images Ambulances are stationed nearby Getty Images Paramedics arrive with oxygen Getty Images Emergency services believe it will take some time to establish the cause of the fire Tens of people have been taken to five different hospitals across London Getty Images A man comforts a boy after the tower block was severely damaged Reuters Firefighters stand amid debris in a childrens playground nearby Reuters Firefighters are stationed at the building Getty Images Smoke engulfs Grenfell tower Rex Features Lots of people donating water, food and clothing to St Clement's church for the residents of Grenfell Tower in Latimer Road Samuel Osborne A man speaks to a fire fighter after a huge fire engulfed the 24 story Grenfell Tower in Latimer Road, West London Getty Images According to the London Fire Brigade (LFB), 40 fire engines and 200 firefighters are working to put out the blaze. Residents in the tower were evacuated and a number of people were treated for a range of injuries EPA A resident of Grenfell Tower is trapped as smoke billows from the window after a fire engulfed the building Getty Images Members of the emergency services work at the scene of a huge blaze which engulfed Grenfell Tower, a residential tower block in Latimer Road Getty Images According to the London Fire Brigade (LFB), 40 fire engines and 200 firefighters are working to put out the blaze EPA Fire fighters tackle the building after a huge fire engulfed the 24 story Grenfell Tower in Latimer Road, West London Getty Images The burnt facade of Grenfell Tower, the night after the fire in Latimer Road, West London REUTERS/Neil Hall Local residents gather at a community centre near Grenfell Tower in Latimer Road REUTERS/Toby Melville A resident in a nearby building watches smoke rise from Grenfell Tower in Latimer Road, West London AP Police and rescue services operate near the fire at Grenfell Tower, a 24-storey apartment block in Latimer Road EPA A man stands amid debris on the A40 after a serious fire in a tower block at Latimer Road in West London REUTERS/Toby Melville A view of the empty A40 highway after it was closed in both directions, due to the proximity of the fire at Grenfell Tower block in Latimer Road EPA Smoke rises from the building after a huge fire engulfed the 24 storey residential Grenfell Tower block in Latimer Road, West London Getty Images Bodies are removed from the scene after a fire engulfed the 24-storey Grenfell Tower in west London Rick Findler/PA Wire Bodies are removed from the scene after a fire engulfed the 24-storey Grenfell Tower in west London Rick Findler/PA Wire Provisions on tables at the Westway Sports Centre close to the scene after a fire engulfed the 24-storey Grenfell Tower in west London Jack Hardy/PA Beds are laid out in the Westway Sports Centre close to the scene after a fire engulfed the 24-storey Grenfell Tower in west London Jack Hardy/PA Wire A pile of donated clothes, sleeping bags and water lie next to a police cordon near the burning the 24 storey residential Grenfell Tower block in Latimer Road, West London Getty Images Signs asking for donations are seen outside the Notting Hill methodist Chruch Getty Images Smoke rises from the building after a huge fire engulfed the 24 storey residential Grenfell Tower block in Latimer Road, West London Getty Images A man is rescued by fire fighters after a huge fire engulfed the 24 storey residential Grenfell Tower block in Latimer Road, West London Getty “As the commissioner of the London Fire Brigade I was truly anxious for a long time about the safety of the building and my firefighters in there, but they were never going to stop until they physically could not get in there any more. “The thing that worries me going forward is the psychological effect. A lot of my firefighters yesterday experienced things they have never seen before. “I spoke to some people who were truly distressed – not least because they knew there were people still in there and they were battling through the heat to get there. “What happened yesterday truly traumatised a lot of people.” The firefighters “were in fear for their own lives” as they went into the building which was “alight from top to bottom”, according to Ms Cotton. She said the firefighters had been particularly affected by the desperation of one family who threw a baby from a window in a bid to save it. She said: “For my crews who were on the ground who witnessed it happening it was truly horrible and shocking. “I spoke to one of my officers who was very near when someone came out of the window, he was in tears. He is a professional fire officer. “We like to think of ourselves as roughty-tufty and as heroes but they have feelings. People were absolutely devastated by yesterday’s events.”  or register with your social account Already have an account? Log in News UK Home News Samuel Osborne    42 show all    1/42 2/42 3/42 4/42 5/42 6/42 7/42 8/42 9/42 10/42 11/42 12/42 13/42 14/42 15/42 16/42 17/42 18/42 19/42 20/42 21/42 22/42 23/42 24/42 25/42 26/42 27/42 28/42 29/42 30/42 31/42 32/42 33/42 34/42 35/42 36/42 37/42 38/42 39/42 40/42 41/42 42/42 Grenfell Getty Please enter an email address Email address is invalid Email cannot be used. Try another   ", "source": "www.independent.co.uk", "title": "London firefighters in tears at 'truly horrible and shocking' Grenfell Tower blaze, says Fire Commissioner"}