{"text": "9.45pm: Veteran former US politician and diplomat Bill Richardson has offered to visit North Korea to secure the release of three detained Americans and a Canadian. The former New Mexico governor and congressman previously visited North Korea in the 1990s to encourage the release of detained Americans. And today he announced he helped to do the same again, and had made the proposal in a letter to the North Korean mission to the United Nations. He argued in the letter it was in North Korea's interest to free the detainees unconditionally, \"in the light of its failure to properly take care and handle\" US student’s Otto Warmbier's case. 9.08pm: James Mattis also made clear that the US was nearing the end of its rope in dealing with North Korea, saying: \"We're exhausting all possible diplomatic efforts in this regard.\" North Korea recently taunted Trump by saying it was capable of hitting New York with a nuclear missile, but Mattis said a war today would hurt our Asian allies. He said: \"It would be a serious, a catastrophic war, especially for innocent people in some of our allied countries, to include Japan most likely.\" 8.01pm: US Secretary of Defense James Mattis has boldy claimed that America would win a war North Korea if tensions reached that point. \"I would suggest that we will win,\" Mr Mattis told a special committee. \"It will be a war more serious in terms of human suffering than anything we've seen since 1953. \"It will involve the massive shelling of an ally's capital, which is one of the most densely packed cities on earth,\" Mattis said of Seoul, a city with a population of 25 million. \"It would be a war that fundamentally we don't want,\" he added, but \"we would win at great cost.\" 6.03pm: North Korean coal has topped the charts of products that have links to slavery, according to analysis from Polecat. The US State Department's 2016 Trafficking in Persons report found that North Korea could have an estimated 80,000 to 120,000 prisoners woking in remote labour camps. These labourers, some of which include children, are subjected to forced labour, including mining. 5.23pm: North Korea has claimed that the US is trying to “suffocate” the country through economic sanctions. Pyongyang’s foreign ministry released a statement accusing the US of blocking imports of frozen chicken and other goods over its nuclear armament programme. The statement read: ’”Archery equipment would never become ballistic rockets and sports rifles could never be used to launch nuclear warheads, but some countries either being overpowered by or blindly following the high-handed practices of the hostile forces are bringing disgrace to the ideal and purpose of sports.” Sanctions against North Korea were agreed upon by the United Nations after the US led the discussions to punish the hermit state for its missile tests. 2.58pm: A small South Korean village is taking a stance against the US anti-missile THAAD defence system. A group of elderly women in the small farming village of Soseong-ri, are staging a protest to make sure no military vehicles enter through the only road to the THAAD deployment area. The women who have armed themselves with canes and umbrellas, have forced the US military to deliver supplies to a local golf field where the THAAD is deployed by helicopter. \"During the daytime, we used to farm and later go to the town hall and us grandmothers would spend time together,” 81-year-old Do Geum-ryeon too Reuters. “Now there's no day and night for us. I live at the town hall now.” 2.03pm: North Korea could be sitting on a multi-billion treasure-horde of natural minerals, experts predict. The hermit nation reportedly has vast untapped resources of iron, gold, magnesite, zinc, copper, limestone, molybdenum, graphite, and more. Estimates of the resources vary, but one South Korean research institute thinks the value could be close to £12 trillion ($10 trillion). 11.56am: Russian officials are looking into claims a yacht and its crew was “hijacked” by a North Korean ship. A distress VHF radio message from the Katalexa was sent out from the Sea of Japan, reporting it being “hijacked or arrested”, said Russian maritime expert Mikhail Voytenko. No further communications have been made by the ship since Wednesday. 11.53am: North Korea is being called on by the United Nations to explain why American student Otto Warmbier was returned home in a coma. \"While I welcome the news of Mr Warmbier's release, I am very concerned about his condition, and the authorities have to provide a clear explanation about what made him slip into a coma,\" said Tomas Ojea Quintana of the UN. 11am: US and Chinese defence chiefs are expected to gather for a discussion on curbing North Korea’s nuclear weapons programme. US Secretary of State Rex Tillerson, Secretary of Defense Jim Mattis and China's top diplomat, State Councilor Yang Jiechi, and General Fang Fenghui will meet in the White House. The State Department is aiming \"to expand areas of cooperation while narrowing differences on key diplomatic and security issues.\" Mr Tillerson also confirmed that North Korea will be at the top of Washington’s agenda. GETTY 10.45pm: The WannaCry ransomeware attack that affected computer networks in more than 150 countries across the world came from North Korea, British and US security officials believe. The attack, which locked data and demanded Bitcoin payment in return for its release, affected more than 60 NHS trusts and an estimated 300,000 people worldwide. Now an assessment by the US’s National Security Agency (NSA) said it had \"moderate confidence\" the attack pointed to North Korea's spy agency, the Reconnaissance General Bureau, according to the Washington Post. 8pm: At least seven people were killed and 66 were injured, when a deadly explosion tore through a city in eastern China. The explosion went off in front of a gate to the Chuangxin Kindergarten, according to Fengxian police. \"The police and related departments rushed to the scene as soon as it was reported and conducted rescue and investigation work on the site,\" police said on Weibo. \"Currently, the investigation work is still underway.\" 5.43pm: Fred Warmbier told a press conference that his son is now “in the arms of those who love him.” \"I knelt down by his side, and I hugged him, and I told him I missed him and I was so glad that he made it home,\" Fred Warmbier said. \"These things are tough to process, but he's with us, and we're trying to make him comfortable.\" Mr Warmer went on to say that he felt “anger that [Otto] was so brutally treated for so long”. 5.04pm: Otto Warmbier’s father has said that the news of his son’s condition has left him stunned. \"Disbelief. Couldn't sit down. I don't know what being in shock is, but I'm pretty sure I was,\" he said, referring to the family being informed that Otto Warmbier was in a coma. Fred Warmbier further said of his son's release: \"They did not do this out of the kindness of their hearts.\" 4.56: South Korea has reportedly finalised a multi-billion dollar deal with Iran to finance a credit line for Iranian industrial projects. The Persian newspaper Sharq has said that negotiations between the two countries were almost complete and that Finance Minister Ali Tayyebniya would travel to Seoul soon. Money from the deal would be used to finance projects previously approved by Tehran and Soul. 3.51pm: Otto Warmbier, is stable and receiving treatment at the University of Cincinnati Medical Center, Kelly Martin, a spokeswoman for the centre said at a press conference. The American student who was detained in North Korea and fell in a com during that time, has a severe has a \"severe\" neurological injury, the hospital has said. His father Fred, has said the he does not believe in the North Korean explanation of why his son is in a coma. According to North Korean officials, the young man contracted Botulism and fell into the coma after taking a sleeping pill. Pyongyang 2.56pm: North Korea has been linked to the Wannacry NHS cyber attack in May, according to the Washington Post. Wannacry victims included more than 60 HS trusts in the UK, as well Fedex, Renault and Telefonica in Spain. The Post claims the cyber worm was made by a hacker group \"sponsored\" by North Korea's spy agency – the Reconnaissance General Bureau. But the report concludes by saying that the findings were “not conclusive” and only strongly suggested North Korean involvement. 2.15pm: North Korea is threatening a “merciless strike” against the US, if America continues ti challenge Pyongyangs missile tests. The bold statement was issued by the Kim Jong-un’s mouthpiece propaganda editorial  Rodong Sinmun. The statement said: “If the US continues challenging the just cause of the DPRK [North Korea] in disregard of the strong might and will of North Korean people, it will never escape the merciless strike of the powerful revolutionary Paektusan army. “Various types of the DPRK's ballistic rockets were launched one after another to demonstrate all over the world that North Korea is fully ready for attack and defence.” 12.44pm: US Pacific Fleet Commander Admiral Scott Swift revealed today that median Navy ships are set dos pend more time in the South China Sea. The news comes as the USS Sterett guided-missile destroyer, is making a port call in Zhanjiang in Guangdong province. The USS Sterett is the first US warship to visit China since Donald Trump took office in January. AFP/GETTY 12.40pm: Otto Warmbier's parents, Fred and Cindy, are scheduled to reveal their son’s mistreatment to the press later today. Otto, 22, was \"brutalized and terrorized\" but he North Korean regime since his arrest in 2016. The Americans student is currently receiving treatment at the University of Cincinnati Medical Center, but details of his condition have not been yet released. Noon: North Korea has said it had had released Otto Warmbier on “humanitarian grounds” after holding him captive for 17 months. The North's KCNA news agency said in a dispatch that the decision to release the 22-year-old American student followed a court decision. \"Under a decision by the DPRK Central Court of June 13, American citizen Otto Warmbier who was serving a sentence of labour was returned on June 13 on humanitarian grounds,\" KCNA reported. The student’s release came after Joseph Yun, the U.S. State Department's special envoy on North Korea, travelled to Pyongyang to demand his release. Sebastian Kettley PUBLISHED: 00:00, Sat, Jun 17, 2017 00:24, Sat, Jun 17, 2017 Release of Otto Warmbier 'will not improve US-North Korean relations' North Korea declares its ‘invincible strength will WIN final victory GETTY North Korea will be the focus of discussions between US and Chinese defence officials on Wednesday Tue, June 13, 2017 1 10 AFP/GETTY Otto Warmbier was release from North Korea in a coma", "source": "www.express.co.uk", "title": "North Korea v USA LIVE: Donald Trump sends warships to China amid Kim Jong-un row"}