{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window The first victim of the fire at Grenfell Tower in London has been named by a charity as a Syrian refugee. Mohammed Alhajali, who was reported to be 23, came to the UK in 2014 and was studying civil engineering while living in North Kensington. Syria Solidarity Campaign said: \"[He] undertook a dangerous journey to flee war and death in Syria, only to meet it here in the UK, in his own home.\" At least 17 people died in the fire which started early on Wednesday. The charity said he had been in a flat on the 14th floor with his brother, Omar, and the pair had tried to escape, but lost each other on the way downstairs. Omar was rescued by firefighters, but Mohammed returned to his flat and tried to call family members back in Syria. \"Mohammed was on the phone for two hours with a friend in Syria, waiting to be rescued,\" said a statement from the charity. \"He was trying to reach his family... but he could not get connected to them due to the situation in Syria. He had not seen his family for four years. \"When the fire reached his flat... Mohammed bid his friend goodbye. He asked his friend to pass on the message to his family.\" Both Mohammed and Omar had been due to join the charity with another brother on Saturday as part of The Great Get Together - celebrating the life of murdered MP Jo Cox - and Refugee Week. Now the event will be used to pay tribute to Mohammed and the others who lost their lives in the fire. The charity called for a \"thorough investigation\" into building regulations, adding: \"Mohammed came to this country for safety and the UK failed to protect him.\" Mohammed's family told the BBC that Omar was being treated in King's College Hospital and was improving. They are trying to get UK visas for their parents so they can come from Damascus to see Mohammed's body.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Related Topics Media caption Image copyright\nPA Image copyright PA Image caption Emergency services believe that 17 people have died so far as a result of the fire", "source": "www.bbc.co.uk", "title": "London fire: First victim named as Mohammed Alhajali"}