{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window Two men have been sentenced to six months in prison in the first case of wildlife trafficking brought in Ivory Coast. An Ivorian government lawyer said the judgement \"sends a signal\" that animal trafficking is being taken seriously. The men were arrested while trying to sell an infant chimp to a BBC reporter posing as the representative of a wealthy Asian buyer. Chimpanzees are in such sharp decline they are listed as endangered. Those in West Africa are judged to be critically endangered. Since Ibrahima and Mohamed Traore have remained in prison since their detention last December, they are deemed to have already served their sentences and are therefore free. Infant chimpanzees are in huge demand as pets in homes and commercial zoos in the Gulf states and China. The dealers were arrested in a dramatic raid staged by Ivorian detectives working with international police organisation Interpol, acting on information shared by BBC News. During the operation, a baby chimpanzee later named Nemley junior was freed and taken into the care of wildlife officials. After becoming used to the keepers at the zoo in Abidjan  the baby chimpanzee showed signs of recovery. However he has since become unwell with wildlife experts raising concerns for his future. According to a local charity, although Nemley junior is feeding, he remains thin. One major concern is that he is too small to join older chimps at the zoo but becomes stressed if kept on his own. In the wild, baby chimpanzees usually stick close to their mothers for four to five years. A secret network of wildlife traffickers selling baby chimpanzees was exposed by a year-long BBC News investigation. Nemley junior was seized by poachers who would have killed his parents and other members of his family. During our investigation, Ibrahima Traore sent us videos of baby chimpanzees for sale, some were only a few months old. He boasted of his ability to evade international export controls. One technique, which he demonstrated in a video, was to hide a chimp in a secret compartment in a shipping case with other less rare animals, which can be legally exported, placed above it. Another smuggling method that he outlined to us was to obtain forged or fake copies of international export permits. These are issued under the Convention on International Trade in Endangered Species (Cites) and are only supposed to be used for legitimate transfers between registered institutions. During our investigation, Ibrahima sold us one of these permits, apparently issued by the National Parks department of Liberia. \"We are delighted that the first ever wildlife crime prosecution in Ivory Coast has resulted in a conviction, a custodial sentence and a fine,\" Cites secretary-general John Scanlon told the BBC. He also commended the authorities in the Ivory Coast for pursuing the prosecution of the criminals, thereby sending an important message to the community that wildlife trafficking was a criminal offence. Currently under Ivorian law, the maximum penalty for wildlife crime is one year in prison. A new law with tougher penalties is being prepared. The lawyer acting for the Ivory Coast government, Mohamed Lamine Faye, said: \"Even if we would have liked a harsher sentence, we can only function within the limits of our laws on the protection of endangered animals, which date back to 1965.\" He also pointed out that chimps  were kept as pets by thousands of Ivorians, and the national and international trade is lucrative. \"In court the Traorés admitted they could receive  $1,400 (£1,100) for a chimp. If they sell 10 in a year, that is more than enough to have a comfortable life,\" Mr Faye pointed out. Our changing attitudes to chimpanzees 'Staggering' extent of great ape trade Cheetah now 'running for its very survival' During our investigation, we reported on the lack of funding for Interpol to act against people trafficking chimpanzees - their main priority now is fighting the trade in ivory and rhino horn. Since our reports, which were picked up around the world, Interpol is now in addition focusing on chimp smuggling and recently brought together detectives and wildlife officials from half a dozen countries to share information and coordinate action. David Shukman Science editor  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel  Image caption This baby chimp, Nemley junior, was rescued in a police operation in Abidjan Media caption   Image caption Nemley Jr meets David Shukman", "source": "www.bbc.co.uk", "title": "Ivory Coast jail sentences for chimpanzee traffickers"}