{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window First Minister Nicola Sturgeon has signed a joint agreement with the governor of California committing them to work together on climate change. She met Jerry Brown for talks in Sacramento during a five-day visit to the United States. They discussed how the two administrations could work together to achieve the ambitions set out in the Under2 memorandum of understanding between subnational governments. This aims to cut CO2 emissions. Mr Brown has criticised President Trump for his executive order overturning many climate change policies introduced by President Obama. Ms Sturgeon and Mr Brown also discussed the importance of offshore wind in tackling climate change and considered how the two governments could share knowledge and best practice in developing this technology. The Scottish government committed to pressing ahead with plans to both set and deliver ambitious domestic measures to reduce carbon emissions and provide leadership and example in the spirit of the MoU and the historic Paris Agreement. Following the meeting, the first minister said: \"Scotland is making huge progress in delivering our climate change ambitions, but we are not complacent and there is still much to achieve. \"Today's meeting strengthened our relationship with the government of California and I'm confident we can work together to achieve the targets set out by the Under2 MoU. \"We have also offered to help the Under2 Coalition, representing over one billion people, to prepare for a major summit in 2018 which will bring together the public and private sectors, alongside NGOs, to build support and action aimed at persuading national governments to increase their efforts to tackle climate change, in what will be an important year for taking stock against progress of the Paris Agreement.\" WWF's US senior vice president of climate change and energy, Lou Leonard, said: \"It is good to see climate action high on the agenda of Scotland's first minister on her trip to the United States. This is a strong reminder that climate change is a priority for our allies around the world. \"Over the years, California and Scotland have inspired the world by setting bold targets and investing in a clean economy. Now both governments are looking to collectively up their game. To successfully address the climate challenge, it is essential that the leading players work together to do even more.\" On Tuesday Ms Sturgeon will be giving a speech at Stanford University on Scotland's place in the world. The Scottish Conservatives have questioned Ms Sturgeon's priorities, saying she should \"get back to the day job\".  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel  Image caption Jerry Brown and Nicola Sturgeon signed the agreement in Sacramento", "source": "www.bbc.co.uk", "title": "Sturgeon signs climate agreement with California"}