{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window Some of the biggest firms in the US have reacted with dismay to President Donald Trump's decision to pull out of the Paris climate deal. General Electric, Facebook, Goldman Sachs and Walt Disney were among corporate giants to condemn the move. Critics say the withdrawal, part of Mr Trump's \"America first\" policy, will hurt US companies' ability to work abroad and inhibit innovation. US coal firms welcomed the move, saying it would save jobs and ease regulation. The Dow Jones share index closed up 0.6% following the widely expected announcement. Before Mr Trump confirmed he would go ahead with his campaign pledge to withdraw, a slew of major companies issued statements urging him to remain in the deal. After the announcement, they expressed disappointment. \"Climate change is real,\" tweeted Jeff Immelt, chief executive of GE. \"Industry must now lead and not depend on government.\" Tesla boss Elon Musk confirmed he would quit two seats on White House advisory groups. He wrote on Twitter \"Am departing presidential councils. Climate change is real. Leaving Paris is not good for America or the world.\" Walt Disney chief executive Robert Iger said he too would quit an advisory role, while Goldman Sachs boss Lloyd Blankfein used his first ever tweet to condemn the move. Other big firms, including Morgan Stanley, PepsiCo and Walmart, and major tech firms such as Apple and Google, issued statements on Thursday with several reaffirming their own commitments to protect the environment. Apple boss Tim Cook told the Financial Times: \"I spoke with President Trump on Tuesday and tried to persuade him to keep the US in the agreement. But it wasn't enough. \"I want to reassure you that today's developments will have no impact on Apple's efforts to protect the environment.\" Under the deal, the US, which accounts for about 15% of global greenhouse gas emission, had committed to a 26% to 28% reduction from 2005 levels by 2025. The US also promised $3bn in aid to a United Nations fund to help poorer countries to tackle climate change problems. In his announcement on Thursday, Mr Trump said the deal, which involved voluntary commitments, put the US at a disadvantage. He said he would be willing to renegotiate under different terms. \"The rest of the world applauded when we signed the Paris Agreement -- they went wild; they were so happy -- for the simple reason that it put our country, the United States of America, which we all love, at a very, very big economic disadvantage,\" he said. \"They don't put America first,\" he said. \"I do, and I always will.\" Some energy firms, including Exxon Mobil and Chevron, had also pressed the administration to remain in the pact. But for the US coal lobby, the decision by Mr Trump to withdraw from the global Paris agreement on climate change was a win. Murray Energy, a coal mining company based in Ohio, applauded the move, describing it as an important part of the Trump administration's broader environmental agenda. \"In following through on his promise, President Trump is supporting America's uncompromising values, saving coal jobs, and promoting low-cost, reliable electricity for Americans and the rest of the World,\" chief executive Robert Murray said in a statement. Paul Bailey, the president of the coal lobbying organisation American Coalition for Clean Coal Electricity, said the standards established under the previous Obama administration were too stringent. \"We support President Trump's decision to withdraw from the Paris agreement,\" he said. \"Meeting President Obama's goal would have led to more regulations, higher energy prices, and dependence on less reliable energy sources.\" Oil stocks such as ExxonMobil and Chevron climbed on Thursday, as did the overall market. The broad S&P 500 share index and the technology index, the Nasdaq, closed at new highs, having already been climbing throughout in the day in anticipation of strong employment figures due out on Friday. Investors had been expecting President Trump's announcement and analysts said it had already been factored into prices. Peabody Energy, the US's largest publicly traded coal company, saw its shares slide 0.66% on Thursday. Peabody welcomed the decision to leave the Paris accord. \"We believe that abiding by the accord, without significant changes, would have substantially impacted the U.S. economy, increased electricity costs and required the power sector to rely on less diverse and more intermittent energy,\" the company said.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nGetty Images Image copyright Getty Images   Image copyright\nGetty Images Image copyright Getty Images Image caption The coal industry has welcomed the move", "source": "www.bbc.com", "title": "Paris climate deal: US firms criticise Trump move"}