{"text": "By\n\nMatthew Wright For Dailymail.com Published:\n  06:23, 4 June 2017\n\n | \nUpdated:\n  19:44, 4 June 2017 e-mail\n\n\n\n\n\n          var twitterVia = 'MailOnline';\n          DM.later('bundle', function(){\n            DM.has('shareLinkTop', 'shareLinks', {\n                    'id': '4570240',\n                    'title': 'CNN host Reza Aslan calls President Trump a \\'piece of s**t\\'',\n                    'url': 'http://www.dailymail.co.uk/news/article-4570240/CNN-host-Reza-Aslan-calls-President-Trump-piece-s-t.html',\n                    'eTwitterStatus': ' http://dailym.ai/2rEMFmh via @' + twitterVia,\n                    'articleChannelFollowButton': 'MailOnline',\n                    'isChannel': false,\n                    'hideEmail': true,\n                    'placement': 'top',\n                    'anchor': 'tl'});\n          });\n\n\n            \n\n\n\n4.1k\nshares\n\n \n         263\nView  comments\n\n\n        DM.later('bundle', function(){\n            DMS.Article.init('top');\n        }); 263 View  comments After US President Donald Trump took to Twitter to use the London terrorist attack to reinforce his call for a United States Muslim travel ban, a CNN host decided to speak out against him. Reza Aslan, host of CNN's Believer TV, called the president a 'piece of s**t' after Trump used the London tragedy where three Jihadi terrorists killed seven people and injuring 30 more during a horrific knife rampage in central London last night as a means to try to reinforce America. The tweet from President Trump that sparked the 45-year-old journalist to respond said: 'We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!' After US President Donald Trump took to Twitter to use the London terrorist attack to reinforce his call for a United States Muslim travel ban, CNN host Reza Aslan called the president a 'piece of s**t' The tweet from President Trump that sparked the 45-year-old journalist to respond said: 'We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!' 'This piece of s**t is not just an embarrassment to America and a stain on the presidency. He's an embarrassment to humankind,' tweeted Aslan with Trump's tweet referenced 'This piece of s**t is not just an embarrassment to America and a stain on the presidency. He's an embarrassment to humankind,' tweeted Aslan with Trump's tweet referenced. The reactions to the commentators tweet were more negative if anything with many upset that instead of focusing on the terrorist attack, that Aslan chose to focus on Trump. User @CarmineSabia pointed out the issue and said: 'The fact that you are more concerned about his words than terror attacks says a ton.' Many reactions to Aslan were negative. User @CarmineSabia pointed out the issue and said: 'The fact that you are more concerned about his words than terror attacks says a ton' It was a criticism cosigned by @B_Y_E who tweeted: 'Glad you're more worried about him than the murders in London and Kabul' Blogger @MarkDice pointed out Aslan's eating history out by simply stating: 'You ate human brains bro. Human brains. On CNN' It was a criticism cosigned by @B_Y_E who tweeted: 'Glad you're more worried about him than the murders in London and Kabul.' Aslan is most recognizable for having come under heavy scrutiny after he ate part of a human brain while filming a segment on a Hindu sect in India as part of his show. Blogger @MarkDice pointed that out by simply stating: 'You ate human brains bro. Human brains. On CNN.' Seven people have been killed and 20 injured when a white van drove into pedestrians on London Bridge before five jihadi terrorists launched into a frenzied stabbing attack on Saturday night. At least two suspects were gunned down and believed to have been killed by armed police. Another suspect is believed to have been shot and killed by police as the remaining two suspects are on the run. On Sunday morning EST, Trump again tweeted about the ban, saying 'We must stop being politically correct and get down to the business of security for our people' Seven people have been killed and 20 injured when a white van drove into pedestrians on London Bridge before five jihadi terrorists launched into a frenzied stabbing attack on Saturday night  Published:\n  06:23, 4 June 2017 Published: Updated:\n  19:44, 4 June 2017 Updated:  e-mail shares  'Another dark night for the UK - stay strong': Australian... British Transport Police officer responding to terror... 'You can hear them screaming': Senator Sam Dastyari... Share  e-mail Most watched News videos Most watched News videos Most watched News videos  CCTV footage of acid attack on Katie Piper in 2008 CCTV footage of acid attack on Katie Piper in 2008   Have a seat: Shelter pets love their donated chairs Have a seat: Shelter pets love their donated chairs   Martin Shkreli's lawyer speaks after Pharma Bro gets 7 years Martin Shkreli's lawyer speaks after Pharma Bro gets 7 years   Surveillance video of helicopter collision in Pasadena, California Surveillance video of helicopter collision in Pasadena, California   CCTV shows Russian spy and daughter with 'mysterious woman' CCTV shows Russian spy and daughter with 'mysterious woman'   Off duty cop harasses group kids and knocks woman to ground Off duty cop harasses group kids and knocks woman to ground   Police say veterans home gunman killed all 3 hostages and himself Police say veterans home gunman killed all 3 hostages and himself   Princess runs away from Dubai to escape her controlling father Princess runs away from Dubai to escape her controlling father   Shocking footage shows grandmother being killed in hit-and-run Shocking footage shows grandmother being killed in hit-and-run   Bikini-wearing drunk driver struggles through sobriety test Bikini-wearing drunk driver struggles through sobriety test   Footage of drunken man being escorted off Ryanair flight Footage of drunken man being escorted off Ryanair flight   Audi driver causes traffic incident with risky manoeuvre Audi driver causes traffic incident with risky manoeuvre  Married RE teacher, 46, faces being struck off for... EXCLUSIVE: 'God protect me!': Katie Piper shares cryptic... Is where you live an Alabama Rot hotspot? Interactive map... Devastated couple have their £15,000 wedding cancelled... Australia, Poland and Japan could join England in... New York Giants star Odell Beckham Jr is caught on video... Stormy Daniels takes a spin around the pole in Florida... Moment 'drunk' Ryanair passenger, 45, who forced a... Ex-serviceman had been thrown off veterans' home PTSD... 'Tempers occasionally get frayed': Stranger Things... Scott Baio's stuntwoman wife, 45, reveals she has been... Girlfriend slashes open her lover's throat with a Stanley... Traces of nerve agent are found in Zizzi restaurant where... Florida teacher 'attacks mother and repeatedly punches... Heart-stopping moment a police officer walked away... Father-of-two, 33, is hit by hundreds of pounds of fines... 'He's a TRAITOR!': Anna Chapman launches Instagram rant... Beware of Disease X: World Health Organisation scientists...", "source": "www.dailymail.co.uk", "title": "'Piece of s***': President Trump comes under fire over tweets about reinforcing the travel just hours after London terror attack"}