{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window At least eight people have been killed and dozens injured in an explosion at a nursery in China. State news agency Xinhua said the blast took place just outside the kindergarten in the town of Xuzhou in Jiangsu province on Thursday afternoon. No children or teachers were among the casualties, it said. The cause of the blast is not clear but media reports say the police are treating the explosion as a criminal offence and have identified a suspect. The explosion happened at about 17:00 (09:00 GMT). Two people were killed immediately and six others died from their injuries, Xinhua reported. According to the news agency, 65 people have been injured, with several in a serious condition. Unverified images circulating on social media showed adults and children lying on the ground. Video footage of injured people shared online had initially been thought to have been of the blast, but according to Xinhua, police say the footage is from an unrelated incident earlier this year. The Xuzhou blast is the second tragedy to strike a Chinese kindergarten in recent weeks. Last month, 11 children died when a bus packed with kindergarten pupils burst into flames inside a tunnel in eastern Shandong province. It later emerged that the fire had been started deliberately by the driver, who also died.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nReuters/CCTV Image copyright Reuters/CCTV Image caption Chinese TV showed a large crowd gathered outside the nursery", "source": "www.bbc.co.uk", "title": "China nursery blast: Eight dead in Jiangsu explosion"}