{"text": "Jack\n  Taylor / Getty LONDON â\u0080\u0094 Jeremy CorbynÂ is now much more popular with the\n  British people than Theresa May, according to new YouGov\n  research. In what is simply a remarkable turnaround for Corbyn, the Labour\n  leader has a net approval rating of 0%, with 46% of people\n  viewing his leadership favourably and the same percentage viewing\n  it unfavourably, YouGov says. To put these numbers into context: Corbyn's net approval rating\n  plummeted to -42% in April soon after Prime Minister May called\n  an early general election, according to YouGov research. That was\n  less than two months ago.Â Meanwhile, May's downward spiral is showing no signs of coming to\n  an end anytime soon. The Conservative Party leader has a net\n  approval rating of -35%, having been rated +10% by Brits in April\n  after she announced theÂ election.Â The prime minister is now about as unpopular with the public as\n  Corbyn was shortly before Christmas. As this chart illustrates, the prime minister's public support\n  pretty much collapsed from the end of May, shortly afterÂ the\n  Tories published their much-criticised manifesto. Corbyn's\n  ratings began to climb immediately after May called for an early\n  election on April 18. May is currently much less popular than her\n  own Conservative Party.Â YouGov May's favourability among people who voted Tory in 2015 decreased\n  significantly as the campaign progressed. The PM was viewed favourably by 85% of 2015 Conservative voters\n  in mid-April, but this crashed to 57% by June. Corbyn, on the\n  other hand, has seemingly won over 2015 Labour voters who were\n  initially unsure or even angry about his leadership. The Labour\n  leader's favourability went from 40% to 75% among 2015 Labour\n  voters over the sameÂ period of time. Interestingly, the\n  number of 2015 Lib Dem voters who view Corbyn favourably rose\n  from 15% to 69%. This will likely have contributed to Labour's\n  surprisingly good performance at last week's election.Â These new figures will only pile more pressure on May, whose\n  personal credibility is an all-time low following her failure to\n  retain her parliamentary majority in a general election she\n  didn't have to hold. Tory MPs like Anna Soubry and Nicky Morgan\n  suggested over the weekend that May will cease to be prime\n  minister by the end of the summer. LONDON — Jeremy Corbyn is now much...  Jun. 15, 2017,  3:21 PM  2,995 facebook linkedin twitter email print Jack\n  Taylor / Getty Jack\n  Taylor / Getty YouGov YouGov DON'T MISS: YouGov facebook linkedin twitter email print Ã\u0097 Powered by Sailthru Powered by Sailthru", "source": "uk.businessinsider.com", "title": "Jeremy Corbyn's popularity hits an all-time high while the public turns on Theresa May"}