{"text": "LONG BEACH – Duncan Lynde had a home-pool advantage on Wednesday night when the U.S. men's senior national water polo team played against Croatia at Long Beach State. Lynde will play his senior season with the 49ers in the fall, and the former Laguna Beach High star enjoyed playing at his home pool. But there was another advantage besides just familiarity that he had in the contest, and it had to do with his height. \"It's so great playing in my home pool,\" Lynde said with a grin. \"A big factor of that is that [the water] is 6 1/2 feet deep here. I'm 6-foot-7, so I do have a home-court advantage whenever I'm playing here. It helps, for sure.\" Lynde was one of three players with local ties who helped Team USA earn a 7-5 win over the Croatians in front of a sellout crowd, and it was a big one after the Americans lost the first three games of the four-game series against Croatia. Lynde drew three exclusions in the first half for Team USA. Former Laguna Beach High star Nolan McConnell, who played his senior season for Long Beach State last fall, had two assists and a steal, while former Huntington Beach High goalie Alex Wolf (UCLA) split time in goal and made six saves in the second half. The win brought some semblance of momentum for the young Team USA squad, which leaves for the FINA World League Super Final in Russia on Friday. The U.S. roster for that tournament has yet to be announced. McConnell, who helped Laguna Beach High earn back-to-back CIF Southern Section Division 3 titles in 2010 and 2011, is in his second tour of duty for Team USA after also playing from 2013-15. But he was cut, then the lefty had to have Tommy John surgery on his left elbow before finishing up at Long Beach State last fall. \"It feels great,\" McConnell said of playing back at Long Beach State. \"We've been training here for the past six or seven weeks, and it's nice to be at the old stomping grounds. The Cal State Long Beach guys are in there training with us, so I'm there with all my boys. I think it's great for our program, as an alumni of Long Beach, and I think it's great for [49ers coach] Gavin [Arroyo] … hopefully it brings standout players to Long Beach. I love coming back here. There's nothing better.\" Team USA put together a complete effort against Croatia, which was the silver medalist last year in Rio. The game was always close, but Croatia never led. Thomas Dunstan paced Team USA with three goals. Croatia provided some motivation after it won Tuesday night's game at Oaks Christian School, McConnell said. \"Before [Wednesday's] game coach [Dejan Udovicic] was telling us he saw a couple of Croatian guys doing the broom motion, the sweep motion,\" McConnell said. \"That kind of fired us up before the game, got us a little bit more hungry. Getting that last win here at Long Beach, it's a great feeling, for sure. Hopefully that brings some momentum into Russia for the guys who are traveling there. We'll just keep building.\" Wolf played the second half in goal after Drew Holland made four saves in the first half. In between the third and fourth quarters, some kids from Huntington Beach Water Polo Club who were watching the game started chanting Wolf's name. Ante Vukicevic led Croatia with two goals and two assists. Franko Lazic's goal brought Croatia within 6-5 with 2:25 remaining in the fourth quarter. But, following a USA timeout, Dunstan scored his third goal assisted by Alex Obert to provide a 7-5 lead and separation. Wolf made his last save in the final minute to help ice the game. Team USA opens play in Russia at the FINA World League Super Final on Tuesday, against Italy. matthew.szabo@latimes.com Twitter: @mjszabo By Matt Szabo Matt Szabo  Jun 14, 2017 | 10:30 PM   Advertisement    (function(){function loadAd(){window.serviceCallbacks.push(function(){if(window.services.dfpService&&window.googletag&&googletag.pubadsReady)window.services.dfpService.appendAd({id:\"socal_dailypilot_sports_401\",adType:\"cube\",slotName:\"/4011/trb.latimes/socal/dailypilot/sports\",displayMobile:true,displayDesktop:false,isOOP:false,is5x1:false,dimensionsString:\"[[300, 250]]\",sizemapString:\"\",sizemapRefresh:\"false\",refreshOnPhotoChange:false,includeInA9:false,includeInIndexExchange:false,options:{ptype:\"s\",\niab:\"\",apv:\"false\",site:\"trb.latimes\",slug:\"tn-dpt-sp-usa-mens-water-polo-20170614\",cid:\"93676326\",at:\"WaterPolo\",kw:\"Beach,Croatia,Lynde,Wolf,goal,croatia,McConnell,half,teamusa,Long,game,Team,USA,TeamUSA,State,guy,49ers,Dunstan,lynde,fall,High,Russia,Croatians,mcconnell,gavin\",tg:\"Basketball,NationalSports\",design:\"arc\",nopulse:true}},false,true);else setTimeout(loadAd,500)})}loadAd()})(); ", "source": "www.latimes.com", "title": "Laguna Beach grads and Wolf help Team USA top Croatia"}