{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window A China Eastern Airlines plane has had to turn back to Sydney airport after a technical failure which left a hole in an engine casing. Flight MU736 was heading from Sydney, Australia to Shanghai, but the pilot reported problems with the engine about one hour after taking off. Passengers, who had to spend the night in Sydney, told media they smelt something burning inside the aircraft. The Airbus A330 landed safely and there were no reports of injuries. Images circulating on social media showed a large hole in the engine casing. Several passengers said they had heard a loud sound coming from the left engine shortly after take-off. One passenger told Australia's Seven News network: \"All of a sudden we heard this noise... it kind of smelt like burning\". \"I was really scared. Our group was terrified.\" One woman on the flight told news agency Reuters: \"The cabin crew went out and told us to fasten our seatbelts and tried to calm us down, but we were actually very panicked because we had no idea what was happening.\" Passengers said the crew cleared the seats near the affected engine. China Eastern Airlines said in a statement to the media that the crew had \"observed the abnormal situation of the left engine and decided to return to Sydney airport immediately\". It added that all passengers would be placed on flights leaving on Monday. Aviation safety authorities are now investigating. Aviation expert Greg Waldron of consulting firm FlightGlobal told the BBC that it would be \"difficult to say at this early juncture what caused such extensive damage\" to the China Eastern plane. He said investigators would likely look at all possible factors and examine maintenance records of the aircraft and engine. \"They will also carefully assess whether a foreign object may have played a role in this,\" he said. Last month, industry websites The Aviation Herald and Aero.de published pictures from social media appearing to show a similar hole in another aeroplane's engine casing. Mr Waldron added it would be \"too early\" to say whether the Sydney incident was linked to other cases, but it would be something investigators would consider.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nEPA Image copyright EPA Image caption The hole in the engine casing of the Airbus A330 was discovered shortly after take-off Media caption Image copyright\nReuters Image copyright Reuters Image caption The plane landed safely with no reports of injuries", "source": "www.bbc.co.uk", "title": "China Eastern plane lands at Sydney with hole in engine"}