{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window Labour leader Jeremy Corbyn has accused the Conservatives of trying to \"protect the public on the cheap\" in a speech focusing on the London terror attack. Mr Corbyn, who has previously questioned the wisdom of a shoot-to-kill policy, also backed the police to use \"whatever force is necessary\" to save lives. His comments mark the end of a pause in Labour's campaigning after the attack. The Tories accused him of \"desperate promises and evasive soundbites\". \"This was a hastily-arranged speech designed to help Jeremy Corbyn run from his record on counter-terrorism policy, but it failed,\" Security Minister Ben Wallace said, saying the Labour leader had opposed previous counter-terror laws. Most parties suspended their national campaigns following the attack on Saturday night. Mr Corbyn restarted Labour's in a speech in Carlisle, in which he attacked the Conservatives' record in government and called for action to tackle extremism. He pledged \"whatever action is necessary and effective\" to protect people. \"That includes full authority for the police to use whatever force is necessary to protect and save life as they did last night, as they did in Westminster in March,\" he said. \"You cannot protect the public on the cheap. The police and security services must get the resources they need, not 20,000 police cuts. \"Theresa May was warned by the Police Federation but she accused them of \"crying wolf\".\" The Labour leader accused US President Donald Trump of lacking \"grace\" and \"sense\" after he criticised London Mayor Sadiq Khan's response to the attack. Mr Corbyn also called for \"some difficult conversations\" with Saudi Arabia and other Gulf states, saying they have \"funded and fuelled extremist ideology\". He accused the government of \"suppressing\" a report into the foreign funding of extremist groups. \"We have to get serious about cutting off the funding to these terror networks, including Isis here and in the Middle East,\" Mr Corbyn said. On the election, he said there was \"no doubt\" that Thursday's vote must go ahead. For the second time in as many weeks, the prime minister had to respond to a terror attack that had killed innocent people, struck down while enjoying themselves. But Theresa May's address this morning was without question a much higher voltage performance, with a bold claim, \"enough is enough\", and a closing promise to take on our \"enemies\". It may not have been officially a campaigning speech, but it was intensely political. Events of the past 24 hours have changed the backdrop of the closing stages of this election campaign, and will shape the tenor of the last few days, the statements by politicians, and the questions asked of them. What did, however, Theresa May actually mean? Was her pointed speech any more than campaign rhetoric? It is clear that prime minister wants to pursue new policies to address the terror threat if re-elected. Read more from Laura Earlier Mrs May confirmed the general election would take place as planned on 8 June and said full campaigning would resume on Monday. In a speech outside 10 Downing Street, Mrs May also said the UK's counter-terrorism strategy would be reviewed, and the UK would work with other countries to prevent the internet being a \"safe space\" for terrorists. She also said there was \"too much tolerance of extremism in our country\" and - while it would involve \"some difficult and embarrassing conversations\" - that must change.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Media caption Media caption", "source": "www.bbc.co.uk", "title": "London attack: Corbyn criticises Tories in terror speech"}