{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window Formal Brexit negotiations will begin on Monday, the UK and EU say. The announcement by Brexit Secretary David Davis and EU negotiator Michel Barnier follows preliminary talks in Brussels between officials. The formal negotiations were already due to start on Monday but doubt was cast by the general election result and ongoing talks between the Conservatives and the Democratic Unionists. The Queen's Speech was delayed and will now take place on Wednesday. The UK is due to leave the EU by the end of March 2019. Prime Minister Theresa May invoked Article 50 of the Lisbon Treaty, which started the clock on Brexit, in March. Mrs May had hoped the general election would increase her Commons majority before the start of talks - but it created a hung Parliament, and she is seeking the DUP's backing to win key votes. Key subjects to be negotiated include the status of EU nationals and Britons living elsewhere in the EU, the size of any \"divorce\" bill and how the UK will trade with the EU once it leaves. Since last week's general election, there have been calls for a new cross-party approach to talks, but Downing Street has said its strategy will not change. EU leaders have been calling for talks to begin - on Tuesday Mr Barnier said: \"I can't negotiate with myself.\"  comments  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Related Topics Image copyright\nReuters Image copyright Reuters Image caption EU chief negotiator Michel Barnier (left) and UK Brexit Secretary David Davis confirmed the start of talks", "source": "www.bbc.co.uk", "title": "Brexit: UK and EU negotiations to start on Monday"}