{"text": "'Mr Macron spoke about an open door. I agree,” Mr Verhofstadt said. 'But like Alice in Wonderland not all the doors are the same. It will be a brand new door' If Britain changes track and decides to remain a member of the European Union it could lose perks such as budget rebates and opt-outs, according to the European Parliament’s Brexit coordinator. His comments come after Emmanuel Macron, the new French President, said alongside Theresa May at the Elysee Palace that the “door remains open” if the UK ditches its Brexit plans. But speaking in Strasbourg, Guy Verhofstadt, the former Belgian Prime Minister, who is now responsible coordinating the EU parliament’s Brexit stance, suggested there would be a price to pay should Britain wish to remain in the bloc. “Emanuel Macron, the new French President, spoke about an open door. I agree,” Mr Verhofstadt said. “But like Alice in Wonderland not all the doors are the same. It will be a brand new door, with a new Europe, a Europe without rebates, without complexity, with real powers and with unity. That is the door towards Europe.” The leader of the liberal group in the parliament, Mr Verhofstadt, has long been critical of Britain’s annual rebate from the European Union – worth around £5bn a year to the UK – that were secured by the former premier Margaret Thatcher in 1984. The UK also enjoys certain opt-outs with its current membership of the bloc, including from ever joining the euro currency. Asked about Mr Verhofstadt's comments, European Commission spokesman Alexander Winterstein played down suggestions of a change in the UK's status, telling reporters: “The UK is a member of the European Union and will remain so until it leaves, so that is where we are. “I'm not going to comment on statements by others. “The only thing I know is that there is an Article 50 request and we have been preparing ourselves for a long time to start negotiations on that basis.” During a joint news conference with Ms May earlier this week, Mr Macron said “of course the door remains open” adding: “Always open until the Brexit negotiations come to and end”. But, he continued: “That being said, a sovereign decision was taken by the British people and that is to come out of the European Union and I very much respect the decisions taken by the people, be it by the French people or the British people. “As a matter of fact in this case it's not for me to say whether or not this decision should be questioned - the decision to leave the European Union - but until the negotiations come to an end, of course there is always the possibility to reopen the door. But let us be clear and organised and once the negotiations have started we should be well aware that it'll be more difficult to move backwards.” or register with your social account Already have an account? Log in News UK UK Politics Ashley Cowburn Getty Please enter an email address Email address is invalid Email cannot be used. Try another   ", "source": "www.independent.co.uk", "title": "Brexit: UK could remain in the EU but on worse terms, says Guy Verhofstadt"}