{"text": "The super-fight between the undefeated boxer and the two-weight UFC champion has a date. Here, we provide a full lowdown on the contest The undefeated boxer Floyd Mayweather and two-weight UFC world champion Conor McGregor have agreed to a boxing match on August 26 in Las Vegas. The fight is expected to become the highest grossing event in the history of either sport. The fight was confirmed on Wednesday evening, with McGregor tweeting “THE FIGHT IS ON,” moments before Mayweather posted a short promotional video to his Instagram page, along with the caption “It’s official”. Mayweather was immediately made the overwhelming favourite to win the fight by bookmakers across the world. He boasts a flawless professional record of 49-0, while McGregor has never previously been involved in a boxing match. Negotiations for the fight have lasted longer than a year, with each man demanding upwards of $100m and insisting that they were the main draw. The exact financial details of the fight have not been disclosed, but in a media call both parties insisted they were satisfied with how the negotiations had proceeded. Just how did an appearance on late-night show Conan and a rumbling Twitter feud turn into the biggest fight the sport of boxing has ever known.\r\n\r\nHere, we tell the story of how the trash-talk turned into a super-fight. Getty Images “If you’re asking would I like to fight Floyd Mayweather, I mean, who would not like to dance around the ring for $180m?” McGregor replied to a playful question from late-night host Conan O’Brien, in July 2015, on whether he would ever be tempted into switching sports. \r\n\r\n“I would certainly box him if the opportunity arose,” he smiled. \r\n\r\n“Most certainly.” Mayweather then rekindled the speculation, that December. In an interview with FightHype on the worldwide adulation McGregor had received for knocking out Aldo in just 13 seconds, the American complained that he would never receive such acclaim from the public because of the colour of his skin.\r\n\r\n“They say he talk a lot of trash and people praise him for it, but when I did it, they say I’m cocky and arrogant,” Mayweather observed. \r\n\r\n“So biased! Like I said before, all I'm saying is this, I ain't racist at all, but I'm telling you racism still exists.” Getty Images This time, it didn’t take the other man the best part of half a year to respond. “Don’t ever bring my race into my success again,” McGregor commented in a long Instagram post, the very next day. \r\n\r\n“I am an Irishman. My people have been oppressed our entire existence. And still very much are. I understand the feeling of prejudice. It is a feeling that is deep in my blood … If you want we can organise a fight no problem. I will give you a fair 80/20 split purse in my favour seen as your last fight bombed at every area of revenue.”\r\n\r\nA feud was born. As interest in a fight with Mayweather began to increase, McGregor threatened to retire not just from MMA, but from sport altogether.\r\n\r\nUFC president Dana White announced that the promotion has pulled McGregor from the main event at UFC 200, because of his refusal to participate in mandatory media duties. McGregor's response?\r\n\r\n\"I have decided to retire young. Thanks for the cheese. Catch ya's later.\" Things came to a boil in May 2016. British tabloid The Sun reported that the two men were “on the verge” of agreeing to a deal, with an unnamed source telling the paper that “Floyd is obsessed with making Conor eat his words”.\r\n\r\nThe story attracted so much attention that Dana White, the president of the UFC, felt compelled to finally address the situation. He laughed off suggestions the super-fight would ever take place, instead pointing out that McGregor was contracted to the UFC, and would thus be in breach of contract should he attempt to organise a fight himself away from the confines of the Octagon. AFP/Getty Images White's comments appeared to spur both men into action. First McGregor tweeted a mocked up fight poster with the caption 'MMA vs Boxing'... Getty Images ... before Mayweather responded with an effort of his own (it wasn't quite as good).\r\n\r\nMayweather insisted began to insist a fight was “possible”. Then he told a journalist that he was a retired man and would only countenance returning to professional sport in order to fight McGregor. And then he pressed the nuclear button, offering the Irishman just $50m to fight him in what people were already describing as a billion-dollar bout. Getty Images Hold the hype. Just as things were beginning to heat up, Mayweather’s promotions head, Leonard Ellerbe, poured cold water on the prospective fight, insisting it was “a calculated effort by McGregor to gain more fans”. Getty Images In an attempt to get discussions back on track, McGregor got personal.\r\n\r\n\"Call me CJ Watson!\" he tweet, with a cartoon of him standing triumphantly above a knocked out Mayweather.\r\n\r\nThe caption was explosive: Mayweather was sent to prison in 2010 for the assault of his then-girlfriend. He was reportedly angry about text messages she had received from NBA star CJ Watson. Getty Images At this point in the saga the president of the UFC, Dana White, reenters the fray.\r\n\r\nHaving previously insisted that the fight was a non-starter, he suddenly proposed a deal: $25m for each fighter, with the complicated PPV splits to be patiently worked out at a later date.\r\n\r\n\"He's a f***ing comedian,\" Mayweather replied. Getty Images ... McGregor arrived in Las Vegas, to much excitement.\r\n\r\nMayweather tweeted the following. Getty Images McGregor's response to Mayweather's short statement was brutal and to the point.\r\n\r\n\"I am in Las Vegas. Floyd has retired on my arrival,\" he observed. Without Conan O'Brien the biggest fight in the history of boxing would still be a daydream.\r\n\r\nIn March he invited Dana White onto his show, who said the following.\r\n\r\n“I do think it’s gonna happen. I think it’s going to be a tough deal because obviously [there are] a lot of egos involved in this deal and a lot of people, so that always makes it tougher. \r\n\r\n\"On the flip side, there’s so much money involved. I just don’t see how it doesn’t happen.” McGrgor was in New York to support Belfast boxer Michael Conlan in his professional debut against Tim Ibarra in March.\r\n\r\nBut the spotlight quickly sought him out. He reminded everyone that an announcement was imminent by shouting furiously into the face of ESPN boxing reporter Dan Rafael: \"I AM BOXING!\" Getty Images On March 22, an outstanding fine McGregor had with the Nevada Athletic Commission was downgraded, paving the way for the Irishman to obtain his necessary boxing license. Getty Images On Wednesday 14 June, the fight was finally confirmed by both men. \r\n\r\n“THE FIGHT IS ON,” McGregor posted on Twitter, along with a mocking picture of himself side-by-side with Floyd Mayweather Snr. “It’s official!\" replied Mayweather on Instagram, along with a short promotional video confirming the involvement of Showtime. Getty Images “Everybody is happy,” Leonard Ellerbe, the CEO of Mayweather Promotions, said. “Nobody is bummed out about this deal,” said Dana White, the president of the UFC. He later described the contest as “the biggest fight ever.” White went on to reveal a number of details about the potentially record-breaking fight, including that the 12-round contest would be held at the T-Mobile Arena in Las Vegas, with both men weighing in at 154 pounds. Mayweather Promotions, rather than the UFC, will publicize the event, which will be available on Showtime pay-per-view in the United States. The PPV price is expected to cost in excess of $100. “We're not only drawing from the universe of boxing fans and the universe of MMA fans, we've actually tapped into the audience that doesn't follow either sport,” Showtime Sports executive vice president Stephen Espinoza said. “This is an unprecedented event.” McGregor will be looking to pull off one of the greatest upsets in the history of sport when he takes on Mayweather in his first professional boxing match. Although the Irishman is a two-weight world champion in the sport of mixed martial arts, he has not boxed competitively since the age of 16, when he was an All-Ireland champion at youth level. In contrast, Mayweather is widely regarded as one of the best defensive boxers to have ever lived. He has been knocked to the canvas just once in his 21-year professional career – in a fight he would come back to win via a unanimous decision – and possesses the highest average punch connect rate of any active fighter, according to the respected computerized scoring system CompuBox. Should he defeat McGregor, he will move ahead of former heavyweight great Rocky Marciano, who also retired with a perfect 49-0 career record. Here, we preview every element of the contest dubbed 'the billion-dollar fight'. Mayweather Promotions have reportedly reserved the T-Mobile Arena for the superfight. The Los Angeles Times' Lance Pugmire had initially reported the Nevada Athletic Commission granted a request from Mayweather Promotions to schedule the fight for August 26 at the nearby MGM Grand. But UFC President Dana White confirmed on Wednesday that the fight would be held at the marginally larger T-Mobile Arena. The fight will take place on August 26 at 9pm. September 16 had initially been suggested as the most likely date for the superfight but that slot has now been taken by Canelo Alvarez's middleweight world championship fight against Gennady Golovkin. McGregor confirmed his side of the deal in a statement released to Themaclife.com. “The first and most important part of this historic contract has now officially been signed off on. Congratulations to all parties involved. We now await Al Haymon and his boxer's signature in the coming days,” the statement read. Mayweather appeared to agree to his side of the fight on Wednesday 14 June, the day the fight was announced. A number of legal complexities had to be patiently worked out before the superfight was announced. Earlier this year, Jake Cohen, a lawyer for Mills & Reeve specialising in legal, commercial and regulatory matters in sport, spoke to the Independent about some of the legal issues standing in the way of any potential fight, and how these might possibly be resolved. A co-promotion between Mayweather Promotions and the UFC was identified as the most likely course of action for both parties. “Should the UFC enter negotiations we could potentially see something that we often see with boxing, which would be a cross-promotion, in this instance between the UFC and Mayweather Promotions (MP),” Cohen told the Independent, who explains that MP – the boxing promotional firm Floyd founded in 2007 – has a precedent for this strategy. MP and Golden Boy co-promoted nine of Mayweather’s fights after his 2007 victory over Oscar de la Hoya, while his famed 2015 victory over Pacquiao was co-promoted with Top Rank. “Co-promotion is a common occurrence in boxing and is often the reason for why there is such a long waiting time before these huge fights, because working out the revenue share between these promotions can take some time.” There was much excitement at the beginning of February when, in an hour-long interview with respected MMA journalist Ariel Helwani, McGregor announced the creation of McGregor Promotions – his own promotional company. “Everyone’s got to know their place,” McGregor told Helwani. “There’s Mayweather Promotions, there’s the UFC and now there’s the newly formed McGregor Promotions. And we’re all in the mix.” But despite McGregor’s positioning of his new venture as a third promotional body, Jake Cohen told the Independent that he is sceptical over the influence it will have over any negotiations. “If McGregor’s contract is similar to other UFC contracts, it is likely that McGregor will have licensed his image rights – which permit the UFC to exploit the athlete’s image, his voice, his signature and even his tattoos for commercial purposes – to the UFC for the purposes of marketing McGregor as a fighter. “If that is the case, then McGregor Promotions may not be able to exploit those rights beyond traditional individual endorsement and sponsorship deals until the expiration of McGregor’s contract with the UFC. Once his UFC contract expires, McGregor, or more likely McGregor’s image rights company, will be free to license these rights to McGregor Promotions. “So, establishing McGregor Promotions now could simply be a forward-thinking move to set himself up for the future.” UFC president Dana White has confirmed that it will be contested under boxing rules. “It’s going to be straight up boxing,” he said when asked if the fight could be contested under hybrid rules. Mayweather boasts one of the finest records in the history of boxing. After 49 professional fights he has 49 victories, including 26 by knockout. In his 19 year professional career, he was only knocked to the canvas once – by Carlos Hernandez in 2001 – in a fight he won by a unanimous decision. Mayweather, who was ranked by ESPN as the greatest pound for pound boxer of the last 25 years in 2016, needs just one more win to surpass Rocky Marciono’s flawless record of 49-0. McGregor meanwhile boasts a professional record of 21-3 and a UFC record of 9-1. At UFC 194 he knocked out José Aldo in just 13 seconds to become the UFC Featherweight Champion, and at UFC 205 he knocked out Eddie Alvarez for the UFC Lightweight Championship, to become the first fighter in the history of the company to hold titles in two weight divisions simultaneously. The Irishman has never been knocked out in his career – with his three professional defeats all coming via submission – and began boxing as a 12-year-old at Crumlin Boxing Club under two-time Olympian Phil Sutcliffe. The fight will almost certainly be the most valuable fight of all-time. The fight is expected to gross almost 5million PPV buys, which would net a cash windfall of $475m. Sponsorship would likely top $20m, while the projected Nevada betting on the fight stands at $30m. White has estimated that Mayweather will net up to $100m for the fight, with McGregor slated to earn around $75m. “He [Mayweather] feels like he’s the A-side and he should get more of it. But we haven’t really gotten into that negotiation yet,” White explained back in April. The real reason that McGregor stands to earn substantially less than Mayweather is because McGregor is locked into his contract with the UFC, as Jake Cohen explains in this article. But this will still be the largest purse of McGregor’s career by a substantial distance. A number of boxing stars have put themselves forward to feature on the undercard. They include arguably the biggest star currently out there – Great Britain’s Anthony Joshua, who defeated Wladimir Klitschko in front of 90,000 fans at Wembley Stadium in April. “Get me on the undercard!,” Joshua told Mayweather on iFL TV when the pair met at a fan event. “Yeah, why not? It's big,” Joshua added when asked if he would fight on the undercard. “That's legendary shit. That fight will go down in history. It will be part of history.” Mayweather’s protégé, Gervonta Davis, is another to put himself forward and is eager to fight Tevin Farmer on the undercard. Meanwhile, UFC stars Cub Swanson and Jimi Manuwa have both expressed an interest in featuring, with the former calling out British boxing star David Haye. “Dana White, Eddie Hearn, let's make it happen,” Manuwa said after knocking out Corey Anderson at UFC London. “Why not have a fight with David Haye? We're two of the hardest hitters in London. I think that the fight makes sense. Conor wants to fight Mayweather, why not have me against David Haye on the same card?” A number of MMA stars have professional boxing records, including Joe Duffy, who is one of just three men to defeat McGregor inside the cage. Duffy paused his MMA career after losing to Ivan Musardo at Cage Warriors 44 to embark upon a professional boxing career. He won seven straight fights before switching back to MMA, and eventually following McGregor into the UFC. “More than anything, I’m a person who doesn’t want to have any regrets,” he said when reflecting on his move into boxing. “When I’m old I want to be able to say that I gave it a go. That’s what it was. I got to fight professionally and I got to spar with some of the best fighters in the world.” “I don't give McGregor a chance. Him boxing Floyd doesn't make it interesting. If he fought with MMA rules and Floyd boxing, now that would have been interesting. Now that would have genuine intrigue and we'd wonder who is going to win but right now it's like this [squashing motion] but with those rules it'd be totally different.” “It's simple: There is only one winner. I'm a huge MMA fan and a massive UFC fan and a big McGregor. I'm also a Mayweather fan. If these two guys were to get in a cage, it would be over within a minute. But these two guys aren't going to get in a cage, they're going to get in a ring and it will be over whenever Mayweather sees fit. “Don't talk nonsense to me and say 'oh, he could land a punch'. The best fighters of his era have tried to land that punch, never mind the guy from a cage.” “It will be successful, financially. But it is not a fight which will please the boxing purists. The fact that we boxers deliver punches is so different to what they do. There's more looping and what have you because they also have to be in position to be able to kick and be on balance to deliver that elbow or whatever shot they have. “It will be interesting. I'm struggling with words. I'm trying to think how best to describe what could and what would happen. Being just boxing, it's Mayweather by a long shot.” “Mayweather is a way better boxer. There’s just no doubt about it. He’s one of the greatest boxers, if not the greatest boxer that has ever lived. And even though he’s smaller, you’re talking about a completely different level of skill, a completely different level of understanding of the subtle nuances of boxing. “But that said, McGregor, is not incompetent. He’s very dangerous. Mayweather’s a way better boxer, but McGregor is dangerous as f**k and he has a really deceptive ability to move in and move out. He can cover distance very quickly and he can do so in a weird way.” “Mayweather has the experience of competing for years in the sport of boxing, so I don’t see how McGregor can win. Of course, it's a fight, but it’s hard for us MMA fighters to go to a different world challenging one of the best in the history. I don’t see a result different than a win for Mayweather.” “I think it is a publicity stunt but McGregor, when it comes to boxing, is good. He's got a good chance to make something happen in two or three rounds. If anything, he has two or three good rounds. “He's got an amateur style; he's got good movement and good punches for six or eight minutes... He's got a puncher's chance, if anything.” Floyd Mayweather to win: 1/16​Conor McGregor to win: 7/1\nDraw: 33/1 Sport More Sports Boxing Luke Brown    18 show all    1/18 2/18 3/18 4/18 5/18 6/18 7/18 8/18 9/18 10/18 11/18 12/18 13/18 14/18 15/18 16/18 17/18 18/18 T-Mobile Getty Mayweather Getty McGregor McGregor Getty Getty Mayweather Getty Mayweather Pacquaio Getty undercard Getty Mayweather Getty Bellew Getty Mayweather Getty Rogan McGregor Getty Aldo McGregor Getty McGregor Getty", "source": "www.independent.co.uk", "title": "Floyd Mayweather vs Conor McGregor: What time is it and who will win? Full fight preview"}