{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window A pioneering and life-extending drug repeatedly deemed too expensive will now be offered on the NHS in England. It is the result of a confidential deal between the health service and the drug company Roche. Kadcyla, the undiscounted cost of which had been £90,000 per patient, adds an average of six months of life to women with a form of terminal breast cancer. Campaigners have praised the \"monumental\" U-turn, which  will benefit about 1,200 women a year. \"Tough negotiation and flexibility between the NHS and Roche means both patients and taxpayers are getting a good deal,\" said NHS England chief executive Simon Stevens. Kadcyla,  a combination of two drugs, is used to treat people with HER2-positive tumours that have spread to other parts of the body and cannot be surgically removed. Scotland decided in April to pay for the drug, but it had been deemed too expensive by the rest of the UK. In order for a drug to be approved by the regulatory body, the National Institute for Health and Clinical Excellence (NICE), it has to pass a cost-effectiveness test. The full price drug worked out at £166,000 for every \"quality adjusted life year\" of good health. It is not clear how much of a discount has been offered, but it is understood the cost per quality adjusted life year is down to about £50,000. That is in line with other drugs that extend the life of terminally ill patients. Richard Erwin, general manager at Roche, said: \"Close collaboration between Roche, NHS England and NICE has resulted in NICE recommending Kadcyla as a cost-effective treatment. \"This is a positive example of how solutions can be reached when all parties show flexibility.\" The Welsh government expects to offer Kadcyla as soon as an equivalent deal is agreed with Roche. And the decision could allow the drug to be prescribed in Northern Ireland too. Baroness Delyth Morgan, the chief executive at Breast Cancer Now, said: \"This is exceptionally good news... we are absolutely delighted.\" She added: \"Today's landmark decision bodes well for patients looking for reassurances that modern cancer treatments can get through to NHS patients more quickly and can bring transformational improvements in patient outcomes for the future.\" A petition by the charity to get Kadcyla funded had amassed more than 115,000 signatures in less than a month. Gunes Kalkan, from Breast Cancer Care, said: \"This U-turn decision is monumental. \"This proves innovative treatments can be made widely available, and it is hugely frustrating this agreement did not come sooner.\" Follow James on Twitter. By James Gallagher Health and science reporter, BBC News website  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nSPL Image copyright SPL", "source": "www.bbc.co.uk", "title": "'Monumental U-turn' on cancer drug"}