{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window An exam board has apologised for \"poorly wording\" an A Level Psychology test question weeks after making an error in a GCSE paper. Students saw a question asking them to \"calculate the mean percentage of words\", normally seen in a Maths exam. Exam board OCR has since apologised and said it would \"correct this in our marking\". It follows a mistake it made in a GCSE English Literature exam question on Shakespeare's Romeo and Juliet in May. OCR said about 5,000 A Level candidates had been affected, but it was not yet known how many tackled the question. Damian Walmsley, deputy head teacher at St Mary's College in Hull, said students who sat the exam on Wednesday had been left \"disconcerted and confused\" by the question. \"The exam was stopped briefly by the invigilator, who contacted the exam board and got advice for students to ignore the question,\" he added. A mother from Hull, who wished to remain anonymous, said her daughter was \"panicking\" when she saw the question. \"They were asked to calculate the mean percentage of words recalled and then given data to do this from a maths test containing only numbers, is the gist of it,\" she said. \"I am so angry.\" Some students spoke out on social media saying how they were left confused \"doing a psychology paper and not a maths paper\". Russell Hobby, general secretary of school leaders' union NAHT, said: \"Mistakes in exam papers undermine the confidence of students, teachers and schools. It is crucial that processes are in place to prevent these from happening. \"OCR has rightly confirmed that marking of the paper will reflect this mistake. It's crucial that this is clearly communicated to schools.\" In a statement, the exam board said: \"OCR can confirm that a question worth 2 marks out of 90 on an A Level Psychology paper (H567/01) was poorly worded. \"We apologise to candidates for any confusion and will correct this in our marking.\" By Pritti Mistry BBC News  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel  Image caption One mother said her daughter was \"panicking\" when she saw the Maths question Image copyright\nTwitter Image copyright Twitter Image copyright\nTwitter Image copyright Twitter Image copyright\nTwitter Image copyright Twitter Image caption Students took to social media to air their concerns", "source": "www.bbc.co.uk", "title": "OCR exam board admits Psychology test paper 'mistake'"}