{"text": "People walking on London Bridge today were given 3,000 red roses in a show of solidarity and love. The beautiful idea was arranged by British Muslims who wanted to do something to help after eight people died in a terror attack last weekend. Each rose carried ‘messages of love to the world’, the organisers said. People donated £600 to pay for the flowers, given out to anyone who found themselves at the same spot which was the scene of tragedy seven days ago. To view this video please enable JavaScript, and consider upgrading to a web browser that\n\t\t\t\t\t\tsupports HTML5 video 3000 roses for London Bridge. Only a few more hours to go! #1000RosesLondon pic.twitter.com/9ubJJof4cI — 1000RosesLondon (@1000RosesLondon) June 11, 2017  ‘We won’t let London Bridge fall down nor any bridge upon which the communities of this great city and nation are built,’ those handing out the flowers said. After the photos were shared on Facebook, one woman commented: ‘Building bridges not walls. Your love will be appreciated today.’ MORE: Muslim woman comforting injured pensioner is the ‘real Islam’ It comes after a vigil near London Bridge drew hundreds last week. To huge applause, Mayor of London Sadiq Khan told those gathered: ‘As a proud and patriotic British Muslim I say this you do not commit these disgusting acts in my name. ‘Your perverse ideology has nothing to do with the true values of Islam. You will never succeed in dividing our city.’ To view this video please enable JavaScript, and consider upgrading to a web browser that\n\t\t\t\t\t\tsupports HTML5 video  Jen Mills Jen Mills Sunday 11 Jun 2017 3:17 pm Share this article with Facebook  Share this article with Twitter  Share this article with Google Plus  Share this article through email  Share this article with Whatsapp  Share this article through                                            MORE: Muslim woman comforting injured pensioner is the ‘real Islam’   ", "source": "metro.co.uk", "title": "British Muslims handed out 3000 red roses on London Bridge"}