{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window US President Donald Trump \"believes the climate is changing and he believes pollutants are part of the equation,\" says the US ambassador to the UN. He knows \"the US has to be responsible for it and that's what we're going to do,\" said Nikki Haley. The president provoked widespread condemnation when he announced on Thursday the US would withdraw from the Paris climate change agreement. The US becomes one of only three countries outside its framework. When he made the announcement, Mr Trump said the deal would hurt the US economy. He made no mention of climate change science. During his election campaign, Mr Trump had said that climate change was a hoax and, since his announcement on Thursday,  has avoided questions on the subject, as has White House press secretary Sean Spicer. \"Just because the US got out of a club doesn't mean we aren't going to care about the environment,\" Ms Haley told CNN, adding that the terms of the Paris agreement, reached in 2015, were \"too onerous\". Scott Pruitt, the head of the US Environmental Protection Agency, said: \"The world applauded when we joined Paris. And you know why? I think they applauded because they knew it would put this country at a disadvantage.\" Mr Trump said the agreement would cost the US $3tn (£2.3tn) in lost GDP and 6.5 million jobs - while rival economies like China and India were treated more favourably. The president is \"absolutely intent on making sure that we have clean air, clean water, that he makes sure that we're doing everything we can to keep America's moral compass in the world when it comes to the environment,\" said Ms Haley. Only war-torn Syria and Nicaragua, which believes the accords don't go far enough, failed to sign the Paris agreement. China, the EU and India, which along with the US make up the four biggest emitters of carbon dioxide, have restated their commitment to the accord. \"The protection of the environment and the mother planet is an article of faith,\" said India's Prime Minister Narendra Modi, after meeting France's President Emmanuel Macron in Paris on Saturday. The Paris agreement committed countries to keeping rising global temperatures \"well below\" 2C (3.6F) above pre-industrial levels and \"endeavour to limit\" them even more, to 1.5C. The World Meteorological Organisation said that, in the worst scenario, the US pullout could add 0.3C to global temperatures by the end of the century. France and India are members of the International Solar Alliance, set up following the Paris agreement, which aims to generate $1tn of investment in solar power by 2030. Climate change, or global warming, refers to the damaging effect of gases, or emissions, released from industry, transportation, agriculture and other areas into the atmosphere. The Paris accord is meant to limit the global rise in temperature attributed to emissions. Countries agreed to: Nasa's Goddard Institute for Space Studies says the world's average temperature has risen by about 0.8C since 1880, two-thirds of that since 1975. US think tank Climate Interactive predicts that if all nations fully achieve their Paris pledges, the average global surface temperature rise by 2100 will be 3.3C, or 3.6C without the US.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nGetty Images Image copyright Getty Images Image caption The US president's decision led to protests against the withdrawal from the Paris agreement ", "source": "www.bbc.com", "title": "Trump 'does believe in climate change', says US ambassador to UN"}