{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window Prime Minister Theresa May has ordered a full public inquiry into the fire that engulfed a west London block of flats, killing at least 17 people. That figure is expected to rise, as fire chiefs do not expect to find any more survivors in the burnt-out Grenfell Tower in North Kensington. The PM said people \"deserve answers\" as to why the fire spread so rapidly. The first victim has been named by the Syria Solidarity Campaign as Syrian refugee Mohammed Alhajali, 23. Six victims of the blaze have been provisionally identified, Metropolitan Police Commander Stuart Cundy said, but \"there is a risk that sadly we may not be able to identify everybody\". Asked about the number of dead, Cdr Cundy said: \"I hope it is not triple figures, but I can't be drawn on the numbers.\" In a statement, the Syria Solidarity Campaign said Mr Alhajali, a civil engineering student, had been in a flat on the 14th floor when the fire broke out, and had spent two hours on the phone to a friend in Syria. He had been trying to get through to his family while he was waiting to be rescued. The group said: \"Mohammed bid his friend goodbye, saying that the fire had reached him. He asked his friend to pass on the message to his family... \"Mohammed undertook a dangerous journey to flee war and death in Syria, only to meet it here in the UK, in his own home. \"Mohammed came to this country for safety and the UK failed to protect him.\" His older brother, Omar, told the BBC he had lost Mohammed on the way out of the building. Earlier, Mrs May made a private visit to the scene, where she spoke to Fire Commissioner Dany Cotton and members of the emergency services. She said: \"[They] told me that the way this fire had spread and took hold of the building was rapid, it was ferocious, it was unexpected. \"So it is right that, in addition to the immediate fire report that will be produced and any potential police investigation, that we do have a full public inquiry to get to the bottom of this.\" Number 10 confirmed the public inquiry will be judge-led. Sources say the government hopes to announce the name of the judge \"soon\", the BBC's assistant political editor Norman Smith said. London Mayor Sadiq Khan said one of the issues the inquiry would consider was whether the tower block had been refurbished in a safe way. Labour leader Jeremy Corbyn also visited the site, meeting residents affected by the fire. He told community leaders \"the truth has to come out\". The Labour MP Harriet Harman criticised Mrs May for not meeting residents, writing on Twitter: \"She should have been prepared to listen to them.\" BBC political editor Laura Kuenssberg said Mrs May's team believed the decision not to visit residents was made for the right reasons. \"They didn't want to get in the way, they wanted to allow the emergency effort to carry on unimpeded and, frankly, it is just not her style to have TV cameras trailing her every move,\" she said. But she said the decision could \"prove to be a miscalculation\" because events like this \"can require real displays of empathy\". By Brian Wheeler, BBC News Public inquiries are set up for many reasons. Sometimes they are designed to expose the truth after a controversy, or apportion blame to individuals. More often, they simply produce recommendations, which the government can choose to follow or not. Recent examples include Leveson, into press standards, and Chilcot, into the Iraq war. They differ from police investigations or probes by official bodies because they are conducted, in part at least, in public. They might even be televised. They can be run by a judge, with witnesses giving evidence under oath, but there is no fixed model. Much depends on the \"terms of reference\". They can also drag on for years and cost millions of pounds, although the government says it wants the Grenfell Tower inquiry to \"move with speed\". Rydon, the company that carried out the £8.6m refurbishment of Grenfell Tower, said it welcomed the announcement of the public inquiry. It said it had carried out a partial refurbishment which \"met all required building regulations as well as fire regulation and health and safety standards\". The tower is managed by the Kensington and Chelsea Tenant Management Organisation on behalf of the council. In its latest statement, it offered its \"sincere and heartfelt condolences\" to those affected and said its immediate concern and focus was working with the council to assist the residents of the tower block. Housing minister Alok Sharma said the government was working with the local authority to ensure that  \"every single family will be re-housed in the local area\". Fire minister Nick Hurd called the fire a \"national tragedy\" and said there was \"no room for plodding bureaucracy\". He said there should be \"no stone unturned on this because we completely understand the shock, the concern, the anger, the frustration, the fear that is out there\". Firefighters were called to the 24-storey residential tower in the early hours of Wednesday, at a time when hundreds of people were inside, most of them sleeping. Many were woken by neighbours, or shouts from below, and fled the building. Fire crews rescued 65 adults and children, but some stayed in their homes, trapped by smoke and flames. Thirty people remain in hospital - 15 of whom are in a critical condition. The Queen said her \"thoughts and prayers\" were with families. By Mario Cacciottolo, BBC News Father Bisrat Berhanu, 55, is an Orthodox priest and lives in Lancaster Way. He's been in the area for 19 years. He would visit people in Grenfell Tower, knew families there, and is shocked at what's happened. \"The community is dynamic, it's close,\" he says. \"The people in the tower blocks knew each other, they were like a family. I've met people who lived there. We've cried together. \"We're feeling shock and shock. Everyone's been ringing me, even people from overseas, asking just what has happened.\" Read more from Mario On Thursday morning, London Fire Commissioner Dany Cotton said a brief search of all floors in the tower had been carried out, but \"a good half\" of the building had yet to be searched in detail. The cause of the fire, which took more than 24 hours to bring under control, remains unknown. Photographs and messages in English and Arabic have been left for loved ones on a wall of condolence near the tower block. Alongside them are words of anger and calls for justice, with people saying their safety concerns were not listened to. The government has said checks were now planned on tower blocks that have gone through a similar upgrade. An emergency number - 0800 0961 233 - has been set up for anyone concerned about friends or family. Those who have reported someone as missing, but have since found them, are also asked to get in touch with police. Get news from the BBC in your inbox, each weekday morning  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Related Topics Media caption Image copyright\nGetty Images Image copyright Getty Images Image caption The prime minister spoke to fire commissioner Dany Cotton as she surveyed the damage Media caption Media caption Media caption  Image caption One of the first images from inside the tower shows a small fire still burning inside one flat Image copyright\nPA Image copyright PA Image caption Sniffer dogs have been sent in to search for evidence Image copyright\nGetty Images Image copyright Getty Images Image copyright\nGetty Images Image copyright Getty Images Image caption Hundreds of pairs of donated shoes have been laid out in the Westway Sports Centre   ", "source": "www.bbc.co.uk", "title": "London fire: Prime minister orders full public inquiry"}