{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window A jury deliberating Bill Cosby's sex assault trial has told the judge they are deadlocked on day four of their deliberations. But the judge has instructed the panel to return to continue trying to reach a verdict. If the seven men and five women cannot reach a unanimous decision a mistrial will be declared. Mr Cosby, 79, is accused of drugging and sexually assaulting Andrea Constand at his Philadelphia-area home in 2004. Ms Constand and her mother were in court for the announcement from the jurors. The BBC's Aleem Maqbool, in court, says the jurors informed the judge on Thursday morning they were unable to reach a consensus on any of the charges, each of which carries a maximum 10-year prison sentence. Bill Cosby: From America's Dad to comic under fire Bill Cosby: Diehard fans stick by hometown hero Why is there a time limit on sexual assault cases Judge Steven O'Neill read a standard statement asking them to try to agree on some or all of the counts. He did not give a time limit for deliberations. After the deadlock was announced, several other women who have accused Mr Cosby of assault left the courtroom in tears, according to court reporters. Mr Cosby's spokesman Andrew Wyatt told journalists on the courtroom steps in Norristown, Pennsylvania, that Mr Cosby was \"innocent until proven guilty\". Mr Wyatt said: \"He never got a fair trial. He never should have been here. That was unfair to have him here.\" On Wednesday jurors asked to rehear Mr Cosby's testimony from the 2005 civil case brought forth by the same accuser. Ms Constand, who was an administrator at Philadelphia's Temple University where Mr Cosby was on the board of trustees, says she was drugged and sexually assaulted during a 2004 visit to the comic's home to seek career advice. Mr Cosby said in a 2005-06 civil deposition that he provided pills to help her relax, but said it was a cold medication. He also has claimed that their physical contact was consensual. The pioneering comedian was the first African-American to appear on primetime television in the US. Mr Cosby has been accused by at least 50 women of drugging and sexually assaulting them over the course of his career. However, due to statute of limitation rules, the charges brought forth by the district attorney in the Philadelphia suburb is the only trial he faces. If a mistrial is declared, prosecutors must decide if there is enough evidence to seek a new trial or decide to drop the charges.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nReuters Image copyright Reuters Image copyright\nReuters Image copyright Reuters Image caption Constand has been in the courtroom throughout the trial Media caption", "source": "www.bbc.co.uk", "title": "Cosby sex assault trial jury deadlocked"}