{"text": "How the Russian Revolution became taboo Just over 100 years ago, Russian Emperor Nicholas II abdicated his throne and his vast empire ceased to exist, setting off decades of world-shaking change. Yet this year, not a single Russian television station marked the anniversary. The decision to ignore the centennial arose from a meeting at the Kremlin last year, in which Russian President Vladimir Putin told his advisors that it would be unnecessary to commemorate it. Instead, the occasion should be discussed “only by experts,” he reportedly said. That is, let the experts, the historians, discuss the Revolution; the rest of Russia shouldn’t concern itself with such matters. This order was then conveyed by Sergei Kirienko, the Kremlin’s new political strategist, to the directors of Russia’s state media companies. Russia doesn’t need revolutions—it needs stability, he said, according to those who attended these meetings. The collapse of empire had become taboo for Russian media, and apparently a negligible historical footnote for Putin. What Russia's Latest Protests Mean for Putin Putin, however, is no Soviet Union groupie, notwithstanding his 2006 declaration that “the collapse of the U.S.S.R. [was] the biggest geopolitical catastrophe of the 20th century.” Leftist ideologies are alien to him. Since becoming president in 2000, he has stocked the government with neoliberal adherents and ardent free marketeers, not with neo-communists and command economy admirers. What Putin pines for, above all else, are the days of Russia’s expansive greatness. The idea of Russian empire, then, comes naturally to Putin. But his version of empire isn’t an exact replica of Nicholas II’s. Instead, it is an imagined, virtual empire, encompassing the traits of the Soviet Union, Russian Orthodox Christianity, sovereignty, populism, Joseph Stalin, victory in World War II, Yuri Gagarin’s trip into space, and the palaces of Catherine the Great. Putin’s ideology is built on a feeling of Russia’s inherent greatness, the idea that it is a country to be feared and respected. A world in which CNN airs a documentary about Putin called “The Most Powerful Man in the World” is his best world. The conventional wisdom is that, during Putin’s first term, the people of Russia traded their political freedom for a sense of security and prosperity. In the 2000s, thanks to high oil prices, many Russians were better off than ever before. But that’s changed since then. Russians are now willing to forego a part of their prosperity in exchange for a sense of national pride, willing to suffer the sting of sanctions or economic crisis as long as Crimea is part of Russia. Most Russians haven’t felt pride in their country since the collapse of the Soviet Union in 1991. Because of the economic turbulence that followed, many of them felt humiliated. Now, for many, Putin has restored a sense of pride. It’s like what you feel when your favorite football team wins. Nothing actually changes: You don’t become smarter, healthier, or richer; your personal life doesn’t improve. You simply, irrationally, feel happier, proud of an accomplishment in which you played no role. To millions of Russians, Putin is that football team. And all he does is win. Russia’s glories of yesteryear are far more important than some new, unprecedented victory, providing fuel for the Russian propaganda machine. As oil prices tumbled to historic lows, Russian history has replaced the bounty of the boom years as the eternal spring of Putin’s popularity. Viewed through this lens, 1917 is the most uncomfortable year possible for Russian propaganda. In the story of the fall of the Russian empire, there is no character for Putin to equate himself with. Not Stalin, the man who led his countrymen to victory in the war (he has never compared himself with Stalin personally), and not Nicholas II, that loser who surrendered an empire. Nor can he equate himself with Vladimir Lenin, the revolutionary who wrecked an empire. (Putin doesn’t hide his antipathy for Lenin, referring to him as the man who put a ticking atomic bomb under Russia.) And Putin certainly cannot compare himself to the democratic revolutionaries who governed the country from the February and October 1917. Thanks to their efforts, Russia became, for a short time, the most progressive country in the world, the first nation in Europe to abolish the death penalty, and one of the first to introduce universal suffrage, including for women. For those months, Russia’s strong, free civil society tried to take the country’s fate into its own hands, inspired by artists like Wassily Kandinsky, composer Igor Stravinsky, director Constantin Stanislavski, Ballet Russe founder Serge Diaghiliev, and writers and poets like Mikhail Bulgakov and Anna Akhmatova. Indeed, the first democratic prime minister of Russia, Georgy Lvov, was a friend and follower of Leo Tolstoy, and tried to implement a utopian ideal to create a non-violent state. He resigned in July 1917 after the first attempt by the Bolsheviks at a violent coup, saying he could not bring himself to use weapons to put down an uprising. His replacement, Alexander Kerensky, was a charismatic leader of the February Revolution, perhaps capable of becoming a soft dictator or a Russian Ataturk. But he, too, wanted to follow a Western, democratic path. And in the end he was ousted by Lenin, a far more brutal dictator. But for Russia’s contemporary ideology, neither great culture nor a powerful civil society are important. What’s important, instead, is a victorious Russian empire. Anything that doesn’t square with this image can be discarded. There is, however, one aspect of contemporary Russian propaganda that recalls the Revolutions of 1917. According to Russian state television, the Russian opposition is composed of agents of Western NGOs and security services. Any revolution is always the result of a conspiracy or foreign meddling, it seems. The official Russian conspiracy theory—hammered home by Russian TV every day and believed by Putin—tells us that the Ukrainian revolution of 2014 was organized and paid for by the Americans, along with the revolutions of the Arab Spring. Now, we see the same kinds of theories pop up in state media portrayals of the Revolutions of 1917. The February Revolution, which felled Nicholas II, is now said to have been sponsored by the British (through the efforts of the very active British ambassador to Russia, George Buchanan). The October Revolution, which brought the Bolsheviks to power, was allegedly financed by the Germans, who helped Lenin make his way to Russia and really needed his help to end World War I. Incidentally, Russia of 100 years ago was awash in similar conspiracy theories. In 1917, the Russian czarist state considered everyone in the opposition to be traitors who had sold their souls to the British, while the liberal opposition believed that the government was crawling with German spies. Today, it is accepted wisdom that there were no conspiracies, neither British nor German, shaping the events of 1917. Lenin was no spy, even though authorities in Berlin did allow him and his Bolsheviks to pass through Germany during the war on their way back to Russia, where they hoped to finish the revolution (and, hopefully, pull Russia out of the war). A massive amount of energy was spent fighting imagined threats instead of real ones from the West. And when the chaos of genuine revolution descended, everything fell apart. There was no one left to defend Nicholas II: Everyone who had been loyal to him before his abdication had vanished. The Russian government of today doesn’t fear a revolution. Even the recent anti-corruption protests in several Russian cities still do not impress the Kremlin. Those protesters were young hipsters, they are sure, and the vast majority of Russians will remain absolutely loyal. The Kremlin is certain that everything is stable, that the people are proud of their president and that there’s no reason to worry. And they’re right. But in its day, the Russian Empire seemed even more stable. Everyone knew what would happen to the Empire of Nicholas II: It would be ruled by his son, Alexei. Today’s Russian stability is far less predictable. This article was translated from the Russian by Julia Ioffe. A young woman rides a dizzying carousel every day for six years straight—but it's not for the thrill. Russian President Vladimir Putin speaks at the Kremlin in Moscow, Russia, on July 27, 2016. Maxim Shemetov / Reuters Mikhail Zygar Mikhail Zygar", "source": "www.theatlantic.com", "title": "Putin Likes to Pretend 1917 Never Happened"}