{"text": "Federal investigation into Trump campaign’s ties to Russia has expanded to include whether the president tried to thwart it, the Washington Post reports Ben Jacobs in Washington and \nLois Beckett in New York Thu 15 Jun 2017 10.56 BST\n\n\nFirst published on Thu 15 Jun 2017 00.05 BST Donald Trump is reportedly being investigated for potential obstruction of justice by the special counsel looking into Russia’s interference in the 2016 presidential election. This marks the first time that the investigation, which has hung over Trump since his inauguration, has potentially implicated the president himself. The Washington Post reported on Wednesday night that the federal investigation into the Trump campaign’s ties with Russia during the 2016 campaign, being overseen by Robert Mueller, has now expanded into whether the president attempted to thwart that investigation. Trump tweeted early on Thursday morning: “They made up a phony collusion with the Russians story, found zero proof, so now they go for obstruction of justice on the phony story. Nice.” He later repeated his claims that such investigations were a “WITCH HUNT”. The allegations of obstruction of justice apparently center on Trump’s efforts to encourage former FBI director James Comey to drop an investigation of former national security adviser Michael Flynn. Comey testified under oath to Congress last week that Trump told him in a private meeting, “I hope you can see your way clear to letting this go, to letting Flynn go. He is a good guy. I hope you can let this go.” Trump has since said Comey said things that “weren’t true” while under oath and that he was “100% willing” to testify before Congress. Flynn, who resigned as national security adviser in February after serving in that position for less than a month, had come under scrutiny for undisclosed conversations with Russian ambassador Sergey Kislyak and then misleading vice-president Mike Pence about the nature of his contacts with Kislyak. Comey was fired in May by Trump and the president cited “this Russia thing” as a reason for the FBI director’s sacking in an interview with NBC News. The White House had initially claimed Comey’s handling of the investigation into Hillary Clinton’s use of a private email server was the reason for his firing before Trump contradicted his staff’s statements on the topic. In addition to his alleged attempts to influence Comey, Trump reportedly intervened with Dan Coats, the director of national intelligence, in an attempt to ask him to persuade Comey to back off the FBI investigation of Flynn, a close Trump ally. In addition, Trump allegedly asked both Coats and Adm Mike Rogers, the head of the National Security Agency, to issue statements denying evidence that his campaign colluded with Russia in the 2016 campaign. Both men reportedly declined to do so. The Post and the New York Times are reporting that Mueller is seeking to interview Coats, Rogers and Richard Ledgett, the former deputy director of the National Security Agency, in an attempt to gain more information about potential efforts by Trump to obstruct justice. The reported expansion of the investigation comes only days after speculation mounted that the president might fire Mueller, stoked by a television appearance by Trump confidante Chris Ruddy, who said “terminating” the special counsel was under consideration. Rod Rosenstein, the deputy attorney general who would be responsible for making such a decision, told senators on Tuesday that there was “no secret plan” to sack Mueller. However, White House deputy press secretary Sarah Huckabee Sanders told reporters late Tuesday: “While the president has the right to [fire Mueller], he has no intention to do so.” The White House referred a request for comment on Wednesday to Marc Kasowitz, Trump’s personal attorney. Mark Corallo, a spokesman for Kasowitz, told the Guardian: “The FBI leak of information regarding the president is outrageous, inexcusable and illegal.” In response to a follow up question about whether anything in the Washington Post story was inaccurate, Corallo simply reiterated his previous statement. The FBI’s press office did not immediately respond to a request for comment. Ben Jacobs Ben Jacobs Lois Beckett Lois Beckett 10.56 BST 00.05 BST Share on Facebook  Share on Twitter  Share via Email   View more sharing options Share on LinkedIn  Share on Pinterest  Share on Google+  Share on WhatsApp  Share on Messenger  Close     Facebook  Twitter  Pinterest   Topics Share on Facebook  Share on Twitter  Share via Email  Share on LinkedIn  Share on Pinterest  Share on Google+  Share on WhatsApp  Share on Messenger  Reuse this content ", "source": "www.theguardian.com", "title": "Donald Trump under investigation for potential obstruction of justice – reports"}