{"text": "Let friends in your social network know what you are reading about President Trump on Thursday criticized reports that he is now under investigation for obstruction of justice in connection with the firing of FBI Director James Comey, denouncing it as another \"witch hunt\" that is unfairly targeting him. A link has been sent to your friend's email address. A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs With reports President Trump is now under investigation, Trump unleashed a furious rebuttal. Nathan Rousseau Smith (@fantasticmrnate) explains.\n    Buzz60 President Trump(Photo: Jim Watson, AFP/Getty Images) WASHINGTON — In a day-long tweet storm, President Trump on Thursday sought to discredit disclosures that that he is now under investigation for obstruction of justice in connection with the firing of FBI Director James Comey, denouncing the inquiry as another \"witch hunt.\" \"They made up a phony collusion with the Russians story, found zero proof, so now they go for obstruction of justice on the phony story,\" Trump tweeted. \"Nice.\" Trump followed up about an hour later with another critical tweet: \"You are witnessing the single greatest WITCH HUNT in American political history — led by some very bad and conflicted people!\" They made up a phony collusion with the Russians story, found zero proof, so now they go for obstruction of justice on the phony story. Nice You are witnessing the single greatest WITCH HUNT in American political history - led by some very bad and conflicted people!  #MAGA Why is that Hillary Clintons family and Dems dealings with Russia are not looked at, but my non-dealings are? Crooked H destroyed phones w/ hammer, 'bleached' emails, & had husband meet w/AG days before she was cleared- & they talk about obstruction? Nearly eight hours later, Trump again complained about being singled out and brought up his Democratic critics, including 2016 election opponent Hillary Clinton: \"Why is that Hillary Clintons family and Dems dealings with Russia are not looked at, but my non-dealings are?\" Trump then tweeted about Clinton's use of private email while secretary of State, though she was not charged after a Justice Department investigation last year. Associates of Clinton and other Democrats have not been linked to what U.S. intelligence officials describe as a Russian effort to influence the 2016 election by hacking email accounts of Democratic Party officials. Trump, who has denied any kind of collusion with Russia, was responding to Russia special counsel Robert Mueller's now-expanded probe that includes a review of whether the president attempted to obstruct justice, according to a person familiar with the matter. The inquiry began following the abrupt dismissal of the former FBI director who told the Senate Intelligence Committee last week that the president directed him to drop the bureau's investigation into former national security adviser Michael Flynn and his prior communications with Russian ambassador Sergey Kislyak. The obstruction investigation was first disclosed by the Washington Post , which reported that Mueller is interviewing top intelligence officials in connection with the inquiry. Senate Intelligence Committee, meanwhile, continued to pursue a parallel inquiry Thursday, taking testimony in closed session from Director of National Intelligence Dan Coats. A week after declining to answer questions about whether Trump asked him to publicly downplay possible collusion between the Trump campaign and Russian officials, Coats spent more than three hours with the panel in a closed session. North Carolina Sen. Richard Burr, the panel's Republican chairman, and Virginia Sen. Mark Warner, the committee's top Democrat, said Coats' appearance was an attempt to \"clear up a number of questions that remained from his appearance in open session last Wednesday.'' Last week, Coats told the committee that he did not believe it was appropriate for him to publicly discuss conversations he has had with the president. \"I have never felt pressured to intervene or interfere in any way with shaping intelligence in a political way or in relation to an ongoing investigation,\" Coats testified. Coats left Thursday's session without comment or addressing questions about whether he also would be discussing his contacts with the president with Mueller's investigators. While the Justice Department appointed Mueller to investigate Russian efforts to interfere in the 2016 presidential election — and any links to the Trump campaign — his assignment also includes \"any matters that...may arise” from the Russia probe. Rosenstein named Mueller Special Counsel Robert Mueller will investigate President Donald Trump. Specifically, Mueller will explore the possibility that Trump obstructed justice.\n    Newslook Deputy Attorney General Rod Rosenstein appointed Mueller as special counsel shortly after Comey's firing. Rosenstein was acting, because Attorney General Jeff Sessions had recused himself from acting in the Russia investigation after it was revealed he had held two meetings with Russian Ambassador Sergey Kislyak before the Nov. 8, 2016 election. The disclosure of Mueller's expanded inquiry comes amid reports that Trump has discussed whether to remove the special counsel. White House officials said the president is not considering such a step. Supporters of Trump condemned the news leaks regarding the new investigation. \"The FBI leak of information regarding the President is outrageous, inexcusable and illegal,\" said Mark Corallo, a spokesman for Trump's legal team. Trump is not the first president to be subjected to a special counsel investigation, nor the first president to protest it. During the 1990s, President Bill Clinton and supporters protested the investigation of independent counsel Kenneth Starr, which began as a probe of the Whitewater real estate deal and ended with Clinton's impeachment on charges of perjury and obstruction regarding his relationship with intern Monica Lewinsky. Former Watergate prosecutor Archibald Cox, left, and former attorney general Elliot Richardson, who quit rather than fire Cox on President Richard Nixon's orders. (Photo: Brian K. Diggs, AP) In the most famous presidential investigation, Watergate, Archibald Cox was appointed special prosecutor on May 18, 1973 — by June 5, Nixon was complaining about being attacked by Cox. That October, Nixon had Cox fired, leading eventually to House impeachment hearings and the president's resignation. Read more: Timeline: Key moments in the FBI probe of Russia's efforts to influence the 2016 election Mueller investigating Trump for possible obstruction, report says A link has been posted to your Facebook feed. Facebook Facebook Email Email Twitter Google+ LinkedIn Pinterest   Post to Facebook Cancel Send 79 David Jackson and Kevin Johnson, USA TODAY Published 7:32 a.m. ET June 15, 2017 | Updated 6:55 p.m. ET June 15, 2017 Updated 6:55 p.m. ET June 15, 2017 Buzz60  President Trump(Photo: Jim Watson, AFP/Getty Images) President Trump (Photo: Jim Watson, AFP/Getty Images) CONNECT  CONNECT  TWEET  LINKEDIN 79\n                \n            COMMENT 79 COMMENT EMAIL  EMAIL MORE  MORE Newslook (Photo: Brian K. Diggs, AP)  Facebook Facebook Twitter Google+ LinkedIn    Post to Facebook Andrew Harnik, AP  Jim Watson, AFP/Getty Images  Win McNamee, AP  Evan Vucci, AP  Jim Watson, AFP/Getty Images  Pool  Pool, Getty Images  Evan Vucci, AP  Carolyn Kaster, AP  Carolyn Kaster, AP  Jim Watson, AFP/Getty Images  Manuel Balce Ceneta, AP  Chip Somodevilla, Getty Images  Michael Reynolds, EPA-EFE  Pool, Getty Images  Jim Watson, AFP/Getty Images  Susan Walsh, AP  Noel Celis, AFP/Getty Images  Andrew Harnik, AP  Evan Vucci, AP  Chip Somodevilla, Getty Images  Alex Brandon, AP  Evan Vucci, AP  Darron Cummings, AP  Seth Wenig, AP  Win McNamee, Getty Images  Brendan Smialowski, AFP/Getty Images  Evan Vucci, AP  Nicholas Kamm, AFP/Getty Images  Jim Watson, AFP/Getty Images  Alex Wong, Getty Images  Roy Dabner, European Pressphoto Agency  Shawn Thew, European Pressphoto Agency  Pablo Martinez Monsivais, AP  Evan Vucci, AP  Susan Walsh, AP  Alex Brandon, AP  Alex Brandon, AP  Pablo Martinez Monsivais, AP  Chip Somodevilla, Getty Images  Ian Langsdon, AFP/Getty Images  Saul Loeb, AFP/Getty Images  Evan Vucci, AP  Mark Wilson, Getty Images  Andrew Harnik, AP  Pablo Martinez Monsivais, AP  Bill Pugliano, Getty Images  Win McNamee, Getty Images  Sean Kilpatrick, AP  Osservatore Romano/Handout/European Pressphoto Agency  Filippo Monteforte, AFP/Getty Images  Ronen Zvulun, Pool/European Pressphoto Agency  Mandel Ngan, AFP/Getty Images  Evan Vucci, AP  Mandel Ngan, AFP/Getty Images  Carolyn Kaster, AP  Mike Stewart, AP  Brendan Smialowski, AFP/Getty Images  Alex Brandon, AP  Jim Watson, AFP/Getty Images  Geoff Burke, USA TODAY Sports  Brendan Smialowski, AFP/Getty Images  Evan Vucci, AP  Jim Watson, AFP/Getty Images  Alex Brandon, AP  Andrew Harnik, AP  Pablo Martinez Monsivais, AP  Jim Lo Scalzo, European Pressphoto Agency  Chip Somodevilla, Pool/European Pressphoto Agency  Bill Ingalls, NASA/Getty Images  J. Scott Applewhite, AP  Michael Reynolds, European Pressphoto Agency  Evan Vucci, AP  Bill Pugliano, Getty Images  MIchael Reynolds, Pool, Getty Images  Jim Watson, AFP/Getty Images  Pablo Martinez Monsivais, AP  Saul Loeb, AFP/Getty Images  Jack Gruber, USA TODAY  Jim Watson, AFP/Getty Images  Susan Walsh, AP  Chris O'Meara, AP  Evan Vucci, AP  Pablo Martinez Monsivais, AP  Evan Vucci, AP  Alex Wong, Getty Images  Evan Vucci, AP  Susan Walsh, AP  Pool, Getty Images  Chris Kleponis, Pool/European Pressphoto Agency  Saul Loeb, AFP/Getty Images  Mandel Ngan, AFP/Getty Images  Susan Walsh, AP  Mandel Ngan, AFP/Getty Images  Drew Angerer, Getty Images  Michael Reynolds, European Pressphoto Agency  Michael Reynolds, European Pressphoto Agency  Susan Walsh, AP  Shawn Thew, European Pressphoto Agency  Pablo Martinez Monsivais, AP  Nicholas Kamm, AFP/Getty Images  Pablo Martinez Monsivais, AP  Chip Somodevilla, Pool/European Pressphoto Agency  Shawn Thew, European Pressphoto Agency  Susan Walsh, AP  Saul Loeb, AFP/Getty Images  Pablo Martinez Monsivais, AP  Mandel Ngan, AFP/Getty Images  Andrew Harnik, AP  Kevin Dietsch, Pool/European Pressphoto Agency  J. Scott Applewhite, Pool Photo-USA TODAY Sports  J. Scott Applewhite, Pool  Rob Carr, Getty Images  Porter Binks, USA TODAY  1 of 114 2 of 114 3 of 114 4 of 114 5 of 114 6 of 114 7 of 114 8 of 114 9 of 114 10 of 114 11 of 114 12 of 114 13 of 114 14 of 114 15 of 114 16 of 114 17 of 114 18 of 114 19 of 114 20 of 114 21 of 114 22 of 114 23 of 114 24 of 114 25 of 114 26 of 114 27 of 114 28 of 114 29 of 114 30 of 114 31 of 114 32 of 114 33 of 114 34 of 114 35 of 114 36 of 114 37 of 114 38 of 114 39 of 114 40 of 114 41 of 114 42 of 114 43 of 114 44 of 114 45 of 114 46 of 114 47 of 114 48 of 114 49 of 114 50 of 114 51 of 114 52 of 114 53 of 114 54 of 114 55 of 114 56 of 114 57 of 114 58 of 114 59 of 114 60 of 114 61 of 114 62 of 114 63 of 114 64 of 114 65 of 114 66 of 114 67 of 114 68 of 114 69 of 114 70 of 114 71 of 114 72 of 114 73 of 114 74 of 114 75 of 114 76 of 114 77 of 114 78 of 114 79 of 114 80 of 114 81 of 114 82 of 114 83 of 114 84 of 114 85 of 114 86 of 114 87 of 114 88 of 114 89 of 114 90 of 114 91 of 114 92 of 114 93 of 114 94 of 114 95 of 114 96 of 114 97 of 114 98 of 114 99 of 114 100 of 114 101 of 114 102 of 114 103 of 114 104 of 114 105 of 114 106 of 114 107 of 114 108 of 114 109 of 114 110 of 114 111 of 114 112 of 114 113 of 114 114 of 114 Autoplay Show Thumbnails Show Captions CONNECT  CONNECT  TWEET  LINKEDIN 79\n                \n            COMMENT 79 COMMENT EMAIL  EMAIL MORE  MORE", "source": "www.usatoday.com", "title": "Trump attacks obstruction of justice probe by former FBI chief Mueller"}