{"text": "French leader immediately condemns US President's decision to abandon pact for environmental action and raises fears it could lead to 'a world of migrations, of wars, of shortage - a dangerous world' French President Emmanuel Macron has offered a \"second homeland\" for US climate scientists after Donald Trump announced America would withdraw from the Paris climate change agreement. Mr Macron immediately joined international condemnation of The President's decision to abandon the pact for environmental action on Thursday and raised fears it could lead to \"a world of migrations, of wars, of shortage - a dangerous world\". In a live broadcast from the Élysée Palace, he also riffed on Mr Trump's pledge to \"Make America Great Again\" as he urged US climate scientists to travel to France and \"make our planet great again\". The message echoes criticism from the leaders of France, Germany, and Italy - and EU and UN officials who branded the withdrawal \"a major disappointment\". \"Tonight, I wish to tell the United States, France believes in you — the world believes in you,\" said Mr Macron. \"I know that you are a great nation. I know your history — our common history. “To all scientists, engineers, entrepreneurs, responsible citizens who were disappointed by the decision of the president of the United States, I want to say that they will find in France a second homeland. “I call on them: come and work here with us. To work together on concrete solutions for our climate, our environment. I can assure you, France will not give up the fight. “I call on you to remain confident. We will succeed, because we are fully committed, because wherever we live, whoever we are, we all share the same responsibility: Make Our Planet Great Again.” Come here with us to work together on concrete solutions for our climate, our environment. pic.twitter.com/JXiqgMP8Xy A total of 194 countries, including China and the EU, signed the Paris Climate accord and agreed to a series of pledges designed to limit global warming, cut greenhouse gas emissions, and provide funding for poor nations in late 2015. Mr Trump sought to renegotiate the terms to ease conditions on US businesses and workers, claiming the current deal could cost 2.7 million American jobs by 2025. When European leaders said the Paris accord couldn't be altered, The President decided to pull out and insisted he was keeping his campaign promise to stop international agreements that disadvantage the US. In his English-language speech from the presidential palace, unprecedented from a French president in an address at home, Mr Macron said: \"I do respect this decision but I do think it is an actual mistake both for the US and for our planet.\" \"If we do nothing our children will know a world of migrations, of wars, of shortage - a dangerous world,\" he added. \"It's not a future we want for ourselves. It's not a future we want for our children.\" A man is covered with a multi-coloured banner with the message, \"Climate\" as environmentalists attend a demonstration near the Eiffel Tower in Paris, France, during the World Climate Change Conference 2015 (COP21) that meets in Le Bourget, December 12, 2015 Reuters French President Francois Hollande (C) and French Foreign Minister Laurent Fabius (R) applaud after a statement at the COP21 Climate Conference in Le Bourget, north of Paris, on December 12, 2015. The years-long quest for a universal pact to avert catastrophic climate change neared the finish line today with conference host France announcing that the final draft had been completed in the early hours of the morning. Getty US Secretary of State John Kerry (C) speaks with China's Special Representative on Climate Change Xie Zhenhua (R) and officials at the COP21 Climate Conference in Le Bourget, north of Paris, on December 12, 2015. The years-long quest for a universal pact to avert catastrophic climate change neared the finish line today with conference host France announcing that the final draft had been completed in the early hours of the morning. Getty Delegates and members of NGO's read and work on copies of 'The adoption of the Paris agreement' is pictured after the announcement of the final draft by French Foreign Affairs minister Laurent Fabius at the COP21 Climate Conference in Le Bourget, north of Paris, on December 12, 2015. The years-long quest for a universal pact to avert catastrophic climate change neared the finish line with conference host France announcing that the final draft had been completed in the early hours of the morning Getty UN climate chief Christiana Figueres (C) speaks with French President Francois Hollande (L), United Nations Secretary General Ban Ki-moon (2ndL) and French Foreign Minister Laurent Fabius (R) after a statement at the COP21 Climate Conference in Le Bourget, north of Paris, on December 12, 2015. The years-long quest for a universal pact to avert catastrophic climate change neared the finish line today with conference host France announcing that the final draft had been completed in the early hours of the morning Getty A Swiss Dominican priest poses with activists dressed as polar bears as activists gather for a demonstration to form a giant red line at the Avenue de la Grande armee boulevard in Paris on December 12, 2015, as a proposed 195-nation accord to curb emissions of the heat-trapping gases that threaten to wreak havoc on Earth's climate system is to be presented at the United Nations conference on climate change COP21 in Le Bourget, on the outskirts of Paris. Getty Activists hold up a giant banner reading 'Climate justice' by association 'ourpowercampaign' during a demonstration near the Arc de Triomphe at the Avenue de la Grande armee boulevard in Paris on December 12, 2015, as a proposed 195-nation accord to curb emissions of the heat-trapping gases that threaten to wreak havoc on Earth's climate system is to be presented at the United Nations conference on climate change COP21 in Le Bourget, on the outskirts of Paris. Getty Representatives of indigenous peoples demonstrate in Paris, France, as the World Climate Change Conference 2015 (COP21) continues at Le Bourget, December 12, 2015. Reuters Environmentalists demonstrate near the Arc de Triomphe in Paris, France, as the World Climate Change Conference 2015 (COP21) continues at Le Bourget, December 12, 2015. Reuters Environmentalists demonstrate near the Arc de Triomphe in Paris, France, as the World Climate Change Conference 2015 (COP21) continues at Le Bourget, December 12, 2015. Reuters Activists form a giant red line during a demonstration on the Avenue de la Grande armee boulevard in Paris on December 12, 2015, as a proposed 195-nation accord to curb emissions of the heat-trapping gases that threaten to wreak havoc on Earth's climate system is to be presented at the United Nations conference on climate change COP21 in Le Bourget, on the outskirts of Paris ALAIN JOCARD/AFP/Getty Images The slogan \"No Plan B\" is projected on the Eiffel Tower as part of the World Climate Change Conference 2015 (COP21) in Paris, France, December 11, 2015. Reuters Earlier, France had released a rare joint statement with Italy and Germany that dismissed Mr Trump’s suggestion that the Paris accord could be altered. “We deem the momentum generated in Paris in December 2015 irreversible and we firmly believe that the Paris Agreement cannot be renegotiated since it is a vital instrument for our planet, societies and economies,” the leaders of the three countries said. The EU's top climate change official, Miguel Arias Canente, said in a statement that Mr Trump's decision to leave the Paris accord made it \"a sad day for the global community,\" adding that the bloc \"deeply regrets the unilateral decision.\" UN Secretary-General Antonio Guterres called the US withdrawal \"a major disappointment\" and said it was \"crucial that the US remains a leader on environmental issues,\" according to his spokesman. In November, Fiji's Prime Minister Voreqe Bainimarama will be in Germany to chair the UN's annual climate summit. He said Mr Trump's decision was a grave disappointment for places like his Pacific island nation and US coastal cities like New York and Miami that are vulnerable to climate change. He said he was deeply disappointed by Mr Trump's decision and did what he could to try to persuade Mr Trump to stick with the agreement as nations tackle \"the greatest challenge our planet has ever faced\". He said he was convinced the US will eventually rejoin. Before Mr Trump announced his decision Thursday afternoon, Chinese Premier Li Keqiang told reporters during a visit to Berlin that fighting global warming was a \"global consensus\" and an \"international responsibility.\" Japan, Australia, New Zealand and South Korea also regretted the US move and reiterated their commitment to implement the agreement. Speaking in Tokyo the Japanese finance minister, Taro Aso, angrily suggested the decision showed America's chronic failure to commit. He compared Mr Trump's move to America's historic role in establishing the abortive League of Nations after the First World War. He described a pattern of the US helping set up initiatives before dropping out of them, adding: \"I think that's just how they are.\" or register with your social account Already have an account? Log in News World Europe Greg Wilford after Donald Trump announced America would withdraw from the Paris climate change agreement.    12 show all    1/12 2/12 3/12 4/12 5/12 6/12 7/12 8/12 9/12 10/12 11/12 12/12 Please enter an email address Email address is invalid Email cannot be used. Try another   ", "source": "www.independent.co.uk", "title": "Emmanuel Macron offers refuge to American climate scientists after Donald Trump takes US out of Paris climate deal"}