{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window Ministers say they do not know if the Queen's Speech can be delivered on time because of post-election talks between the Conservatives and the Democratic Unionist Party. The set-piece event is scheduled to take place on Monday 19 June. Earlier, sources said it would be delayed - but First Secretary of State Damian Green said he \"can't confirm anything yet\". Labour said the government was \"in chaos\". Mrs May is meeting her backbench MPs for the first time since losing the Tories' majority in Thursday's general election. The Queen's Speech is written by the government and presents an outline of its planned legislation for the next Parliamentary session. Mr Green cited the ongoing negotiations with the DUP when he was asked if next Monday's speech had been delayed. \"I can't confirm anything yet until we know the final details of the agreement,\" he said. \"We know those talks are going well and also we know that, at this very important time, we want to produce a substantial Queen's Speech.\" BBC assistant political editor Norman Smith said there was an \"ambiguity\" about both what would go in it - with several manifesto pledges expected to be watered down or dropped - but also the need for the Tories to \"nail down\" DUP support. A defeat for its Queen's Speech would be tantamount to a vote of no confidence in the new minority government, he said. One of the reasons for the delay is also believed to be because the speech has to be written on goat's skin parchment, which takes a few days to dry - and the Tory negotiations with the DUP mean it cannot be ready in time. Although it is rare for a Queen's Speech to be delayed, when the Conservatives and Lib Dems formed a coalition government in 2010, it did not take place until 20 days after the general election while in 1992 nearly a month elapsed between polling day and the government announcing its new programme. Lib Dem leader Tim Farron said: \"This is an utter humiliation for Theresa May. It is time to stop trying to cling to power and time to admit enough is enough.\" Meanwhile, the backbench 1922 Committee is expected to raise concerns about the PM's leadership style, and press for more details on talks with the DUP. The committee is made up of all Conservative backbenchers - the name is taken from the year in which its original members were elected. Its primary function is to keep the leadership of the party informed of the mood among the rank and file, and if a Conservative leader or other senior figure loses its support they could be in a particularly vulnerable position. Mrs May's new cabinet also met for the first time after a reshuffle. Earlier Brexit Secretary David Davis predicted some parts of the Tory manifesto would have to be \"pruned\" following the election result. Speaking on BBC Radio 4's Today programme, Mr Davis said that while the Tory election campaign had been disappointing, Mrs May was a \"formidable prime minister\" and accused people speculating about her leadership of \"the absolute height of self-indulgence\". But Labour leader Jeremy Corbyn has accused Mrs May of \"squatting\" in No 10, telling the BBC's Andrew Marr Show on Sunday that the country \"cannot go on with a period of great instability\". On Sunday evening the PM finalised her cabinet with a small reshuffle, with Michael Gove returning to a ministerial role as environment secretary. Mr Gove, who took on Mrs May for the party leadership after David Cameron quit, was sacked by the PM in her reshuffle in July last year. A number of high-profile members kept their posts in the reshuffle, with Philip Hammond staying at the Treasury, Boris Johnson remaining at the Foreign Office and Amber Rudd keeping the Home Office brief. But some changed jobs too, with Liz Truss being demoted from justice secretary to become chief secretary to the Treasury. Mr Green, who was work and pensions secretary, was promoted to become the first secretary of state - effectively Mrs May's second in command. Analysis by BBC political correspondent Iain Watson Widespread demands for Mrs May to go are not expected at Monday's 1922 Committee meeting. Instead, there will be demands for her to consult more, including meeting regularly with the 1922 executive, and to turn Downing Street from a bunker into an open house by broadening her range of staff. However, few MPs expect her position to be strong and stable for the next five years. One senior backbencher told me: \"It is inconceivable she will lead the party into the next election. Her authority has been diminished unquestionably.\" Another said: \"Party members have been too bruised by her.\" \"She has bought herself some time\", said another senior backbencher, but added: \"How she behaves will determine how long she's there.\" There is a feeling that the party is holding on to nurse for fear of something worse. Read more from Iain Watson here. After speculation in the Sunday newspapers that he was mounting a leadership challenge, Mr Johnson has called for Tory MPs to back Mrs May. Writing in Monday's Sun, the foreign secretary said those calling for the PM to step down should \"get a grip\", adding the electorate wanted the government to \"get on with the job\". Mr Johnson admitted the prime minister's election campaign did not go well - \"to put it mildly\" - and that Tory messages \"got lost or misunderstood\". But he added: \"Theresa May led a campaign that inspired 13.7m people to vote Conservative, in the biggest total tally of Tory votes since the days of Margaret Thatcher. \"That is a stunning achievement, for which she deserves the support of her party. And she will certainly get it from me.\" He also said the proposal of a deal with the DUP to keep her minority government in power was \"feasible\". \"The people of Britain have had a bellyful of promises and politicking,\" he wrote. \"Now is the time for delivery - and Theresa May is the right person to continue that vital work.\" The return of Mr Gove to the front bench as environment secretary has been a shock to some, including the politician himself. Speaking to Sky News on Sunday, he said he had been \"quite surprised\" to be asked to rejoin the cabinet. He added: \"Of course I knew that today was reshuffle day, but I genuinely didn't expect this role - although I am delighted to be part of the government, and delighted to be able to support Theresa.\" However, the BBC's environment analyst Roger Harrabin said green campaigners were angry at Mr Gove's appointment, pointing to his time as education secretary, when he tried to remove climate change from the geography curriculum, and as chief whip, when he reportedly blocked the then environment secretary from important international talks. Green Party co-leader Caroline Lucas said: \"It is hard to think of many politicians as ill equipped for the role of environment secretary as Michael Gove.\" But others have welcomed the new minister. One senior farming industry source said they were happy that a \"big hitter\" was taking the top job at the Department for Environment and Rural Affairs (Defra). \"Defra has long been a backwater, so at last it's not someone in charge who is being put out to grass,\" he said. Mr Gove promised to \"protect our precious environment\" in his new role. Get news from the BBC in your inbox, each weekday morning  comments  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nReuters Image copyright Reuters Image caption The Queen's Speech will not be taking place, as planned, on 19 June Image copyright\nGetty Images Image copyright Getty Images Image caption Theresa May has chaired her first meeting of cabinet colleagues since the election Media caption Media caption Media caption    Image copyright\nReuters Image copyright Reuters Image caption Mr Johnson has denied plans to try to take over from Mrs May  Image copyright\nGetty Images Image copyright Getty Images Image caption Mr Gove is returning to cabinet after being fired by Mrs May last year  ", "source": "www.bbc.co.uk", "title": "Queen's Speech faces delay as DUP talks continue"}