{"text": "By HEATHER BROOKEJUNE 14, 2017 LONDON — Helicopters are not unusual in London, but the intense buzzing from the sky at 5 a.m. roused me early. From my balcony, I could see a huge plume of smoke billowing up from behind trees. It came from a blaze at Grenfell Tower, a 24-floor residential building, not far from where I live in West London. The authorities declared it a major incident as more than 200 firefighters battled the fire, with an unknown number of people trapped inside. As the day went on, the scale of the horror became apparent. The death toll rose from six to at least 12, with scores of people needing hospital treatment and some in critical care. There were reports of people jumping from windows to escape the smoke and flames, and of a baby caught by a bystander after being dropped from high above. It soon emerged that residents had previously raised questions about fire safety in the building, which was home to about 120 families. The Grenfell Action Group, a community organization, had published a series of blog posts about their grievances with the Kensington and Chelsea Tenant Management Organization, the company that runs the building on behalf of the local authority, the Royal Borough of Kensington and Chelsea. One post from November 2016, starkly titled “KCTMO: Playing With Fire,” chillingly suggested that “only a catastrophic event will expose the ineptitude and incompetence of our landlord.” The group’s complaints about fire safety go back to 2013. Whether the borough listened to and acted on these warnings will be examined in the days to come. One thing the local government did do, reportedly, was have its in-house lawyer send a letter in 2013 to the blog’s author alleging defamation and harassment, and demanding the removal of several posts. Advertisement The regeneration of social housing using a mixture of public and private ownership began under Tony Blair’s Labour government and continues today. It is an issue fraught with strong feelings about politics and class, but in London the root of it is a city where the population is growing fast but the housing supply is not keeping pace. Added to this, the world’s superrich are choosing London real estate as a place to park their millions. Prices for private houses and apartments have skyrocketed. Advertisement While the average price of a property in Britain is £220,000 ($281,000), in Kensington and Chelsea homes go for £1.4 million (about $1.8 million) on average. The borough has the worst ranking in London for its rent-to-earnings ratio, according to a study by the New Policy Institute. Yet local authorities still have an obligation to house vulnerable people, even though councils face caps on the amount they can borrow. This leaves local governments severely limited in their capacity to manage their housing stock. As a result, most councils have looked to the private sector for support. Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. View all New York Times newsletters. Kensington and Chelsea is one of the most affluent boroughs of London, home to many museums, galleries and embassies. But walk to Ladbroke Grove, my neighborhood, and the demographics shift noticeably. Most of the borough’s poor are concentrated in North Kensington, where Grenfell Tower and a majority of social housing stand. The company that manages Grenfell Tower is a nonprofit that is, in theory, run by and for residents of the thousands of buildings it manages in London. But only eight of the 15 board members are residents (the other seven are council appointed or independent), while repairs and maintenance are contracted out to another private company. The council, the ultimate owner of these buildings, has a close relationship with the management company, which the Grenfell Action Group sees as an unresponsive buffer. Residents’ concerns, the group says, have consistently been ignored and suppressed. The English system of local government is hard to navigate, and opportunities for citizens to engage meaningfully with decision makers are not plentiful. A paternalistic “we know best” attitude often prevails, and even basic information is available only through freedom-of-information requests. Until 2005, when the Freedom of Information Act came into force, it was illegal to disclose fire inspection reports to the public. Even today, those reports can be obtained only by written request under the freedom-of-information law. In another sign of this “trust authority” mind-set, official instructions to Grenfell residents were to “stay put” in the event of a fire. Fortunately, most people ignored that and fled. These are turbulent times in Britain, and the fire at Grenfell Tower touches on many of the issues that are riling people. Over the past decade, a series of events have demolished the trust citizens once had in officialdom: the financial crash of 2008, the scandal of parliamentary expenses and the chaos in government following the Brexit referendum. Advertisement Amid this dissatisfaction with the status quo, voters in Kensington — a constituency once staunchly Conservative — elected their first ever Labour member for Parliament last week. Today, the Grenfell disaster looks like yet another of these “trust us, we’ll look after you” promises that officialdom fails to keep. Although digital technology, through blogs and social media, has created new ways for citizens like those of the Grenfell Action Group to represent their rights and interests, the traditional way of doing politics looks more archaic and undemocratic than ever. The question is always, Who has the right to know? Truly empowered individuals don’t have to wait passively to receive what information officials choose to give them. They can ask their own questions — and get answers. The residents of Grenfell did not have that power. And this is what must be remedied, not just in Kensington and Chelsea but in every institution that calls itself democratic. This is the end of the “stay put” citizen. Heather Brooke (@newsbrooke) is a professor of journalism at City University, London, and the author, most recently, of “The Revolution Will Be Digitised.” Follow The New York Times Opinion section on Facebook and Twitter (@NYTopinion), and sign up for the Opinion Today newsletter. A version of this op-ed appears in print on June 15, 2017, on Page A25 of the New York edition with the headline: An Inferno Of Public Trust.  Today's Paper|Subscribe We’re interested in your feedback on this page. Tell us what you think. See More » Supported by Opinion | Op-Ed Contributor  By HEATHER BROOKE HEATHER BROOKE Share This Page Photo Flames engulfing the Grenfell Tower apartment building in London on Wednesday. Credit\n            Toby Melville/Reuters Credit New York edition Today's Paper|Subscribe Today's Paper| | Subscribe U.K. Asks, Who Pays to Prevent Another Grenfell Tragedy? Grenfell Fire Inquiry Finds U.K. Construction Rules Dangerously Lax Grenfell Tower Fire Killed 71, British Police Say London Art Auction for Grenfell Fire Survivors Raises $2.5 Million In Grenfell Inquiry, U.K. Weighs 2 Types of Manslaughter Charge Questions Mount After Fire at Grenfell Tower in London Kills at Least 12", "source": "www.nytimes.com", "title": "London Fire Shows Why Britons Don’t Trust the System"}