{"text": "'The full impacts will take decades to play out, but once set in motion they could be hard to reverse' The Earth could be 1.5 degrees Celsius warmer than the late 1800s in just nine years, according to new research which suggests the aspirational Paris Agreement target is unlikely to be achieved. A paper in the journal Geophysical Research Letters said natural climate variations in the Pacific which change over a period of decades may have provided a “temporary buffer” to the effects of greenhouse gas emissions, reducing extreme events such as heatwaves. But this cycle, called the Interdecadal Pacific Oscillation (IPO), could be about to flip or may have already done so, sending temperatures higher for the next 10 to 20 years. Under the Paris Agreement, the world decided to “pursue efforts to limit the temperature increase to 1.5C above pre-industrial levels”. However, the researchers said the combination of a natural warming phase and human carbon emissions could see temperatures reach this point by 2026. Last year, the hottest on record for the third time in a row, was 1.1 degrees Celsius warmer than the average between 1850 and 1900, according to separate research by the Met Office and Nasa. That prompted Professor Gabi Hegerl, a world-leading climatologist at Edinburgh University, to warn that it was \"getting tight for avoiding dangerous climate change\". However the natural El Nino effect was estimated to have contributed about 0.2C to this figure. The IPO, described as ‘El Nino’s uncle’, affects the weather over a much longer period. In the paper, the researchers wrote the 21st century’s first decade had been “under the influence of a negative IPO phase”. “This may have provided a temporary buffer for the radiative forcing effect of continually rising atmospheric greenhouse gas concentrations on global temperatures,” they said. “It is therefore possible that a negative phase of the IPO since the turn of the century has cushioned the impacts of global warming on extreme events, such as heatwaves. “A turnaround of the IPO to its positive phase could initiate a period of accelerated warming over the next one or two decades. “This would likely lead to the Paris target of 1.5C being surpassed within the next decade.” Even without the effect of the IPO, the scientists said that global mean temperatures were expected to “pass the 1.5C warming mark within the next 10 to 15 years” under a ‘business-as-usual’ scenario for greenhouse gas emissions as a result of human activity. They suggested that, while world might go beyond the 1.5C target, it could still get back to that figure. “Equilibrating the Earth’s climate at 1.5C above the pre-industrial level will involve overshooting the target and then reducing atmospheric greenhouse gas concentrations and global temperatures on a net negative carbon emissions pathway,” the paper said. A group of emperor penguins face a crack in the sea ice, near McMurdo Station, Antarctica Kira Morris Amid a flood in Islampur, Jamalpur, Bangladesh, a woman on a raft searches for somewhere dry to take shelter. Bangladesh is one of the most vulnerable places in the world to sea level rise, which is expected to make tens of millions of people homeless by 2050. Probal Rashid Hanna Petursdottir examines a cave inside the Svinafellsjokull glacier in Iceland, which she said had been growing rapidly. Since 2000, the size of glaciers on Iceland has reduced by 12 per cent. Tom Schifanella Floods destroyed eight bridges and ruined crops such as wheat, maize and peas in the Karimabad valley in northern Pakistan, a mountainous region with many glaciers. In many parts of the world, glaciers have been in retreat, creating dangerously large lakes that can cause devastating flooding when the banks break. Climate change can also increase rainfall in some areas, while bringing drought to others. Hira Ali Smoke – filled with the carbon that is driving climate change – drifts across a field in Colombia. Sandra Rondon A river once flowed along the depression in the dry earth of this part of Bangladesh, but it has disappeared amid rising temperatures. Abrar Hossain Sindh province in Pakistan has experienced a grim mix of two consequences of climate change.\r\n“Because of climate change either we have floods or not enough water to irrigate our crop and feed our animals,” says the photographer. “Picture clearly indicates that the extreme drought makes wide cracks in clay. Crops are very difficult to grow.” Rizwan Dharejo A shepherd moves his herd as he looks for green pasture near the village of Sirohi in Rajasthan, northern India.\r\nThe region has been badly affected by heatwaves and drought, making local people nervous about further predicted increases in temperature. Riddhima Singh Bhati A factory in China is shrouded by a haze of air pollution. The World Health Organisation has warned such pollution, much of which is from the fossil fuels that cause climate change, is a “public health emergency”. Leung Ka Wa Water levels in reservoirs, like this one in Gers, France, have been getting perilously low in areas across the world affected by drought, forcing authorities to introduce water restrictions. Mahtuf Ikhsan One of the researchers, Dr Benjamin Henley, of Melbourne University, told the Carbon Brief website that it was too soon to say if the IPO had actually shifted, although there was some evidence from computer models that this would happen soon or had already begun. And he stressed trying to understand the natural cycle was a difficult business. “It remains a significant challenge to reliably predict long-term variations in ocean circulation, due to data limitations and the inherently chaotic nature of the ocean-atmosphere system,\" Dr Henley said. Scientists had long thought restricting global warming to 2C would avoid dangerous effects of climate change – heatwaves, droughts, floods, increased storms and rising sea levels. But the Paris Agreement introduced the 1.5C target amid suggestions that going beyond this level could lock in irreversible sea level rise caused by melting land ice in Antarctica and Greenland for centuries. Commenting on the research, Professor Richard Betts, a Met Office fellow and chair of climate impacts at Exeter University, said it was important to keep the paper’s conclusions “in perspective”. “We should not expect major impacts in 10 years’ time, but we should not be complacent either,” he wrote in an email to The Independent. “In the first year at 1.5C, events like flooding, drought and other extreme weather may not be very much different from now. “But as the world warms further, longer-term effects will become apparent, especially ongoing sea level rise as glaciers continue to melt. “The full impacts will take decades to play out, but once set in motion they could be hard to reverse.” The Intergovernmental Panel on Climate Change has commissioned an expert report into the effects of 1.5C of global warming, which is due to be published in 2018. Environment Ian Johnston Reuters    10 show all    1/10 2/10 3/10 4/10 5/10 6/10 7/10 8/10 9/10 10/10", "source": "www.independent.co.uk", "title": "Earth could hit 1.5 degrees of global warming in just nine years, scientists say"}