{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window Spotify now has more than 140 million active monthly users, but the music streaming firm is still deeply in the red. The Swedish firm had revenues of more than 2.9bn euros (£2.6bn) last year, up more than 50% compared with 2015. However, operating losses rose at nearly the same pace to 349.4m euros (£305.7m). Spotify is considering going public and listing on the stock market, so its latest figures will be under scrutiny. \"We believe we will generate substantial revenue as our reach expands and that, at scale, our margins will improve,\" the firm said. \"We will therefore continue to invest relentlessly in our product and marketing initiatives to accelerate reach.\" The clock is ticking for Spotify Spotify may bypass IPO and list directly on stock market Spotify reported a net loss of 539.2m euros (£471.6m), more than double the figure for 2015. Nevertheless the number of people listening to music on the platform continues to rise rapidly. Paying subscribers to its premium service, which does not have advertising, rose by 20 million to 48 million. Apple Music, a key competitor, now has 27 million subscribers, almost double the number 12 months ago. Unlike Spotify it does not offer a free tier. More than 30 million tracks are available on Spotify, which has signed deals committing it to to pay a minimum of 2bn euros in royalties to record companies over the next two years. Spotify raised more than $1bn from investors last year which it said would give it flexibility to expand regardless of the state of the stock market. Some of the terms are tied to the IPO, putting pressure on the company to go public.  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Image copyright\nEMMANUEL DUNAND/AFP/Getty Image copyright EMMANUEL DUNAND/AFP/Getty Image caption Taylor Swift has put her music back on Spotify", "source": "www.bbc.co.uk", "title": "Spotify hits more than 140 million users"}