{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window Levels of satisfaction with university \"value for money\" have fallen for the fifth year in a row, in a major annual study of student attitudes. Five years ago, 53% of students across the UK thought university was \"good\" or \"very good\" value - but this has now slumped to its lowest level of 35%. Students from England, who have the highest tuition fees in the UK, had the lowest opinions of value for money. The study also found students' \"wellbeing\" had declined. The Student Academic Experience Survey, from the Higher Education Policy Institute and the Higher Education Academy, tracks the views of students about their time in higher education, based on a sample of about 14,000 current students. It found perceptions of value for money had continued to fall - and that the number of students saying their university was \"poor\" or \"very poor\" value had almost doubled since 2012. Tuition fees have become an issue in the general election, with Labour promising to scrap fees in England, which otherwise would rise to £9,250 in the autumn. The Conservatives and the Liberal Democrats have defended the current system of fees and loans, where students do not make repayments until they are earning £21,000. Within the UK, in Scotland, where there are no tuition fees, 56% of students thought university was good or very good value for money, but this too was lower than last year. Among students from Wales, 47% thought university was good value and 42% in Northern Ireland. In England, only 32% of students thought their university represented good value. The report suggests that improving teaching quality is an important factor in whether students believe they are getting value for money. The study also shows a wide variation in the number of teaching hours - with subjects such as history having an average of eight hours per week, while medicine had 19 hours plus many more working hours outside of the classroom. Students on medicine and dentistry courses were the most likely to feel they were getting value for money, while social studies and business students were the most likely to feel they were not getting good value. There was a strong sense that universities were not doing enough to explain how tuition fees were spent - with only 20% of students saying they had received enough information. The annual study also examines wellbeing and happiness - and this has fallen to only 14% of students saying they were satisfied with their lives. There are also negative outcomes for students' sense of happiness and anxiety - with students having lower levels of wellbeing than young people outside of university. Young women and gay students at university are particularly likely to feel unhappy. Nick Hillman, director of the Higher Education Policy Institute, said the survey showed universities needed to \"think ever more deeply about how to respond to the individual characteristics of each student\". \"The survey shows students want universities to provide information on where fees go, taxpayers to cover more of the costs and policymakers to provide stronger arguments for future fee rises.\" By Sean Coughlan Education correspondent  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel  Image caption Students say they do not get enough information about how their tuition fees are spent", "source": "www.bbc.co.uk", "title": "Students say university 'value for money' falling"}