{"text": "Share this with Email Facebook Messenger Messenger Twitter Pinterest WhatsApp LinkedIn Copy this link These are external links and will open in a new window FBI Director James Comey has said it makes him \"mildly nauseous\" to think that he could have had an impact on the US presidential election. But Mr Comey said he thought concealing the discovery of new Hillary Clinton emails would have been \"catastrophic\". The comments came during a Senate panel on FBI oversight, in which Mr Comey faced tough questions about his inquiry into Mrs Clinton's private email use. Mr Comey added that \"even in hindsight I would make the same decision\". Hillary Clinton joins the 'Trump resistance' Russia: The scandal Trump can't shake The remarks are the FBI chief's first public explanation of why he reopened an investigation into Mrs Clinton's use of a private email server just days before last November's presidential election. FBI Director James Comey said concealing the fact that his agency had reopened its investigation into Hillary Clinton's private email server would have been \"catastrophic\". What he didn't say was that the reason it would have been so damaging is that the news would have leaked even if he had kept silent. In those final weeks before the election, some in the FBI clearly thought the Clinton investigation was being handled poorly and were expressing their views - and sharing details - on background to the media. This is the \"catastrophic\" scenario Mr Comey probably envisioned: He keeps mum, in keeping with FBI policy on investigations that could affect upcoming elections. The story comes out despite his silence. Mrs Clinton wins, as appeared likely at the time based on polls and prognosticators. Then the contents of the emails reveal misdeeds by now president-elect Clinton. It's not a stretch to think Mr Comey would view such developments as threatening the \"death of the FBI\", in his words - an outcome that had to be avoided at all cost, even if it helped put Donald Trump in the White House. \"It makes me mildly nauseous to think that we might have had some impact on the election,\" Mr Comey said on Wednesday. \"But, honestly, it wouldn't change the decision.\" Mr Comey added that failing to inform Congress would have been an \"act of concealment\". His testimony comes a day after Mrs Clinton once again blamed her surprise upset on Mr Comey's actions, as well as alleged meddling in the US election by Russian hackers. Russian media no longer dazzled by Trump \"If the election had been on October 27, I would be your president,\" she said in New York on Tuesday, referring to the day before Mr Comey notified Congress of the discovery of new emails. \"I was on the way to winning until a combination of Jim Comey's letter on October 28 and Russian Wikileaks raised doubts in the minds of people who were inclined to vote for me and got scared off.\" But President Donald Trump hit back online. \"FBI Director Comey was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds!\" he tweeted. \"The phony Trump/Russia story was an excuse used by the Democrats as justification for losing the election. Perhaps Trump just ran a great campaign?\" The FBI chief on Wednesday also revealed that Clinton emails containing classified information were forwarded to former congressman Anthony Weiner. \"They found thousands of new emails. They found classified information on Anthony Weiner,\" he said while under questioning from Democrat Senator Dianne Feinstein. \"Somehow, her [Mrs Clinton's]  emails were being forwarded to Anthony Weiner, including classified information, by her assistant Huma Abedin.\" Mr Weiner, a New York Democrat, was married at the time to Ms Abedin, a top Clinton aide. He was separately under investigation for inappropriate communications with an under-age girl. Mr Comey also faced sharp questions in Wednesday's hearing about Russia's alleged role in tilting the election in favour of Mr Trump. When asked whether the Kremlin was still meddling in American politics, Mr Comey responded: \"Yes\". \"I think one of the lessons that the Russians may have drawn from this is, 'this works',\" the FBI director said. Senator Lindsey Graham, who is part of a Senate investigation into alleged Russian interference, pressed Mr Comey about what kind of threat Russia presents. \"Certainly, in my view, the greatest threat of any nation on earth, given their intention and their capability,\" said the law enforcement chief. In March, Mr Comey confirmed during testimony before a House of Representatives panel the FBI had opened an investigation into Russia's suspected interference in the presidential election. Democrats have criticised Mr Comey for not revealing the investigation before the election as he had with Mrs Clinton. But the FBI head said he treated both inquiries \"consistently\".  Share this with Facebook  Share this with Twitter  Share this with Messenger  Share this with Messenger  Share this with Email Share These are external links and will open in a new window  Share this with Email  Share this with Facebook  Share this with Messenger  Share this with Messenger  Share this with Twitter  Share this with Pinterest  Share this with WhatsApp  Share this with LinkedIn Close share panel Media caption Image copyright\nReuters Image copyright Reuters Image caption Hillary Clinton has laid bare her disappointment at her election defeat to Donald Trump Image copyright\nTwitter Image copyright Twitter Image copyright\nTwitter Image copyright Twitter", "source": "www.bbc.co.uk", "title": "FBI head 'nauseous' over his possible sway on US election"}